-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\criminal_lilwayne_drug.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["criminal_lilwayne_drug"] = {
	name = "Лил Вэйн",
	model = "models/cityrp/pm/normal/male_01.mdl",
	namepos = 80,
	theme = "Default",
	scale = 1,
	submat = {
		[4] = "gbskins/outfit/top_36"
	},
	questNPC = true,
	pos = {},
	sequence = "lineidle01",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Да?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/1.mp3",
			["Answers"] = {
				{"Извините, кажется я вас с кем-то путаю.", "close",},
			},
		},
		[2] = {
			["Line"] = [[Да?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/2.mp3",
			["Answers"] = {
				{"Ты от Дезза?", 4,},
				{"А где Слим Шейди?", 5,},
				{"Тебе не кажется место встречи.. опасным?", 6,},
				{"Извините, кажется я вас с кем-то путаю.", 3,},
			},
		},
		[3] = {
			["Line"] = [[Ты от Дезза?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/3.mp3",
			["Answers"] = {
				{"Да.", 7,},
				{"Ты кто?", 8,},
				{"А где Слим Шейди?", 5,},
				{"Тебе не кажется место встречи.. опасным?", 6,},
			},
		},
		[4] = {
			["Line"] = [[Такой же вопрос.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/4.mp3",
			["Answers"] = {
				{"Да.", 7,},
				{"Ты кто?", 8,},
				{"А где Слим Шейди?", 5,},
				{"Тебе не кажется место встречи.. опасным?", 6,},
			},
		},
		[5] = {
			["Line"] = [[Занят. Ты от Дезза?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/5.mp3",
			["Answers"] = {
				{"Да.", 7,},
				{"Ты кто?", 8,},
				{"Тебе не кажется место встречи.. опасным?", 6,},
				{"Чем? Обычно он говорит, что делать.", 12,},
			},
		},
		[6] = {
			["Line"] = [[Нет. Ты от Дезза?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/6.mp3",
			["Answers"] = {
				{"Да.", 7,},
				{"Ты кто?", 8,},
				{"А где Слим Шейди?", 5,},
				{"За блок отсюда полицейский участок. Не напрягает?", 12,},
			},
		},
		[7] = {
			["Line"] = [[Отлично.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/7.mp3",
			["Answers"] = {
				{"Что нужно сделать?", 20,},
				{"А где Слим Шейди?", 9,},
				{"Тебе не кажется место встречи.. опасным?", 10,},
			},
		},
		[8] = {
			["Line"] = [[Лил Вэйн. Ты от Дезза?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/8.mp3",
			["Answers"] = {
				{"Да.", 7,},
				{"А где Слим Шейди?", 5,},
				{"Тебе не кажется место встречи.. опасным?", 6,},
				{"А, так это у тебя в подвале два жучка стоит!", 13,},
			},
		},
		[9] = {
			["Line"] = [[Занят.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/9.mp3",
			["Answers"] = {
				{"Как скажешь. Что нужно сделать?", 20,},
				{"Чем? Обычно он говорит, что делать.", 11,},
				{"Тебе не кажется место встречи.. опасным?", 10,},
			},
		},
		[10] = {
			["Line"] = [[Нет.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/10.mp3",
			["Answers"] = {
				{"Как скажешь. Что нужно сделать?", 20,},
				{"А где Слим Шейди?", 9,},
				{"За блок отсюда полицейский участок. Не напрягает?", 11,},
			},
		},
		[11] = {
			["Line"] = [[Много разговоров.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/11.mp3",
			["Answers"] = {
				{"Как скажешь. Что нужно сделать?", 20,},
				{"Ты имеешь в виду меня?", 17,},
				{"Ты имеешь в виду себя?", 18,},
			},
		},
		[12] = {
			["Line"] = [[Много разговоров. Ты от Дезза?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/12.mp3",
			["Answers"] = {
				{"Да.", 7,},
				{"Ты имеешь в виду меня?", 17,},
				{"Ты имеешь в виду себя?", 18,},
			},
		},
		[13] = {
			["Line"] = [[Вот как.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/13.mp3",
			["Answers"] = {
				{"Упс..", 14,},
			},
		},
		[14] = {
			["Line"] = [[Ты кто? Ты с кем?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/14.mp3",
			["Answers"] = {
				{"Я от Дезза.", 16,},
				{"Подумай.", 15,},
			},
		},
		[15] = {
			["Line"] = [[Уходи.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/15.mp3",
			["Answers"] = {
				{"Постой..!", "MQS Continue quest",},
			},
		},
		[16] = {
			["Line"] = [[Много болтовни.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/16.mp3",
			["Answers"] = {
				{"Ты имеешь в виду меня?", 17,},
				{"Ты имеешь в виду себя?", 18,},
			},
		},
		[17] = {
			["Line"] = [[Да.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/17.mp3",
			["Answers"] = {
				{"Как скажешь. Что нужно сделать?", 20,},
			},
		},
		[18] = {
			["Line"] = [[...]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/18.mp3",
			["Answers"] = {
				{"Забей. Что нужно сделать?", 20,},
				{"Ну?", 19,},
			},
		},
		[19] = {
			["Line"] = [[Ладно.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/19.mp3",
			["Answers"] = {
				{"Что?", 26,},
				{"Ты наконец ответишь на мои вопросы?", 26,},
				{"Ты меня пугаешь.", 26,},
			},
		},
		[20] = {
			["Line"] = [[Фух.. 

Раскинь товар по точкам. Товар в восьмом юните. Юниты в порту. Ключ от юнита в пакете. Пакет в клумбе. Клумба у госпиталя.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/20.mp3",
			["Answers"] = {
				{"Хорошо. Я работать.", "MQS Continue quest",},
				{"По каким точкам раскидывать?", 21,},
				{"Можешь дать совет для дела?", 22,},
				{"Почему ты такой малословный?", 23,},
			},
		},
		[21] = {
			["Line"] = [[Ты знаешь. Контейнеры.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/21.mp3",
			["Answers"] = {
				{"Хорошо. Я работать.", "MQS Continue quest",},
				{"Порядок не важен? Сами точки тоже?", 23,},
				{"Можешь дать совет для дела?", 22,},
				{"Почему ты такой малословный?", 23,},
			},
		},
		[22] = {
			["Line"] = [[Тебе пригодится машина. Или знание канализации. Ещё лучше - и то и то.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/22.mp3",
			["Answers"] = {
				{"Хорошо. Я работать.", "MQS Continue quest",},
				{"По каким точкам раскидывать?", 21,},
				{"Что, если со всем этим туго?", 23,},
				{"Почему ты такой малословный?", 23,},
			},
		},
		[23] = {
			["Line"] = [[..Очень. Много. Разговоров.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/23.mp3",
			["Answers"] = {
				{"Остынь. Я работать.", "MQS Continue quest",},
				{"Ты имеешь в виду меня?", 24,},
				{"Ты имеешь в виду себя?", 25,},
			},
		},
		[24] = {
			["Line"] = [[Да.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/24.mp3",
			["Answers"] = {
				{"Как скажешь. Я работать.", "MQS Continue quest",},
			},
		},
		[25] = {
			["Line"] = [[...]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/25.mp3",
			["Answers"] = {
				{"Забей. Я работать.", "MQS Continue quest",},
				{"Ну?", 19,},
			},
		},
		[26] = {
			["Line"] = [[Что ты хочешь узнать?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/26.mp3",
			["Answers"] = {
				{"Так что мне нужно сделать?", 27,},
				{"Где Слим Шейди?", 28,},
				{"Почему ты такой малословный?", 36,},
				{"Ты не боишься вести дела так близко к полицейскому участку?", 41,},
			},
		},
		[27] = {
			["Line"] = [[Развести наркотики. Варят много, выращивают тоже - рук не хватает всё транспортировать. Сбор в порту, там участок с билбордом - 'Self Storage'. В восьмом юните лежит всё, что нужно. Дополнительные инструкции на записке - точки дублированы там же. Выступать на своих двоих или на машине - твой выбор.

Однако, есть проблема: ключи от гаража лежат в пакете. Пакет пришлось сбросить у госпиталя, в клумбе. Его не найдут - ибо за мной идут, до сих пор. Главное не оборачивайся, и никто ничего не заподозрит.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/27.mp3",
			["Answers"] = {
				{"Спасибо. Я работать.", "MQS Continue quest",},
				{"Где Слим Шейди?", 28,},
				{"Поэтому ты такой малословный?", 36,},
				{"Ты не боишься вести дела так близко к полицейскому участку?", 41,},
			},
		},
		[28] = {
			["Line"] = [[Он занят другим районом. У каждого района - почти у каждого квартала - есть свой барыга и посредник. Посредник не барыги, а стоящего выше всех. Он даёт поручения, которые уже выполняют такие, как ты. Слим подменял меня, пока под меня копали копы. Там ещё проблемы на стороне были, но это так..]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/28.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Что за проблемы?", 29,},
				{"Почему ты такой малословный?", 36,},
				{"Ты не боишься вести дела так близко к полицейскому участку?", 41,},
			},
		},
		[29] = {
			["Line"] = [[Записки. Угрозы. Указания. Как если бы Дезз писал - у него наклонности схожие. Язык только другой. В смысле тоже английский, только это, скорее.. манера. Прям через текст чувствуются. Колдуны ебучие.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/29.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Как ты думаешь, кто это может быть?", 30,},
				{"Как работает иерархия?", 33,},
			},
		},
		[30] = {
			["Line"] = [[Это не копы. Может какой политик, корпорация там, кто-то из World Corp.. Точно не случайный шутник - такие вещи видно. Мы сейчас вряд ли узнаем, кому это нужно. А если узнаем, то проблемы не пропадут. Такие налетают стаей - один кидается, а остальные лыбятся.

И ждут, когда сами собой налетут. Инстинктами. Провокациями.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/30.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Так вот, кто мог жучок тебе поставить.", 31,},
				{"Как работает иерархия?", 33,},
			},
		},
		[31] = {
			["Line"] = [[Жучок? Прослушка?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/31.mp3",
			["Answers"] = {
				{"Ой..", 32,},
				{"Мне.. пришлось поставить прослушку у тебя в подвале.", 32,},
				{"Дезз боялся, что ты начнёшь болтать. Как вижу, его страх подтвердился.", 32,},
			},
		},
		[32] = {
			["Line"] = [[Не я один умею болтать и не умею следить за языком. ..Они знали. И Дезз это знает. Видишь ли, я болен - я не могу перестать разговаривать, если начну. Мне остановка даётся с большим трудом. Почти как.. логорея вроде называется, не знаю. Это кажется не лечится. Так бы мне уже помогли бы.

Наши своих не бросают. Очень даже жалуют. С такой компанией депрессию не заработать.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/32.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Как работает иерархия?", 33,},
			},
		},
		[33] = {
			["Line"] = [[Она как бы есть, и её как бы нет. Организация всего этого бизнеса работает только по той причине, что здесь нет одного единого лидера. Так бы его уже поймали бы. Или бы поймали кого-то поменьше по типу меня, и.. всех бы сдали. А так, ловят одиночек.

Всякие слушки про так называемых кладменов, их пропажу и сдачу ментам - мифы. Даже если Дезза поймают, то он буквально ничего не сможет сказать. Да и не захочет - он своих защищает. Этот нигер пиздец умный - как эти невозможные адвокаты из разных шоу. Что-то на 'С', может знаешь.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/33.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Кто такой Дезз?", 34,},
				{"Что за проблемы, о которых ты говорил?", 29,},
			},
		},
		[34] = {
			["Line"] = [[Очевидно, что он не барыга. В смысле он ведёт себя как такой, но только чтобы видеть что происходит своими глазами. Точно не ради ощущений - это не такой тип людей. Вот поэтому на него полиция и не обращает внимания - он слишком умный. Притворяется глупым.

Может, есть кто-то выше него. В самом мире уж точно, но вряд ли на районе. Я имею в виду весь Бруклин. ..Этот чел буквально везде. У него связи есть чтоб с радаров бежать, но я сомневаюсь что ему это нужно. Его тупо игнорируют. То ли дело Сутенёр-по-Имени-Прилизанный..

Завидую.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/34.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Кто такой 'Прилизанный'?", 35,},
				{"Что за проблемы, о которых ты говорил?", 29,},
			},
		},
		[35] = {
			["Line"] = [[Это.. особый случай. Сутенёр-по-Имени-Прилизанный - образ и имя. Вся эта фраза - имя. В смысле он в паспорте так же записан. Образ самолюбивого пупа земли. В какой-то мере синоним слова 'босс'. ..Не думаю, что я могу сказать больше, чем он сам.

Не пришло в- ..Не тяни меня за язык, а?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/35.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Вот теперь и думай, кто поставил жучок - он или Дезз..", 37,},
				{"Поэтому Дезз тебе и не доверяет.", 37,},
				{"Что за проблемы, о которых ты говорил?", 29,},
			},
		},
		[36] = {
			["Line"] = [[Скорее, наоборот - я нереально разговорчивый. С трудом сдерживаю себя, чтобы словесным Шейкспиром не стать. Нет, знаний у меня конечно не так для того много, но ты думаю понимаешь. Может даже понимаешь, что это за болезнь. Потому что доктора не знают.

Что-то, похожее на.. логорею. Точно не то, что-то другое. Это не лечится скорее всего.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/36.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Так вот чего у тебя в подвале прослушка стояла.", 37,},
			},
		},
		[37] = {
			["Line"] = [[Ты о чём?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/37.mp3",
			["Answers"] = {
				{"Ой..", 38,},
				{"Мне.. пришлось поставить прослушку у тебя в подвале.", 38,},
				{"Дезз боялся, что ты начнёшь болтать. Как вижу, его страх подтвердился.", 38,},
			},
		},
		[38] = {
			["Line"] = [[Не я один умею болтать и не умею следить за языком. ..Я не виню их - на месте кого-либо из них я бы поступал точно так же. Просто надеюсь, что до худшего не дойдёт. Я не боюсь сдохнуть - у меня на такие случаи всегда есть план, не впервой. Я боюсь сказать что-то не то и подставить Слима.

Слим Шейди за меня ручался. Он подтолкнул меня в этот бизнес. А я помогаю ему; Дезз ближе ко мне оказался. Шейди, с его деловой сдержанностью и навыками, не хватает сдержанного языка. Мне же его не хватает буквально, а не в эмоциональном и переносном смысле.

Может что-то и перевернулось, но я этого пока не вижу.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/38.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Слим говорит так же много, как и ты.", 39,},
				{"Ты в принципе не звучишь, как типичный уличный 'чел'.", 40,},
			},
		},
		[39] = {
			["Line"] = [[Говорить-то говорит, а много ли рассказывает? Он хотя бы раз упомянул что-то из того, о чём я заткнуться не могу? Вот и я о том же. Он утомляет своими беседами и.. 'фуфлогонством', а я слишком заинтересовываю всех вокруг, подряд и вне очереди.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/39.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Ты в принципе не звучишь, как типичный уличный 'чел'.", 40,},
			},
		},
		[40] = {
			["Line"] = [[Ты тоже не выглядишь, как потаскуха с телеэкранов и правительственных сайтов. 'Не суди книгу по обложке' - главный принцип для такой жизни и такого бизнеса. Жаль, что им не прониклось большинство. Может что-то поменялось бы в мире иначе. Без этих страданий и бесконечного плача.

Единицы что-то понимают. Мы не одни из них. Мы близки, и потому нас гасят. А кто не гасит, тот держит на расстоянии двухметровых палок. Боятся.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/40.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Слим говорит так же много, как и ты.", 39,},
			},
		},
		[41] = {
			["Line"] = [[Нет. Что они мне сделают? Два человека просто стоят и разговаривают. Мы же не в каком-нибудь романе Оруэлла, в конце концов. Я умею разговаривать с жандармами, несмотря на неспособность держать язык за зубами после провокации. ..Ну вот, как сейчас. Почти.

Не знаю, что это. Не знаю, лечится ли - доктора руками разводят. Это полицию не привлекает - они слишком пресмыкающиеся, ленивые, примитивные.. Они видят часто двигающийся рот, и просто пропускают его. Они думают, что рот не заткнётся и будет говорить вечно.

Зато это привлекает тех, кто умеет слушать.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/41.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Например?", 42,},
			},
		},
		[42] = {
			["Line"] = [[Например, World Corp. Ну и в принципе какую-либо компанию, которая не может предложить ничего, кроме пустых слов. Банки там, юристы эти, политики.. Такие мягкими перьями орудуют, а мы стальными. И мы все хороши там, где хороши. Даже без критики.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/42.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"А мы хороши в лазаньях по мусоркам?", 43,},
				{"Так вот, кто мог тебе прослушку поставить.", 44,},
			},
		},
		[43] = {
			["Line"] = [[Шутки шутками, а эта грязная работа очень прибыльная. Компания, которая собирает и перерабатывает мусор, имеет с такими как мы тесные связи. Потому никто не сообщает о какой-нибудь пропаже, и в контейнерах можно хранить всё, что душе угодно.

Например, наркотики. За дополнительную плату, их можно распространить по всему Нью-Йорку. У нас не единственный район, занимающийся этим. И никто с тем не может ничего сделать. Слишком прибыльный бизнес.

Иногда бомжи разбирают, но лишь иногда.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/43.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
				{"Теперь наводка про прослушку не такая точная..", 44,},
			},
		},
		[44] = {
			["Line"] = [[Прослушка?]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/44.mp3",
			["Answers"] = {
				{"Ой..", 45,},
				{"Мне.. пришлось поставить прослушку у тебя в подвале.", 45,},
				{"Дезз боялся, что ты начнёшь болтать. Как вижу, его страх подтвердился.", 45,},
			},
		},
		[45] = {
			["Line"] = [[Не я один умею болтать и не умею следить за языком. ..Кто бы то ни был, этот кто-то что-то знает. И Дезз знает. Сейчас не время нервничать - пора работать. Эта находка пока ни к чему точному или новому не приведёт.]],
			["Sound"] = "https://macnco.one/gmod/vo/wayne/drug/45.mp3",
			["Answers"] = {
				{"Спасибо. У меня есть ещё вопросы.", 26,},
			},
		},
	}
}