-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\criminal_slim_threat.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["criminal_slim_threat"] = {
	name = "Слим Шейди",
	model = "models/cityrp/pm/normal/male_06.mdl",
	namepos = 80,
	submat = {
		[4] = "gbskins/outfit/top_200",
		[8] = "gbskins/outfit/pants_200",
		[9] = "gbskins/outfit/boots_51"
	},
	theme = "Default",
	scale = 1,
	questNPC = true,
	pos = {},
	sequence = "lineidle04",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Чё надо?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/1.mp3",
			["Answers"] = {
				{"Ничего. Я пойду.", "close",},
			},
		},
		[2] = {
			["Line"] = [[Ну, чё стоишь? Чё надо?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/2.mp3",
			["Answers"] = {
				{"Что-то случилось?", 7,},
				{"Вау. Обычно ты начинаешь только с последних двух слов. Что случилось?", 3,},
				{"Ничего. Я пойду.", 5,},
			},
		},
		[3] = {
			["Line"] = [[Да ты заебёшь каламбурить, ну! Рот бы те с цементом смешать..]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/3.mp3",
			["Answers"] = {
				{"Воу, спокойней. Это всего лишь шутка.", 6,},
				{"А Дезз одобрит? С таким ртом как у тебя, замешать он захочет далеко не меня.", 4,},
			},
		},
		[4] = {
			["Line"] = [[Мы так и будем письками мериться? Еси бабки рубить не хошь, то так и скажи. Рук в этом городе как бет- ..Сука, не нервируй!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/4.mp3",
			["Answers"] = {
				{"Да ладно тебе, хохма ведь. Выдел бы ты своё лицо..", 6,},
				{"Да ну видно же, что тебе нечего ответить!", 5,},
			},
		},
		[5] = {
			["Line"] = [[Не, атас. Пиздуй отсюда.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/5.mp3",
			["Answers"] = {
				{"Постой..!", "MQS Fail quest",},
			},
		},
		[6] = {
			["Line"] = [[Херовые у тебя шутки. Не, внатуре - ты хоть понимаешь, к чему вся эта херня? Почему я тя спрашиваю, как будто тя не знаю? Чё я нервный такой, а? Не доходит? Да потому что тут уши в каждом кирпиче есть! Все друг друга мочат; туман войны при полном взгляде, ёмоё! Организация сама собой разваливается..]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/6.mp3",
			["Answers"] = {
				{"Я понимаю.", 8,},
				{"И поэтому ты болтаешь об этом так громко и в открытую? При кирпичных стенах?", 5,},
			},
		},
		[7] = {
			["Line"] = [[Да дурачьё опять думает, что умнее всех. Не, тута не прям дурачьё, но.. Как бы тебе сказать.. Есть челик дохуя умный, но это в обе стороны. Он бы точно процитировал ту самую книгу, как там оно говорилось.. 'У тебя слишком маленький словарный запас, чтобы убедить меня' - и в ответ 'а у тебя слишком мелкий склад ума, чтобы понять нас'.

Вот я хз как пояснить. Обычно он как второй отвечун, а ща как первый ся ведёт. Ну ничем от мяса не отличается; нигер мочит нигера, мусора подставляют мусоров.. Ситуация мутная слишком. Понимаешь, о чём я?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/7.mp3",
			["Answers"] = {
				{"Понимаю.", 8,},
				{"Так вот, чего тебя на философию пропёрло - ты гей!", 3,},
			},
		},
		[8] = {
			["Line"] = [[Да ничего ты не понимаешь! Будь у тя хоть какое-то понимание, то у тебя одна нога была-б уже где-нить на Таити. Выйти из игры сложно. ..Да и никто особо не хочет - жизнь говорит 'сосите', и их с концами засасывает. Все зациклились на одном и том же: 'ща заработаю, и всё', 'ща поварю чуток, и всё'. Как с наркотой - ну нет выхода, и всё!

Ну а некоторые такие думают, что есть. Не, типа окей, свобода мысли, но работа есть работа - наказывать надо за самоволку. Вот один челик как раз думает что наебёт систему, корешей подначивает - меня в том числе. Снял хату в частном секторе, делает вид что сам нормалды.. Но нет.

Там не просто дом, а с подвалом. И в окна-то зырки залезут, а с подземкой не понятно. Понимаешь, к чему я?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/8.mp3",
			["Answers"] = {
				{"Что нужно сделать?", 9,},
			},
		},
		[9] = {
			["Line"] = [[Ля, не правильно это всё. Не по понятиям. ..Чесслово, в голову ничё не лезет. Другие такие визиты ещё ладно - даж если-б меня за фуфлогонство прессанули, эт-б понятно. Ток то прикрытие, а тут.. Кажись Дезз прав. И кажись надо по его задуме поступать.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/9.mp3",
			["Answers"] = {
				{"Успокойся. Что предложил Дезз?", 10,},
			},
		},
		[10] = {
			["Line"] = [[Он жучок хочет заныкать. Ну ровный же пацан там - никого не палил, ничего не мутил, тупо сныкаться хочет. Но нихуя! Дезз тоже мног чё хочет - прозрачности и нулевой продажности. Не, ну посмотри чё ща творится - ща каждый так закрыться хочет, постоянно мочилово происходит, и чё? На каждого тратиться терь?

Мы и так в убыток идём из-за всей этой шумихи. Вот чем мы отличаемся от блохастых в форме? ..Пиздец, я уже как он звучу. Надо с этим быстрее разбираться, а я тут тя гружу. В общем - дело есть, прослушка есть. Отмычки нет, но эт на тебе уже. Прихабарься в хозяйственном.

А, и постарайся по-тихому - не дай ся спалить. Нам не хватало ещё подвальной жизни вместо пряток.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/10.mp3",
			["Answers"] = {
				{"Хорошо, тогда пойду займусь.", 13,},
				{"Что, если кто-то будет дома? И вообще не будет выходить?", 11,},
				{"Можешь дать совет для дела?", 12,},
			},
		},
		[11] = {
			["Line"] = [[Ля, ты гангстер или колбастер? Сделай вид что шмот осваиваешь, обчищаешь сё! Или одежду презентабельную достань и притворись кем поумнее нигера - с телевизора. Главное не дай челу или его корешам подвал осмотреть. Ну и трупов не делай - какой прок от железки, еси слушать не за кем?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/11.mp3",
			["Answers"] = {
				{"Логично. Я за дело.", 13,},
				{"Можешь дать совет для дела?", 12,},
			},
		},
		[12] = {
			["Line"] = [[Там район для таких как мы опасный, ибо соседский дозор настоящий. Тя спалить могут ещё на пороге - совсем-ж не людно ведь. Ну, не мне об этом думать - мне успокоиться надо. Уж извиняй, нервы в ахуе.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/12.mp3",
			["Answers"] = {
				{"Логично. Я за дело.", 13,},
				{"Что, если кто-то будет дома? И вообще не будет выходить?", 11,},
			},
		},
		[13] = {
			["Line"] = [[Стопэ, секу! Мне неудобно о таком просить, но мы можем встретиться как закончишь? Из первых уст хочется услышать, понимаешь? Я ждать буду в переулке, напротив дайнера.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/13.mp3",
			["Answers"] = {
				{"Да. До встречи.", "MQS Continue quest",},
				{"Не совсем. Ты из-за друга так беспокоишься?", 14,},
				{"Не совсем. Объясни.", 15,},
			},
		},
		[14] = {
			["Line"] = [[Э-э.. ну да, да. Лан, давай расходиться уже.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/14.mp3",
			["Answers"] = {
				{"Давай, до встречи.", "MQS Continue quest",},
				{"..Точно? Или ты из-за Дезза нервничаешь?", 15,},
			},
		},
		[15] = {
			["Line"] = [[Сушай, ну давай об этом потом?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/15.mp3",
			["Answers"] = {
				{"Хорошо. До встречи.", "MQS Continue quest",},
				{"Нет. Говори, сейчас же.", 5,},
			},
		},
		[16] = {
			["Line"] = [[Ну чё там?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/16.mp3",
			["Answers"] = {
				{"Жучок на месте.", 17,},
				{"Жучок на месте. Только, есть момент.. там стоял ещё один.", 23,},
			},
		},
		[17] = {
			["Line"] = [[И ничё? Сё нормально?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/17.mp3",
			["Answers"] = {
				{"Да. Всё нормально.", 18,},
				{"Не совсем. Там стояла ещё одна прослушка.", 23,},
			},
		},
		[18] = {
			["Line"] = [[Ох ты ж блять.. Значит, зря волновался. Пиздец, уже перепугался как шлюха Бродвейская. Кароч, спасибо.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/18.mp3",
			["Answers"] = {
				{"Удачи.", "MQS Continue quest",},
				{"А чего ты так беспокоишься?", 19,},
				{"..Не, постой, из головы вылетело - там стояла ещё одна прослушка.", 23,},
			},
		},
		[19] = {
			["Line"] = [[Да ну кореш же мой, ну? Не просто кореш, это больше. Не подумай не правильно, тут без гейства - за брата тупо боязно, душа болит. Это как во всех тех умных книжках, только в реале, ну? Нам надо друг за друга держаться, а тут такое! Был бы это ещё чухан какой.. Ёбаный в рот, Лил Вэйна то за что?

Пацантрелло ровный, а шугают как крысу какую-то. Врагов у него ноль! Вот нахер мы это делаем? Вот кому это нужно?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/19.mp3",
			["Answers"] = {
				{"Не знаю.", 20,},
				{"Не знаю. Может, тому, кто поставил второй жучок?", 22,},
			},
		},
		[20] = {
			["Line"] = [[Ай, ладно.. Тут муть слишком мутная. Как-нить выкрутимся, как-нить всех соберём, и как-нить эта хуйня закончится.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/20.mp3",
			["Answers"] = {
				{"Как-нибудь. Удачи.", "MQS Continue quest",},
				{"Что будешь делать?", 21,},
			},
		},
		[21] = {
			["Line"] = [[Слушай, ну ты далеко не лезь, а? Мы знакомые, а не друзья. Знай своё место, ну? ..Думать буду, чё ещё остаётся?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/21.mp3",
			["Answers"] = {
				{"Как скажешь. Удачи тогда.", "MQS Continue quest",},
				{"Остаётся выяснить про второй жучок.", 22,},
			},
		},
		[22] = {
			["Line"] = [[Ты- ..Блять, ты-

Какого хера? Сука, такую деталь упускаешь! Будто специально чувств ждёшь, пидрила! Жизнь смолью обливается, а ты ещё так хуячишь! Бессердечная ты мразь, нахуя я тя просил ваще?!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/22.mp3",
			["Answers"] = {
				{"Прости. Глупо вышло с моей стороны. Я лучше пойду.", "MQS Continue quest",},
				{"Прости. Я тебе не доверяю, чтобы говорить всё сразу.", "MQS Continue quest",},
				{"С этим нужно к Деззу, а не к тебе. Ты всего лишь шестёрка. Это бизнес.", "MQS Continue quest",},
			},
		},
		[23] = {
			["Line"] = [[Блять..! А кто поставил? Мразь нашлась? Чё там в доме? Или херота ещё раньше пришла? ..Ай, забей, у меня уже нервы сдают. Второго жучка нет же больше?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/23.mp3",
			["Answers"] = {
				{"Он всё ещё стоит. Как-то не дошло.", 24,},
				{"Он всё ещё стоит. Мне за это не платили.", 24,},
				{"Он всё ещё стоит. Если снять, то вторая сторона об этом узнает.", 24,},
			},
		},
		[24] = {
			["Line"] = [[Справедливо. Чё не случись - к лучшему. Главное чтоб тя не видели. Ну и хуйня же.. Даж курить от этой всей дичи не хочется.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/24.mp3",
			["Answers"] = {
				{"Мне надо идти. Удачи.", "MQS Continue quest",},
				{"Чего ты так беспокоишься?", 25,},
				{"Надо об этом сказать Деззу.", 28,},
			},
		},
		[25] = {
			["Line"] = [[Да ну кореш же мой, ну? Не просто кореш, это больше. Не подумай не правильно, тут без гейства - за брата тупо боязно, душа болит. Это как во всех тех умных книжках, только в реале, ну? Нам надо друг за друга держаться, а тут такое! Был бы это ещё чухан какой.. Ёбаный в рот, Лил Вэйна то за что?

Пацантрелло ровный, а шугают как крысу какую-то! Врагов у него ноль! Вот кому это нужно? Кто мог такую хуйню натворить?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/25.mp3",
			["Answers"] = {
				{"Не знаю.", 26,},
				{"Не знаю. Может, Дезз?", 32,},
				{"Не знаю. Может, полиция?", 31,},
				{"Не знаю. Мне это не интересно.", 29,},
			},
		},
		[26] = {
			["Line"] = [[Ай, ладно.. Тут муть слишком мутная. Как-нить выкрутимся, как-нить всех соберём, и как-нить эта хуйня закончится.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/26.mp3",
			["Answers"] = {
				{"Как-нибудь. Удачи.", "MQS Continue quest",},
				{"Что будешь делать?", 27,},
			},
		},
		[27] = {
			["Line"] = [[Слушай, ну ты- ..Не, ты меня выручаешь, а я как целка выключаюсь. Респект тебе. Я думать буду, чё ещё остаётся? Вэйну говорить нельзя, Деззу тоже пока не стоит, мы и так не очень мутим в последнее время. Не, личное личным, а слежка это серьёзно.

Не подумай не правильно - я чист, он тоже, но это дохера поменять может. Зная Дезза..]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/27.mp3",
			["Answers"] = {
				{"Я его не знаю, и советовать тоже не знаю что. Удачи.", "MQS Continue quest",},
				{"Надо ему рассказать.", 28,},
			},
		},
		[28] = {
			["Line"] = [[Не, забей. Попозже, ну? Давай это пока нашим секретом останется?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/28.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Нет. Я расскажу Деззу.", "MQS Continue quest",},
				{"Вот теперь я подумываю над Таити..", "MQS Continue quest",},
			},
		},
		[29] = {
			["Line"] = [[Пиздец, твоему знакомому сердце смолью заливает, а ты.. Ладно, иди.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/29.mp3",
			["Answers"] = {
				{"Удачи.", "MQS Continue quest",},
				{"Надо об этом рассказать Деззу.", 30,},
			},
		},
		[30] = {
			["Line"] = [[Не, ваще не варик. Вэйну говорить нельзя. Деззу тоже пока не стоит, мы и так не очень мутим в последнее время. Не, личное личным, а слежка это серьёзно. Не подумай не правильно - я чист, он тоже, но это дохера поменять может. Зная Дезза..

Давай это пока нашим секретом останется?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/30.mp3",
			["Answers"] = {
				{"Как скажешь.", "MQS Continue quest",},
				{"Нет. Я расскажу Деззу.", "MQS Continue quest",},
				{"Вот теперь я подумываю над Таити..", "MQS Continue quest",},
			},
		},
		[31] = {
			["Line"] = [[Ваще.. ваще могут, вполне. Ебучие мусора! Ебучий комиссар, он слишком много знает! Вот тебе и друзей в этом мире заводить. Ты это, постарайся в ту же лужу не упасть - не привязывайся ни к кому. Респект те.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/31.mp3",
			["Answers"] = {
				{"Спасибо. Удачи.", "MQS Continue quest",},
				{"Что будешь делать?", 27,},
				{"Надо об этом рассказать Деззу.", 30,},
			},
		},
		[32] = {
			["Line"] = [[..Ля, а это мысль. Это в его стиле. Типа, знаешь, послание нам такое. Но нахера? Ты не проёбываешься случаем? Иль это мне, раз я его друже? Пиздец, что за жизнь.. Во что я нахуй ввязался, чё я сделал такого?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/32.mp3",
			["Answers"] = {
				{"Не знаю, вообще не знаю. Удачи.", "MQS Continue quest",},
				{"Что будешь делать?", 27,},
				{"Надо об этом сказать Деззу.", 33,},
			},
		},
		[33] = {
			["Line"] = [[А на кой, если это реально он? Не, даж еси не он, то тоже пока нельзя - Лил Вэйн ровный, я тоже, ты вродь тоже. Но Дезз такое может натворить, на что у меня словарного запаса описать не хватит.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/threat/33.mp3",
			["Answers"] = {
				{"Вам нужно поговорить. А мне нужно идти.", "MQS Continue quest",},
				{"Верю. Прости, мне нужно идти.", "MQS Continue quest",},
				{"Вот теперь я подумываю над Таити..", "MQS Continue quest",},
			},
		},
	}
}