-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\criminal_dezth_revelation.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["criminal_dezth_revelation"] = {
	name = "Дезз",
	model = "models/cityrp/pm/normal/male_01.mdl",
	submat = {
		[4] = "gbskins/outfit/top_19",
		[8] = "gbskins/outfit/pants_19",
		[9] = "gbskins/outfit/boots_3",
		[2] = "models/gmodbest/citizens/facemaps/van_facemap6"
	},
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "lineidle02",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[...]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "close",},
			},
		},
		[2] = {
			["Line"] = [[...]],
			["Sound"] = "",
			["Answers"] = {
				{"...", 3,},
				{"Здарова.", 3,},
				{"Зачем ты позвал меня сюда?", 4,},
				{"Это мой конец, не так ли?", 3,},
			},
		},
		[3] = {
			["Line"] = [[Знаешь, зачем мы здесь?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/3.mp3",
			["Answers"] = {
				{"Догадываюсь.", 4,},
				{"Нет.", 4,},
			},
		},
		[4] = {
			["Line"] = [[Символичное место. Мэрия и власть неразрывны. Криминал и власть - тоже.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/4.mp3",
			["Answers"] = {
				{"...", 5,},
				{"Я не понимаю, к чему ты клонишь.", 5,},
				{"Хватит разговаривать загадками.", 5,},
			},
		},
		[5] = {
			["Line"] = [[Не забывай, кто здесь главный. Я одобряю вашу прошлую инициативу, только лучше это обговаривать заранее. Ненависть - хорошее топливо, однако даже стакан воды способен утопить человека.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/5.mp3",
			["Answers"] = {
				{"Почему ты мне это говоришь?", 6,},
				{"Я тебя не ненавижу.", 7,},
				{"Слим не оставил мне выбора.", 8,},
				{"Почему это мы обязаны слушать тебя? Ты кто?", 9,},
			},
		},
		[6] = {
			["Line"] = [[Потому что разницы между пешкой и королём не так много. Это всё ещё игральные фигуры. Иллюзия перспективы. Подумай над этим, когда захочешь дотянуться до вершины.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/6.mp3",
			["Answers"] = {
				{"..Это всё?", 10,},
				{"Я тебя не ненавижу.", 7,},
				{"Слим не оставил мне выбора.", 8,},
				{"Почему это мы обязаны слушать тебя? Ты кто?", 9,},
			},
		},
		[7] = {
			["Line"] = [[Это не имеет значения. Ты человек. Я человек. Нам свойственно делать ошибки. Главное делать это не правилом, а исключением. В нашем деле человеческий фактор - слишком опасная переменная. 'Хочешь поймать преступника - думай, как преступник'; иррациональность сбивает с толку.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/7.mp3",
			["Answers"] = {
				{"..Это всё?", 10,},
				{"Почему ты мне это говоришь?", 6,},
				{"Слим не оставил мне выбора.", 8,},
				{"Почему это мы обязаны слушать тебя? Ты кто?", 9,},
			},
		},
		[8] = {
			["Line"] = [[Я знаю. Противоречивая личность. Я с ним уже поговорил, и он нисколько не поменялся после.. того события. Сам твердил, что нельзя привязываться - и привязался к тебе. Это не отменяет его мастерства, лишь добавляет пару трудностей к управлению.

Вас опасно ставить друг с другом. Иначе, сценарий с Вэйном повторится.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/8.mp3",
			["Answers"] = {
				{"..Это всё?", 10,},
				{"Почему ты мне это говоришь?", 6,},
				{"Я тебя не ненавижу.", 7,},
				{"Почему это мы обязаны слушать тебя? Ты кто?", 9,},
			},
		},
		[9] = {
			["Line"] = [[Тебе Лил Вэйн говорил об этом, не так ли? Его слов пока достаточно.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/9.mp3",
			["Answers"] = {
				{"..Это всё?", 10,},
				{"Почему ты мне это говоришь?", 6,},
				{"Я тебя не ненавижу.", 7,},
				{"Слим не оставил мне выбора.", 8,},
			},
		},
		[10] = {
			["Line"] = [[..В таком случае, тоже задам пару вопросов. По-твоему, правильно ли поступил Слим Шейди, когда занялся бомбой и предложил работу?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/10.mp3",
			["Answers"] = {
				{"Да. Око за око.", 11,},
				{"Наверное. Помогать ближнему надо, но вот такая помощь.. странная.", 14,},
				{"Нет. За него говорили эмоции, а не голова.", 15,},
				{"Затрудняюсь ответить.", 16,},
			},
		},
		[11] = {
			["Line"] = [[..Слепит весь мир. Как ты думаешь, что случится, если каждый ответит пощёчиной на пощёчину? Убийством на убийство? Ядерными боеголовками на ядерный удар? Иногда стоит принять этот удар и жить с этим. Иногда, чтобы ответить позже.

Единственная причина, почему вы ещё живы - в эпицентр попал детектив. Этот детектив копал под нас - под вас и под.. 'босса'. ..Хорошо, тогда что думаешь про Слима в целом?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/11.mp3",
			["Answers"] = {
				{"Мне нравятся его целеустремлённость и стратегичность.", 12,},
				{"Мне не нравятся его импульсивность с эскапизмом.", 17,},
				{"Затрудняюсь ответить.", 18,},
			},
		},
		[12] = {
			["Line"] = [[Насчёт второго готов поспорить. А первое качество у него действительно присутствует. Единственное качество, которым он лучше Лил Вэйна. Кстати о нём - что думаешь о нигере? Не кажется крысой?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/12.mp3",
			["Answers"] = {
				{"Нет. Ему просто не повезло. У всего есть более логичное объяснение.", 13,},
				{"Кажется. Он слишком замкнутый, за ним семимильный хвост из мусоров и в пять раз больше работы.", 19,},
				{"Трудно сказать сейчас.", 20,},
			},
		},
		[13] = {
			["Line"] = [[Верно. Он умер не за.. 'крысятничество'. Эта смерть - знак, для всех. Это напоминание о нашей смертности. О том, что действия имеют последствия. Наказание за мягкость и нерешительность. Ну и подтверждение психологии и предсказуемости Слима. Они направили его на меньшее зло.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/13.mp3",
			["Answers"] = {
				{"То есть, ты это всё продумал?", 21,},
			},
		},
		[14] = {
			["Line"] = [[Верность - хорошее качество. Только, ею не стоит окутывать голову.  Безмозглое следование приказам ведёт к слепой верности. Слепая верность ведёт к становлению Слимом Шейди. ..Посмотри на полицию. Посмотри, как поступает уличная шпана.

Они никогда не поднимутся выше по жизненной лестнице с таким подходом. Единственная причина, почему вы ещё живы - в эпицентр попал детектив. Этот детектив копал под нас - под вас и под.. 'босса'. ..Хорошо, тогда что думаешь про Слима в целом?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/14.mp3",
			["Answers"] = {
				{"Мне нравятся его целеустремлённость и стратегичность.", 12,},
				{"Мне не нравятся его импульсивность с эскапизмом.", 17,},
				{"Затрудняюсь ответить.", 18,},
			},
		},
		[15] = {
			["Line"] = [[Да. Если бы не одно 'но' - мы бы сейчас не говорили. Знаешь, почему вы живы? В эпицентр попал детектив. Этот детектив копал под нас - под вас и под.. 'босса'. ..Хорошо, тогда что думаешь про Слима в целом?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/15.mp3",
			["Answers"] = {
				{"Мне нравятся его целеустремлённость и стратегичность.", 12,},
				{"Мне не нравятся его импульсивность с эскапизмом.", 17,},
				{"Затрудняюсь ответить.", 18,},
			},
		},
		[16] = {
			["Line"] = [[Единственная причина, почему вы ещё живы - в эпицентр попал детектив. Этот детектив копал под нас - под вас и под.. 'босса'. Подумай над этим, для себя. ..Хорошо, тогда что думаешь про Слима в целом?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/16.mp3",
			["Answers"] = {
				{"Мне нравятся его целеустремлённость и стратегичность.", 12,},
				{"Мне не нравятся его импульсивность с эскапизмом.", 17,},
				{"Затрудняюсь ответить.", 18,},
			},
		},
		[17] = {
			["Line"] = [[Насчёт второго готов поспорить. А первое качество у него действительно присутствует. Единственное качество, которым он.. 'лучше' Лил Вэйна. Кстати о нём - что думаешь о нигере? Не кажется крысой?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/17.mp3",
			["Answers"] = {
				{"Нет. Ему просто не повезло. У всего есть более логичное объяснение.", 13,},
				{"Кажется. Он слишком замкнутый, за ним семимильный хвост из мусоров и в пять раз больше работы.", 19,},
				{"Трудно сказать сейчас.", 20,},
			},
		},
		[18] = {
			["Line"] = [[Он не такой сложный, как ты думаешь. Импульсивность и целеустремлённость - страшная комбинация. ..Посмотри на меня. Посмотри в мои глаза. Что ты видишь? Лил Вэйн видел именно эти качества. Кстати о нём - что думаешь о нигере? Не кажется крысой?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/18.mp3",
			["Answers"] = {
				{"Нет. Ему просто не повезло. У всего есть более логичное объяснение.", 13,},
				{"Кажется. Он слишком замкнутый, за ним семимильный хвост из мусоров и в пять раз больше работы.", 19,},
				{"Трудно сказать сейчас.", 20,},
			},
		},
		[19] = {
			["Line"] = [[Хорошо, что это видят все. Жаль, что это видишь и ты. Он умер не за.. 'крысятничество'. Эта смерть - знак, для всех. Это напоминание о нашей смертности. О том, что действия имеют последствия. Наказание за мягкость и нерешительность. Ну и подтверждение психологии и предсказуемости Слима. Они направили его на меньшее зло.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/19.mp3",
			["Answers"] = {
				{"То есть, ты это всё продумал?", 21,},
			},
		},
		[20] = {
			["Line"] = [[Это хорошо. Символизм нужно искать - он не должен быть виден сразу. Вэйн умер не за.. 'крысятничество'. Эта смерть - знак, для всех. Это напоминание о нашей смертности. О том, что действия имеют последствия. Наказание за мягкость и нерешительность. Ну и подтверждение психологии и предсказуемости Слима. Они направили его на меньшее зло.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/20.mp3",
			["Answers"] = {
				{"То есть, ты это всё продумал?", 21,},
			},
		},
		[21] = {
			["Line"] = [[Именно. Слово 'организация' придумали не просто так. Её нужно организовывать, держать в порядке и использовать. Не эксплуатировать, а использовать. Чтобы каждый добился своей цели. Лил Вэйн добился, например.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/21.mp3",
			["Answers"] = {
				{"В смысле добился? Он умер!", 22,},
			},
		},
		[22] = {
			["Line"] = [[Конечно. Он этого и хотел, с.. 'логореей' своей. Более того - он и собрал большую часть плана. Вэйн знал Слима лучше кого угодно - и знал, что на него повлияет. Правда, не знал, как; чем закончится. Мне будет не хватать советов Вэйна, хотя скучать по болтливости будет.. глупо.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/22.mp3",
			["Answers"] = {
				{"Так раз мы живы только из-за смерти детектива, то как это может быть планом? Звучит слишком случайно.", 23,},
			},
		},
		[23] = {
			["Line"] = [[Кто не рискует - ничего не получит. Кто всем рискует - всё потеряет. Мы рискуем только частью - ею не утопить организацию. К тому же, Слим уже сидел, ему на свободе туго; тюремные кадры очень хорошо ценятся. Что касается тебя.. что-ж, тебе повезло. Кто знает, что бы случилось, с твоим-то характером.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/23.mp3",
			["Answers"] = {
				{"Что будет дальше?", 24,},
			},
		},
		[24] = {
			["Line"] = [[Тебе решать. Можешь позадавать новых вопросов, а можешь просто уйти. Обещаю, что постараюсь удовлетворить твоё любопытство.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/24.mp3",
			["Answers"] = {
				{"Тогда я пойду.", 25,},
				{"У меня есть вопросы, рабочего характера.", 28,},
				{"У меня есть вопросы, личного характера.", 32,},
			},
		},
		[25] = {
			["Line"] = [[Перед тем, как ты уйдёшь.. Чего ты хочешь от этой жизни? Что побудило тебя заняться криминалом?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/25.mp3",
			["Answers"] = {
				{"Не знаю.", 26,},
				{"Деньги.", 26,},
				{"Отсутствие выбора.", 26,},
				{"Я лучше промолчу. Это личное.", 26,},
			},
		},
		[26] = {
			["Line"] = [[Любопытно. Что-ж.. я не верю, что кто-то косит под Тони Монтану от хорошей жизни. Всегда или та, или иная причина. А когда захочется выйти из игры.. Ты и так знаешь, что в таком случае происходит. Поэтому подогрею тебе интерес деньгами.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/26.mp3",
			["Answers"] = {
				{"...", 27,},
				{"Спасибо.", 27,},
				{"Мне не нужны твои деньги.", 27,},
			},
		},
		[27] = {
			["Line"] = [[..Кого не берут деньги - возьмёт символизм. Пушка Лил Вэйна. Всё это ждёт тебя в пакете, у выхода на крышу больших апартаментов. Когда закончишь - жди новых указаний. От Сутенёра-по-Имени-Прилизанный. Он твой новый 'босс'.

Настаёт чёрное время. Я бы даже сказал, нуарное. Мы вынуждены поменять стратегию, и на это нужно.. время. Не рыпайся и жди.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/27.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Спасибо.", "MQS Continue quest",},
				{"Как скажешь.", "MQS Continue quest",},
			},
		},
		[28] = {
			["Line"] = [[Например?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/28.mp3",
			["Answers"] = {
				{"Кто в этой всей конторе главный? Кто стоит за всем-всем-всем?", 29,},
				{"Почему мусорные контейнеры, а не льдовые?", 30,},
				{"Почему тут одни чёрные и 'чёрная' эстетика? Это шифр?", 31,},
				{"Мне интересно кое-что личное.", 32,},
			},
		},
		[29] = {
			["Line"] = [[Ты просишь простые ответы на концепты, для каких их нет. Я оставлю тебе только один намёк, на что похожа наша.. задумка. Картель.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/29.mp3",
			["Answers"] = {
				{"Спасибо, мне этого достаточно. Мне пора.", 25,},
				{"Почему мусорные контейнеры, а не льдовые?", 30,},
				{"Почему тут одни чёрные и 'чёрная' эстетика? Это шифр?", 31,},
				{"Мне интересно кое-что личное.", 32,},
			},
		},
		[30] = {
			["Line"] = [[Если хочешь что-то спрятать - спрячь на виду. Никто не обращает на метки внимание, ведь это лого компании. Компания приносит прибыль и удовлетворяет запросы города. Половина внутренних сотрудников куплена нами. Потому, товар всегда находит адресата.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/30.mp3",
			["Answers"] = {
				{"Спасибо, мне этого достаточно. Мне пора.", 25,},
				{"Кто в этой всей конторе главный? Кто стоит за всем-всем-всем?", 29,},
				{"Почему тут одни чёрные и 'чёрная' эстетика? Это шифр?", 31,},
				{"Мне интересно кое-что личное.", 32,},
			},
		},
		[31] = {
			["Line"] = [[А кого ты ждёшь? Русскую мафию? Триад? Мексиканских сикарио? Не тот город.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/31.mp3",
			["Answers"] = {
				{"Спасибо, мне этого достаточно. Мне пора.", 25,},
				{"Кто в этой всей конторе главный? Кто стоит за всем-всем-всем?", 29,},
				{"Почему мусорные контейнеры, а не льдовые?", 30,},
				{"Мне интересно кое-что личное.", 32,},
			},
		},
		[32] = {
			["Line"] = [[Например?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/32.mp3",
			["Answers"] = {
				{"Что это за имя такое, Дезз? Потому что Дезмонд?", 33,},
				{"Почему Вэйн, а не Слим? Почему не я? Ну, с практичной точки зрения.", 34,},
				{"Какого хера меня втянули в эту драму?", 35,},
				{"Мне интересно кое-что по работе.", 28,},
			},
		},
		[33] = {
			["Line"] = [[Выёбываешься. ..Однако, я обещал. Первая часть символизма тобой разгадана. Вторая - созвучно со словом 'death'. Очень подходит.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/33.mp3",
			["Answers"] = {
				{"Спасибо, мне этого достаточно. Мне пора.", 25,},
				{"Почему Вэйн, а не Слим? Почему не я? Ну, с практичной точки зрения.", 34,},
				{"Какого хера меня втянули в эту драму?", 35,},
				{"Мне интересно кое-что по работе.", 28,},
			},
		},
		[34] = {
			["Line"] = [[Слим - говорящая голова. С тебя бы ничего не взяли. А из того тянули клещами. На месте Лил Вэйна я бы поступил так же. Жить с таким опытом.. неприлично, мягко говоря.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/34.mp3",
			["Answers"] = {
				{"Спасибо, мне этого достаточно. Мне пора.", 25,},
				{"Что это за имя такое, Дезз? Потому что Дезмонд?", 33,},
				{"Какого хера меня втянули в эту драму?", 35,},
				{"Мне интересно кое-что по работе.", 28,},
			},
		},
		[35] = {
			["Line"] = [[Забавно. Мне повторить про шахматы? ..Каждый думает, что он особенный. Каждый считает, что достоин большего. Все ожидают богатств и ..экшена. А потом жизнь бьёт по лицу настоящим. Проснись, а то сядешь.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/revelation/35.mp3",
			["Answers"] = {
				{"Спасибо, мне этого достаточно. Мне пора.", 25,},
				{"Что это за имя такое, Дезз? Потому что Дезмонд?", 33,},
				{"Почему Вэйн, а не Слим? Почему не я? Ну, с практичной точки зрения.", 34,},
				{"Мне интересно кое-что по работе.", 28,},
			},
		},
	}
}