-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\criminal_slim_escapism.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["criminal_slim_escapism"] = {
	name = "Слим Шейди",
	model = "models/cityrp/pm/normal/male_06.mdl",
	submat = {
		[4] = "gbskins/outfit/top_200",
		[8] = "gbskins/outfit/pants_200",
		[9] = "gbskins/outfit/boots_51"
	},
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "d1_t01_breakroom_sit01_idle",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Чё надо?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/1.mp3",
			["Answers"] = {
				{"Ничего. Я пойду.", "close",},
			},
		},
		[2] = {
			["Line"] = [[Чё стоишь? Садись, поговорим.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/2.mp3",
			["Answers"] = {
				{"Я постою.", 3,},
			},
		},
		[3] = {
			["Line"] = [[Прально, чем быстрее - тем лучше. Видишь чемодан?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/3.mp3",
			["Answers"] = {
				{"Вижу.", 4,},
			},
		},
		[4] = {
			["Line"] = [[Там бомба.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/4.mp3",
			["Answers"] = {
				{"..Чего?", 5,},
				{"Ты ёбнулся?!", 6,},
				{"Откуда ты её достал?", 7,},
			},
		},
		[5] = {
			["Line"] = [[Глухомань, там- ..Сука, шматок кончи, ебальник завали! Как ты предлагаешь ещё поступать? Врываться в участок с пулемётом в каждой руке? Надо бить аккуратно, но сильно!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/5.mp3",
			["Answers"] = {
				{"Это плохо закончится.", 8,},
				{"Умно. Что дальше?", 10,},
				{"Откуда ты её достал?", 7,},
			},
		},
		[6] = {
			["Line"] = [[Не критикуй пока всех нюансов не узнаешь, э! С кейсами все подряд ходят, никто задумы не уловит! Путешествие на десять минут - приходишь, ставишь и уходишь. Даж я справился бы, ток я Деззу словесно ебало набить готовлюсь, понимаешь?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/6.mp3",
			["Answers"] = {
				{"Это плохо закончится.", 8,},
				{"Умно. Что дальше?", 10,},
				{"Откуда ты её достал?", 7,},
			},
		},
		[7] = {
			["Line"] = [[У Тек Найна. Ты его пока не знаешь, потом раззнакомлю. Технарь что надо - пулемёт из зажигалки и синей изоленты соберёт, бля буду. Как он грит - вся маза в деталях. Вот их достать эт уже другой вопрос..]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/7.mp3",
			["Answers"] = {
				{"Это плохо закончится.", 8,},
				{"Умно. Что дальше?", 10,},
			},
		},
		[8] = {
			["Line"] = [[Ну чё ты так очкуешь? Её-ж ровный мужик сбацал, не бегало какое. Не, я тож по-началу не вдуплял, но пацан прям конкретен - подавальщик нашёлся надёжный как швейцарские часы. Мистер Б.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/8.mp3",
			["Answers"] = {
				{"Хорошо, верю. Куда с чемоданом предлагаешь идти?", 10,},
				{"Мне всё равно не нравится этот план. Куда с чемоданом предлагаешь идти?", 10,},
				{"Мистер Б? Который политический деятель? Боб?", 9,},
			},
		},
		[9] = {
			["Line"] = [[Та хуй его знает. Шо тот человек-тайна, шо другой - мне похуй, тут бизнес главное. Чё, отказываться терь из-за псевдонима? Он помог с устройством, а остальное не важно. Лишних жертв не будет, ноль внимания - эт самое главное. ..Ну, ты долго будешь залупу мять?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/9.mp3",
			["Answers"] = {
				{"Хорошо, верю. Куда с чемоданом предлагаешь идти?", 10,},
				{"Ноль внимания от взрыва? С жертвами среди полиции? ..Куда с чемоданом предлагаешь идти?", 10,},
			},
		},
		[10] = {
			["Line"] = [[Ну а ты как думаешь? Где ещё мусора сидят кроме белого дома? Они-ж пончики любят! Пиздуй в дайнер и закинь подарок под машину легавому. Там точно толпа целая будет, отвечаю!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/10.mp3",
			["Answers"] = {
				{"Посмотрим, как всё пройдёт.", "MQS Continue quest",},
				{"..Ты ведь понимаешь, что пончики - заезжанный стереотип?", 11,},
				{"Хрень какая-то. Я не хочу с этим иметь дел.", 12,},
			},
		},
		[11] = {
			["Line"] = [[Да ты заебёшь! Им тож-жеж жрать надо! Этот ихний комиссар мастер нас кусать, а вот его уже ебут совсем сверху. Думаешь, у этих пидоров деньги есть шоб на месте или во всяких ресторанах хавать? Хуй там! Они типа слишком богатые для китайской лапши, но не для высшей херни.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/11.mp3",
			["Answers"] = {
				{"Посмотрим, как всё пройдёт.", "MQS Continue quest",},
				{"Хрень какая-то. Я не хочу с этим иметь дел.", 12,},
			},
		},
		[12] = {
			["Line"] = [[Так, алё! Ты не врубаешься или чё? Долго шестёркой нигерской будешь обсасываться? Я те выбор даю показать себя с другой стороны, а ты..!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/12.mp3",
			["Answers"] = {
				{"Ладно, успокойся. Давай сюда свой чемодан.", "MQS Continue quest",},
				{"Это не правильно. Могут пострадать лишние люди. Тогда бизнес тоже пострадает.", "MQS Fail quest",},
				{"Это не правильно, вот хоть убей.", 13,},
			},
		},
		[13] = {
			["Line"] = [[Окей.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/escapism/13.mp3",
			["Answers"] = {
				{"Нет, подожди!", "Shoot player",},
			},
		},
	}
}