-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\misc_letter_unit.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["misc_letter_unit"] = {
	name = "Блокнот",
	model = "models/props_lab/clipboard.mdl",
	namepos = 80,
	theme = "Retro",
	noinfo = true,
	scale = 1,
	questNPC = false,
	pos = {
		["rp_southside_noire"] = { Vector(-7629.96875,-3859.125,-274.125), Angle(0,-108.00109863281,0)}
	},
	submat = {
		[0] = "gbskins/clip_misc"
	},
	sequence = "idle",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Этот блокнот настолько сильно исписан, что он может развалиться от одного только косого взгляда. Наверное, его лучше не трогать.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Одна из страниц блокнота неприлично выпирает. Кажется, это сделала Вульф. И кажется, она хочет, чтобы это заметили.]],
			["Sound"] = "",
			["Answers"] = {
				{"Раскрыть блокнот на выделенной странице", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Текст как будто не имеет смысла. Или его писал больной шизофренией, или его рисовал человек с тем же диагнозом. Пожалуй, стоит посмотреть на писанину под другим углом?]],
			["Sound"] = "",
			["Answers"] = {
				{"Посмотреть под другим углом", 4,},
				{"Потянуть за уголки глаз", 5,},
				{"Взглянуть между строк", 6,},
			},
		},
		[4] = {
			["Line"] = [[Будь всё так просто - все преступления мира решились бы в один миг. Поворот бумаги на любое количество градусов не приносит никакого успеха.]],
			["Sound"] = "",
			["Answers"] = {
				{"Потянуть за уголки глаз", 5,},
				{"Взглянуть между строк", 6,},
			},
		},
		[5] = {
			["Line"] = [[Закорючки, чёрточки и точки сложились из одних слов в другие. Однако, это не то, что сейчас нужно. Возможно, этот приём пригодится позже.]],
			["Sound"] = "",
			["Answers"] = {
				{"Посмотреть под другим углом", 4,},
				{"Взглянуть между строк", 6,},
			},
		},
		[6] = {
			["Line"] = [[Напрягаться и искать смысл не помогает. А вот расслабиться и раскинуть мысли - очень даже наоборот. В глаза сразу бросились слова 'Центр', 'Опрос' и 'Ричман'. Они не подходят ни к чему-либо другому на этой странице.]],
			["Sound"] = "",
			["Answers"] = {
				{"Опрос ювелиров?", 7,},
				{"Опрос богатых?", 8,},
				{"Опрос бизнес-центра?", 9,},
				{"Опрос богатых ювелиров из бизнес-центра?", 10,},
			},
		},
		[7] = {
			["Line"] = [[Бинго.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отложить блокнот в сторону", "MQS Continue quest",},
			},
		},
		[8] = {
			["Line"] = [[Может быть. А где сидят богатые?]],
			["Sound"] = "",
			["Answers"] = {
				{"Ювелирный магазин?", 7,},
				{"Бизнес-центр?", 10,},
			},
		},
		[9] = {
			["Line"] = [[Всему полицейскому департаменту не хватит и трёх поколений, чтобы найти хоть одну легальную претензию к World Corp. Это точно не то.]],
			["Sound"] = "",
			["Answers"] = {
				{"Опрос ювелиров?", 7,},
				{"Опрос богатых?", 8,},
				{"Опрос богатых ювелиров из бизнес-центра?", 10,},
			},
		},
		[10] = {
			["Line"] = [[Хорошая попытка. Только, это не тот случай, где сложение всех точек зрения приносит плоды.]],
			["Sound"] = "",
			["Answers"] = {
				{"Опрос ювелиров?", 7,},
				{"Опрос богатых?", 8,},
				{"Опрос бизнес-центра?", 9,},
			},
		},
		[11] = {
			["Line"] = [[Одна из страниц блокнота неприлично выпирает. На этот раз, с противоположной стороны. Кажется, Арианна снова оставила сообщение таким запутанным образом.]],
			["Sound"] = "",
			["Answers"] = {
				{"Раскрыть блокнот на выделенной странице", 12,},
				{"Отойти", "close",},
			},
		},
		[12] = {
			["Line"] = [[Обычные глаза тут ничего не увидят. А вот офицерский взгляд уже нашёл знакомые приёмы и имена. В тексте промелькнули все ранее обсуждаемые лица и равное количество полицейских. Однако, какая между ними связь?]],
			["Sound"] = "",
			["Answers"] = {
				{"Посмотреть под другим углом", 14,},
				{"Потянуть за уголки глаз", 13,},
				{"Взглянуть между строк", 15,},
			},
		},
		[13] = {
			["Line"] = [[Закорючки, чёрточки и точки сложились из одних слов в другие. Однако, это не то, что сейчас нужно. Возможно, этот приём пригодится позже.]],
			["Sound"] = "",
			["Answers"] = {
				{"Посмотреть под другим углом", 14,},
				{"Взглянуть между строк", 15,},
			},
		},
		[14] = {
			["Line"] = [[Повёрнутый блокнот заменил один буквопад на другой. Как бы то ни казалось странным - при попытках нормального чтения, развёрнутый список гениально указал на роль и связь каждого перечисленного. Очередь перевозить улики к предстоящему допросу перешла к вам.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отложить блокнот в сторону", "MQS Continue quest",},
			},
		},
		[15] = {
			["Line"] = [[В наборе слов нет никаких выделенных строк. Это буквально перечисление чего-то, что должно собираться вместе. Только вот, как?]],
			["Sound"] = "",
			["Answers"] = {
				{"Посмотреть под другим углом", 14,},
				{"Потянуть за уголки глаз", 13,},
			},
		},
		[16] = {
			["Line"] = [[На этот раз, блокнот оставили раскрытым. На видимых страницах изображён обрезанный силуэт мужчины и большая буква 'S' над его головой. Очевидно, что этому 'плейбою' не хватает других таких же листов бумаги.]],
			["Sound"] = "",
			["Answers"] = {
				{"Проверить соседние страницы блокнота", 17,},
				{"Отойти", "close",},
			},
		},
		[17] = {
			["Line"] = [[Обе страницы с оборотов указывают стрелками на мужчину. Более того - набор символов идентичен в обоих вариантах, отличаясь лишь зеркально. Все возможные подсказки на виду.]],
			["Sound"] = "",
			["Answers"] = {
				{"Посмотреть под другим углом", 18,},
				{"Потянуть за уголки глаз", 19,},
				{"Взглянуть между строк", 18,},
			},
		},
		[18] = {
			["Line"] = [[С таким тусклым набором информации, смотреть иначе некуда. Тут точно необходимо работать с уже подготовленной подачей.]],
			["Sound"] = "",
			["Answers"] = {
				{"Потянуть за уголки глаз", 19,},
			},
		},
		[19] = {
			["Line"] = [[Закорючки, чёрточки и точки сложились в ясно читаемые слова. Текст просит посмотреть под стол - за пробковые доски.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отложить блокнот в сторону", "MQS Continue quest",},
			},
		},
		[20] = {
			["Line"] = [[Плейбой с буквой 'S' так и смотрит в сторону. Или нет? Скетч всё ещё неполный.]],
			["Sound"] = "",
			["Answers"] = {
				{"Добавить к бумаге кусочки из файлов", 21,},
			},
		},
		[21] = {
			["Line"] = [[Буква - всего лишь часть слова 'MUSIC'. А мужчина - часть образа даже более безвкусного жиголо, чем казалось на первый взгляд. Как ни странно, образ подписан крайне символично: 'Сутенёр-по-Имени-Прилизанный'. Кто бы то ни был - это новый подозреваемый. Однако, чего хочет Арианна?]],
			["Sound"] = "",
			["Answers"] = {
				{"Это слово - намёк на музыкальную группу", 22,},
				{"Это слово - намёк на ночной клуб", 24,},
				{"Это слово - намёк на поиск кассеты", 23,},
			},
		},
		[22] = {
			["Line"] = [[С каких это пор напарник вдруг решил поделиться своими музыкальными предпочтениями? Вряд ли это то, чего хотела Вульф, несмотря на человечные принципы комиссара.]],
			["Sound"] = "",
			["Answers"] = {
				{"Это слово - намёк на ночной клуб", 24,},
				{"Это слово - намёк на поиск кассеты", 23,},
			},
		},
		[23] = {
			["Line"] = [[Если бы только на складе лежали кассетные проигрыватели.. Или сами кассеты. Или что-то оцифрованное в принципе. Как-никак, музыку не прочитать. По крайней мере полицейскому.]],
			["Sound"] = "",
			["Answers"] = {
				{"Это слово - намёк на музыкальную группу", 22,},
				{"Это слово - намёк на ночной клуб", 24,},
			},
		},
		[24] = {
			["Line"] = [[Ночной клуб славится постоянными визитами таких безвкусных и маргинальных личностей. Учитывая, как сильно Арианна любит перегонять своих напарников - она уже на полпути к беде. Пора выступать.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отложить блокнот в сторону", "MQS Continue quest",},
			},
		},
	}
}