-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\misc_letter_hq.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["misc_letter_hq"] = {
	name = "Планшет",
	model = "models/props_lab/clipboard.mdl",
	namepos = 80,
	theme = "Retro",
	noinfo = true,
	scale = 1,
	questNPC = false,
	pos = {
		["rp_southside_noire"] = { Vector(8262.7490234375,8692.8125,328.72088623047 ), Angle(-0.15929999947548,69.521499633789,-0.049400001764297)}
	},
	submat = {
		[0] = "gbskins/clip_misc"
	},
	sequence = "idle",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Планшет явно давно никто не трогал. Чернила и бумага высохли, как лицо служащего в соседней кабинке.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Первая же страница вложена в планшет совсем недавно. Возможно, комиссар хотел обратить внимание именно на неё. Недавние слёзы лишь сильнее на то указывают.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прочитать послание", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Сквозь буквы чувствуется та самая обсуждаемая сержантом 'человечность'. Хотя, к этому явлению лучше бы подошло слово 'хаотичность'. Она как бы заставляет разделить текст на три части - личное, наставление и итоги.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прочитать отрывок с 'личным'", 4,},
				{"Прочитать отрывок с 'наставлением'", 5,},
			},
		},
		[4] = {
			["Line"] = [[Сквозь дрожащий почерк видно лишь пару строк: '..Вульф была мне как маленькая, капризная сестра. Наверное.. нет - надеюсь, у тебя к ней такие же чувства..']],
			["Sound"] = "",
			["Answers"] = {
				{"Прочитать отрывок с 'наставлением'", 5,},
				{"Перейти к 'итогам'", 6,},
			},
		},
		[5] = {
			["Line"] = [[В этом моменте письма почерк пришёл в норму: '..Теперь это твой офис. Я не знаю, где вы хранили архивы, однако я хочу помочь. Просто оставляй на планшете лист с расходами, и я буду переводить тебе деньги для оплаты счетов. От тебя лишь ожидается своевременная перевозка коробок с горячими делами туда-обратно..']],
			["Sound"] = "",
			["Answers"] = {
				{"Прочитать отрывок с 'личным'", 4,},
				{"Перейти к 'итогам'", 6,},
			},
		},
		[6] = {
			["Line"] = [['..Кстати, о коробках: в этой лежит её пистолет. Она использовала свой - теперь он твой. Информацию по несрочным обязанностям будешь получать через планшет, в этом офисе. Мне очень жаль. Набирайся сил. Увидимся на службе, будущий детектив.']],
			["Sound"] = "",
			["Answers"] = {
				{"Отложить планшет в сторону", "MQS Continue quest",},
			},
		},
		[7] = {
			["Line"] = [[Планшет недавно кто-то трогал. Вероятно, начальник.]],
			["Sound"] = "",
			["Answers"] = {
				{"Проверить, что появилось нового", 8,},
			},
		},
		[8] = {
			["Line"] = [[Красный текст приказывает перевезти определённые дела назад в полицейский участок, а также напоминает про оплату счетов. Номера и идентификация приложены к просьбе.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отложить планшет в сторону", "MQS Continue quest",},
			},
		},
		[9] = {
			["Line"] = [[Планшет недавно кто-то трогал. Вероятно, начальник.]],
			["Sound"] = "",
			["Answers"] = {
				{"Проверить, что появилось нового", 10,},
			},
		},
		[10] = {
			["Line"] = [[Красный текст приказывает увезти определённые дела подальше от полицейского участка, а также напоминает про оплату счетов. Номера и идентификация приложены к просьбе.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отложить планшет в сторону", "MQS Continue quest",},
			},
		},
		[11] = {
			["Line"] = [[Бумага после указа никак не менялась, не дополнялась и не вырывалась. Стабильность - это хорошо.]],
			["Sound"] = "",
			["Answers"] = {
				{"Вытащить бумагу с приказом и записать на чистом листе расходы на юнит", "MQS Continue quest",},
			},
		},
	}
}