-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\police_wolf_partner.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["police_wolf_partner"] = {
	name = "Арианна Вульф",
	desc = "Детектив",
	n_icon = Material("ranks_ui/icons/nypd/dt1.png", "smooth"),
	model = "models/cityrp/pm/nypd/female_01.mdl",
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = true,
	pos = {},
	sequence = "lineidle02",
	uselimit = false,
	skin = 1,
	bgr = {[2] = 1,[5] = 1,},
	ClModels = {
		{ model = "models/cityrp/nypd/badge_dt1.mdl", pos = Vector(3,-1.9,7.25), ang = Angle(0,150,60), bone = 4},
	},
	dialogs = {
		[1] = {
			["Line"] = [[Привет. Я тебя жду? Ты от 'комиссара'?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/1.mp3",
			["Answers"] = {
				{"Нет, вы ошиблись.", 2,},
			},
		},
		[2] = {
			["Line"] = [[Блин, да что-ж такое..]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/2.mp3",
			["Answers"] = {
				{"...", "close",},
			},
		},
		[3] = {
			["Line"] = [[Привет, я тебя жду? Ты от 'комиссара'?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/3.mp3",
			["Answers"] = {
				{"Наверное. Вы - Вульф?", 6,},
				{"Нет, вы ошиблись.", 4,},
			},
		},
		[4] = {
			["Line"] = [[Блин, да что-ж такое..]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/4.mp3",
			["Answers"] = {
				{"...", 5,},
				{"Или.. погоди. Ты ведь Вульф?", 5,},
				{"Шучу. Ты ждёшь меня. Скорее всего.", 5,},
			},
		},
		[5] = {
			["Line"] = [[..Тупица! Я уже вся перенервничала, а ты тут устраиваешь!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/5.mp3",
			["Answers"] = {
				{"Я не тупица.", 7,},
				{"Сама такая.", 8,},
				{"Прошу прощения.", 7,},
				{"Извиняюсь.", 8,},
			},
		},
		[6] = {
			["Line"] = [[..Наконец-то! Где тебя носило? Нет, дай угадаю - старик своей болтовнёй удерживал?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/6.mp3",
			["Answers"] = {
				{"Ага.", 11,},
				{"Да. Умные вещи говорит, конечно.", 11,},
				{"Нет. Мы быстро переговорили.", 7,},
				{"Нет. Мне пришлось резко отлучиться уже после разговора.", 7,},
			},
		},
		[7] = {
			["Line"] = [[..В любом случае, давай перейдём к делу?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/7.mp3",
			["Answers"] = {
				{"Хорошо.", 15,},
			},
		},
		[8] = {
			["Line"] = [[Как грубо, ну ты даёшь! И Джона говорит, что мы похожи? То что мы поладим? ..А он прав. Только не направляй свою пассивную агрессию в мою сторону. Мы партнёры, а не школьные друзья.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/8.mp3",
			["Answers"] = {
				{"Хорошо.", 10,},
				{"Как скажешь.", 9,},
				{"А то что?", 9,},
				{"Почему нет? Два плохих копа - хорошая комбинация.", 9,},
				{"Расскажешь о себе? Будем друзьями.", 16,},
			},
		},
		[9] = {
			["Line"] = [[Это вредит здоровости департамента. Джона может не понимает много чего современного - старикам тут точно не место - но только частично. Ладно ещё со стороны кто обратит внимание, у каждого жизнь и всё такое.. Так вода камень точит. Подумай об этом.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/9.mp3",
			["Answers"] = {
				{"Всё начинается с мелочей.", 12,},
				{"Всегда можно остановиться.", 14,},
				{"А что в этом такого?", 13,},
			},
		},
		[10] = {
			["Line"] = [[Отлично. Перейдём к делу?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/10.mp3",
			["Answers"] = {
				{"Конечно.", 15,},
			},
		},
		[11] = {
			["Line"] = [[Это он умеет. Не первый год уже работаю с ним, не первый раз меняются напарники - и с каждым одно и то же.. Неплохой мужик, очень опытный - и к счастью он понимает, что старикам тут не место. Ну, что молодой крови тоже нужно пробиваться. Новый опыт, новый подход.. Понимаешь?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/11.mp3",
			["Answers"] = {
				{"Да.", 10,},
				{"Кажется.", 7,},
				{"Нет", 7,},
			},
		},
		[12] = {
			["Line"] = [[Рада, что ты это понимаешь. Перейдём к делу?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/12.mp3",
			["Answers"] = {
				{"Да.", 15,},
			},
		},
		[13] = {
			["Line"] = [[Это шутка? Это должна быть шутка. И Джона говорит, что мы похожи? Нет, упёртости тебе не занимать, но.. Вау. Откуда такой пессимизм? Тебе уже столько лет, а опыта будто совсем нет! Каждого можно переучить, с каждым можно поговорить - я тому живой пример.

Мне как-то говорил мозгоправ, что человек кардинально меняется всего два раза в жизни. Я менялась пять. А мне даже не тридцать. Тебе ещё учиться и учиться..]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/13.mp3",
			["Answers"] = {
				{"Кажется, понимаю, о чём ты.", 12,},
				{"Прошу прощения.", 12,},
				{"Может быть, когда-нибудь я это пойму.", 12,},
				{"Не понимаю, совсем. Глупости какие-то.", 7,},
				{"Расскажешь о себе?", 16,},
			},
		},
		[14] = {
			["Line"] = [[Скажи это наркоманам всего мира. Скажи это гангстерам этого города. Посмотри на тот же Чикаго - там стрельба вообще не прекращается! И как это они не послушали твоего совета и просто не бросили всё позади? Какие же глупые людишки, да?

..Да. Они глупые. А мы не будем ничем отличаться, если не будем их переучивать. Как насчёт посмотреть на процент рецидивов за прошлый квартал? Семьдесят процентов. Потому что Джона прав. Его нужно слушать. Заметь - не слушаться, а слушать.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/14.mp3",
			["Answers"] = {
				{"Точно. Прости.", 12,},
				{"Ты права.", 12,},
				{"И как это поможет? Кто хочет заниматься хернёй - будет ей заниматься.", 13,},
			},
		},
		[15] = {
			["Line"] = [[Так.. Ну, по заветам нашего смотрителя, мы уже друг друга достаточно знаем. Остальное привьётся потом - и это реально так. Я уже чувствую твой характер через одни только слова. Ты не болтаешь много, ты слушаешь, ты собираешь информацию. Ты не из этого города.

Либо тебя уже всё так доконало, что по сто-пятьсот раз говорить одни и те же вещи надоело. Что бы то ни было - это очень пригодится в нашей работе. Ты ещё не серая масса, и это хорошо. Плохо то, что в ней утонуть очень-очень легко. Держись.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/15.mp3",
			["Answers"] = {
				{"Ты даже не спросишь, как меня зовут?", 17,},
				{"Так чем мы будем заниматься?", 18,},
				{"Я ничего не понимаю.", 19,},
			},
		},
		[16] = {
			["Line"] = [[Ещё будет время, мы точно не умрём завтра. Давай перейдём к делу?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/16.mp3",
			["Answers"] = {
				{"Хорошо.", 15,},
			},
		},
		[17] = {
			["Line"] = [[Я уже знаю. Думаешь, я не сделала заранее свою 'домашнюю работу'? Какой я тогда детектив? ..Вот по тебе вижу, что у тебя для этого чего-то не хватает. А чего именно - узнаем в процессе.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/17.mp3",
			["Answers"] = {
				{"Логично. Что дальше?", 18,},
				{"Почему все всё знают, а меня будто держат в тени?", 19,},
			},
		},
		[18] = {
			["Line"] = [[Пока что у нас отдых; отбой. Нас попросили просто переговорить, узнать друг друга тривиально - меня зовут Арианна, кстати. Поручение и детали дадут потом. Там и созвонимся.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/18.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Созвонимся?", 20,},
			},
		},
		[19] = {
			["Line"] = [[Это нормально. У тебя лицо как и у остальных новобранцев. Мне неудобно такое говорить, но с опытом - с возрастом, всё встанет на места. Ты быстро встанешь в строй и сможешь действовать, как настоящий полицейский. Скоро нам дадут задание, детали и так далее. Пока что иди отдохни, мы заслуживаем отдыха. Нас выбрали для великих дел.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/19.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
			},
		},
		[20] = {
			["Line"] = [[Не занимать же служебную линию? Да и к тому же бояться нечего - мы здесь закон. Анекдот даже вспомнился - на родной земле наши данные остаются только у наших спецслужб. ..Не смешно? Ладно, не буду тебя задерживать. Иди отдохни.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/partner/20.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
			},
		},
	}
}