-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\police_wolf_escapism.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["police_wolf_escapism"] = {
	name = "Арианна Вульф",
	model = "models/cityrp/pm/normal/female_01.mdl",
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = true,
	pos = {},
	sequence = "LineIdle02",
	uselimit = false,
	skin = 1,
	bgr = {[1] = 0,[2] = 0,},
	dialogs = {
		[1] = {
			["Line"] = [[...]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "close",},
			},
		},
		[2] = {
			["Line"] = [[О, вот и ты! Ну что, как насчёт того ужина?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/escapism/2.mp3",
			["Answers"] = {
				{"Нет.", 3,},
				{"Я только 'за'.", 6,},
				{"Ужин это, конечно, хорошо.. Но тебе нужен отдых.", 3,},
				{"Ты всё решила за меня. Когда я уже буду решать, что кому из нас делать?", 8,},
			},
		},
		[3] = {
			["Line"] = [[Отлично! Куда поедем? Я знаю одно замечательное место..]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/escapism/3.mp3",
			["Answers"] = {
				{"Никуда. Нет.", 4,},
				{"..Ты серьёзно?", 4,},
				{"Ты меня вообще слышишь? Тебе нужно в больницу!", 4,},
			},
		},
		[4] = {
			["Line"] = [[Ну давай! Я настаиваю! Я уже чувствую себя лучше! Сжимать ладони всё ещё трудно, но мне лучше!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/escapism/4.mp3",
			["Answers"] = {
				{"Ты не отстанешь от меня пока мы не возьмём еды, не так ли?", 5,},
			},
		},
		[5] = {
			["Line"] = [[Да. Я уже заказала нам кое-что в итальянском ресторане, недалеко от дайнера. Не дуйся ты так, тебе понравится! Дава-ай, административный отпуск нужно проводить с пользой!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/escapism/5.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Вау. Мне это не нравится.", "MQS Continue quest",},
				{"Вау. Мне нравится.", "MQS Continue quest",},
				{"После 'благодарности' ты идёшь на брутальный больничный, поняла?", "MQS Continue quest",},
				{"Ты действительно планируешь вообще всё. И не оставляешь никакого выбора.", "MQS Continue quest",},
			},
		},
		[6] = {
			["Line"] = [[Ура!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/escapism/6.mp3",
			["Answers"] = {
				{"...", 7,},
				{"Только после этого ты сразу же отдыхать, поняла?", 7,},
			},
		},
		[7] = {
			["Line"] = [[..Я понимаю. Просто дай мне вернуть должок, хорошо? Я уже выбрала для нас кое-что в итальянском ресторане, недалеко от дайнера. Тебе понравится! Дава-ай, административный отпуск нужно проводить с пользой!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/escapism/7.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Вау. Мне это не нравится.", "MQS Continue quest",},
				{"Вау. Мне это нравится.", "MQS Continue quest",},
				{"После 'благодарности' ты идёшь на больничный, поняла?", "MQS Continue quest",},
				{"Ты действительно планируешь вообще всё. И не оставляешь никакого выбора.", "MQS Continue quest",},
			},
		},
		[8] = {
			["Line"] = [[У тебя есть шикарная возможность выбирать прямо сейчас! Мы можем стоять тут и ждать, пока вкуснейшая еда стынет - или мы можем поехать к ней прямо сейчас!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/escapism/8.mp3",
			["Answers"] = {
				{"То есть, у меня нет варианта отказаться?", 5,},
				{"То есть, у меня даже нет выбора, где обедать?", 5,},
				{"То есть, у меня вообще нет никакого выбора? А будет ли он потом?", 5,},
			},
		},
	}
}