-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\police_wolf_strange.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["police_wolf_strange"] = {
	name = "Арианна Вульф",
	desc = "Детектив",
	n_icon = Material("ranks_ui/icons/nypd/dt1.png", "smooth"),
	model = "models/cityrp/pm/nypd/female_01.mdl",
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = true,
	pos = {},
	sequence = "lineidle03",
	uselimit = false,
	skin = 0,
	bgr = {[2] = 1,[5] = 1,},
	ClModels = {
		{ model = "models/cityrp/nypd/badge_dt1.mdl", pos = Vector(3,-1.9,7.25), ang = Angle(0,150,60), bone = 4},
	},
	dialogs = {
		[1] = {
			["Line"] = [[Полиция! Пожалуйста, покиньте помещение! Идёт расследование!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/strange/1.mp3",
			["Answers"] = {
				{"Простите, уже ухожу.", "close",},
			},
		},
		[2] = {
			["Line"] = [[О, вот и ты! Прости, я уже закончила со своими свидетелями и подумала взяться за твоих. Чтобы помочь тебе разгрузиться, разумеется! ..Но, как видишь, на пути встала типичная Карен - представитель мира животных в шкуре людей. У меня не получается с такими разговаривать, вот хоть убей. Может, тебе удастся?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/strange/2.mp3",
			["Answers"] = {
				{"Попробую.", "MQS Continue quest",},
				{"Какая тут ситуация?", 3,},
			},
		},
		[3] = {
			["Line"] = [[Девушка, помолчите! ..Так вот. Эта.. дама, пропустила целое ограбление на своей же смене, прямо перед своими глазами. А выдавать самих грабителей не хочет по самым разным отмазкам. Это дело связано с нашим расследованием, так что попробуй не запороть его, хорошо?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/strange/3.mp3",
			["Answers"] = {
				{"Попробую.", "MQS Continue quest",},
			},
		},
		[4] = {
			["Line"] = [[Это.. невозможно.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/strange/4.mp3",
			["Answers"] = {
				{"Что?", 5,},
				{"Почему?", 5,},
				{"Как?", 5,},
			},
		},
		[5] = {
			["Line"] = [[Тут всё на Вэйна. Всё, что мы уже знали. Вот это вот реально тупо лежало в той случайной мусорке?!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/strange/5.mp3",
			["Answers"] = {
				{"..Да?", 6,},
			},
		},
		[6] = {
			["Line"] = [[Эти улики подложили, очевидно же! Пистолет не на него зарегистрирован; всё разложено как будто из нашего участка взято, будто следствие уже со всем закончило! Ну бред же! Бред!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/strange/6.mp3",
			["Answers"] = {
				{"Что мы будем делать?", 7,},
			},
		},
		[7] = {
			["Line"] = [[..Мы должны будем использовать эти улики. Как шахматный гамбит, от которого нельзя отказаться. Картина всё равно слишком воедино собирается. ..Так, отвези это в участок, в хранилище доказательств. Как сможешь - вернись в наш 'штаб'.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/strange/7.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Что будешь делать ты?", 8,},
				{"А как же общий план с посадкой всех-всех?", 9,},
			},
		},
		[8] = {
			["Line"] = [[Идти по следу. Я вернусь в 'штаб' и оставлю указания, а сама буду работать над вишенкой для твоей задачи. Увидишь, в общем. ..Не беспокойся, со мной всё будет в порядке!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/strange/8.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"А как же общий план с посадкой всех-всех?", 9,},
			},
		},
		[9] = {
			["Line"] = [[Вот над этим и буду работать. Помни - мы играем дурачков. Нашли якобы доказательства причастности к ювелирке, давим - и делаем вид, что ничего не знаем. Попутно выведываем больше. Планирование - наше всё.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/strange/9.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
			},
		},
	}
}