-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\police_wolf_unit.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["police_wolf_unit"] = {
	name = "Арианна Вульф",
	desc = "Детектив",
	n_icon = Material("ranks_ui/icons/nypd/dt1.png", "smooth"),
	model = "models/cityrp/pm/nypd/female_01.mdl",
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = true,
	pos = {},
	sequence = "lineidle03",
	uselimit = false,
	skin = 1,
	bgr = {[2] = 1,[5] = 1,},
	ClModels = {
		{ model = "models/cityrp/nypd/badge_dt1.mdl", pos = Vector(3,-1.9,7.25), ang = Angle(0,150,60), bone = 4},
	},
	dialogs = {
		[1] = {
			["Line"] = [[...]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "close",},
			},
		},
		[2] = {
			["Line"] = [[..Как тебе?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/2.mp3",
			["Answers"] = {
				{"Спрятать такое количество макулатуры из архивов на видном месте? Неплохо.", 3,},
				{"Превратить складской юнит в тесную коморку? Неплохо.", 4,},
				{"У меня нет слов. В хорошем смысле.", 3,},
				{"У меня нет слов. В плохом смысле.", 4,},
			},
		},
		[3] = {
			["Line"] = [[Спасибо. В нашем деле иначе никак - или ты рассказываешь каждому участковому о своих планах и проваливаешься, или делаешь как я и преисполняешься. Хотя бы образно, или в глазах начальства. Неудобно, соглашусь, зато безопасно.

Прости за обстановку. Когда думаешь, то отвлекаться на таракана в канаве нету времени. ..Посмотри на пробковые доски. Что думаешь?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/3.mp3",
			["Answers"] = {
				{"..Ничего не вижу.", 5,},
				{"..Ничего не понимаю.", 5,},
				{"..Какая-то дичь.", 5,},
			},
		},
		[4] = {
			["Line"] = [[Не суди книгу по обложке. Думаешь, я такая глупая и совсем не убираюсь? ..Я хотя бы пытаюсь. Нет этих мерзких запахов изо всех щелей и ничего нигде не бегает. Редкий шум моря и по-олная погружённость. А как иначе, по-твоему? Держать всё на видном месте? Неудобно, соглашусь, зато безопасно.

Прости за обстановку. Когда думаешь, то отвлекаться на таракана в канаве нету времени. ..Посмотри на пробковые доски. Что думаешь?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/4.mp3",
			["Answers"] = {
				{"..Ничего не вижу.", 5,},
				{"..Ничего не понимаю.", 5,},
				{"..Какая-то дичь.", 5,},
			},
		},
		[5] = {
			["Line"] = [[Глупый ты человечек. А о чём мы недавно говорили? Это всё - вообще всё - организация преступного соединения этого района! От шоссе до частного сектора включительно. Каждый переулок, каждое лицо и каждая зацепка - всё в этом гаражном архиве.

И даже этого недостаточно, чтобы захлопнуть Бруклин раз и навсегда. Где-то не хватает улик, где-то тупицы сбегут при первом же намёке на приближающуюся расправу.. Это как когда ловишь стаю мух одним стаканом. Потому приходится готовиться. 

Вечно.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/5.mp3",
			["Answers"] = {
				{"Мы об этом не говорили.", 6,},
				{"Что-то такое кажется помню.", 13,},
				{"И это всё твоих рук дело? Прям совсем-совсем?", 11,},
			},
		},
		[6] = {
			["Line"] = [[..Разве? Прости пожалуйста. Мне казалось, что мы это всё вроде обсуждали. Наш клиент - вот этот вот Лил Вэйн, к которому тебе пришлось наведаться - ключ для разгадки всей этой задачки. Он имеет связи, он много знает, и он болтает. Он боится.

Поэтому он и спрятался в подвале. А после установки прослушки мы узнали чуть-чуть больше. Там, так, мелочь: то, с кем он общается. И эта мелочь позволит нам давить дальше.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/6.mp3",
			["Answers"] = {
				{"Наверное, стоило упомянуть раньше - там стояла ещё одна прослушка.", 7,},
				{"С кем же он общается?", 13,},
				{"..Кажется, припоминаю, об этом был разговор.", 13,},
			},
		},
		[7] = {
			["Line"] = [[Я знаю. Сигнал глушился так, будто рядом стояло что-то похожее. Нам нужно доверять друг другу, понимаешь? Нам нужно отбросить все эти сложности и наконец сделать выбор. Я его уже сделала. Если бы я не доверяла, то тебя бы тут не стояло.

В-в смысле, в этом юните. У тебя бы мыслей о юните не появлялось. Убивать - плохо.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/7.mp3",
			["Answers"] = {
				{"Прости. Я постараюсь.", 8,},
				{"Прости. На это нужно время.", 9,},
				{"Доверие нужно заслужить. На это нужно время.", 9,},
				{"Доверие нужно заслужить. С твоими выходками этого не выйдет.", 10,},
			},
		},
		[8] = {
			["Line"] = [[Спасибо. Я это ценю. Продолжим?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/8.mp3",
			["Answers"] = {
				{"Да.", 13,},
			},
		},
		[9] = {
			["Line"] = [[Понимаю. Всему своё время. Продолжим?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/9.mp3",
			["Answers"] = {
				{"Да.", 13,},
			},
		},
		[10] = {
			["Line"] = [[Как скажешь. Только не дай своей упёртости запороть такое важное дело. Продолжим?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/10.mp3",
			["Answers"] = {
				{"Да.", 13,},
			},
		},
		[11] = {
			["Line"] = [[Да. Почти. Думаешь, наша полиция настолько бесполезна? ..Так-то да, однако эта бесполезность - такая же мелочь, о каких постоянно говорит Джона. Кто-то что-то приносит, кто-то что-то уносит - формируется так сказать коллективное сознание. Оно переговаривается и забывается о конфиденциальности.

Человеческий фактор, понимаешь? Вот я и наблюдаю за этим. Слушаю. Записываю. Большая часть мыслей записана тут, дабы не потерять. Что-то мелкое остаётся в офисе. Что-то, что может привести ко мне, естественно. Пока что, об этом месте знаешь только ты; я оплачиваю аренду из своего кармана, не из бюджета.

Никто более даже не пытался. Это как-то огорчает.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/11.mp3",
			["Answers"] = {
				{"Огорчает, что никто тебя не нашёл?", 12,},
				{"Огорчает, что никто не понимает очевидного?", 12,},
				{"..Кажется, я понимаю.", 12,},
			},
		},
		[12] = {
			["Line"] = [[Это.. один из таких моментов, когда все возможные опасения и мысли являются правдой одновременно. Все ужасы и предположения, все точки зрения. 'Правда страннее фикции'. А тут, она ещё и страшнее. Но не будем об этом. Продолжим?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/12.mp3",
			["Answers"] = {
				{"Да.", 13,},
			},
		},
		[13] = {
			["Line"] = [[Отлично. Так, сейчас..

..Я.. Ага..

Хм..]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/13.mp3",
			["Answers"] = {
				{"Всё в порядке?", 14,},
			},
		},
		[14] = {
			["Line"] = [[А? Да, всё нормально. Прости, не могу не думать. У меня такое часто. Помнишь некоего Дезза? Вроде о нём шла где-то речь. ..Или нет? В любом случае - очень страшный индивид. Вот ты скажешь - просто барыга, да? И этот барыга держит контроль над всеми 'Лил Вэйнами' этого тухлого места.

До момента с прослушкой, это была лишь конъектура. А теперь у нас есть доказательства, что Дезз отдаёт приказы. И ладно ещё, одной какой пешке - телохранитель какой. Так там такие эпитеты звучали.. От самого Вэйна.

Он боялся. Мне аж самой не по себе слушать и в голове прокручивать его ответы. Ему звонил Дезз - звонок шёл с одноразового предоплаченного телефона. Ну кому ещё так шестёрке звонить?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/14.mp3",
			["Answers"] = {
				{"Почему мы не можем повязать Дезза сразу? Почему этого не сделали раньше?", 15,},
				{"..У тебя нет доказательств что это Дезз, не так ли?", 16,},
				{"Кому-то, кто хочет на него надавить? Не думала, что тут может быть больше, чем просто одиночки и другие ОПГ?", 17,},
				{"Имитация. Он мог узнать через связи о наших авантюрах и дать ненастоящую пищу для размышлений. Чтобы сбить с толку.", 18,},
				{"Не знаю.", 19,},
			},
		},
		[15] = {
			["Line"] = [[Ну ты чем слушаешь? Тупица! У простых смертных нет никаких доказательств - для них это мелкая сошка, каких тут море! Море! А у нас их столько, что все разбегутся как только Дезз сядет. Ну, в смысле мы знаем что они это сделают, как это случится.

Он всё распланировал - всё перед тобой, на главной доске! Точки с мусором, сбыт, продажа, 'теряющиеся машины', убийства - это всё его рук дело! И у него вдруг не будет плана после собственной поимки? Да даже я не такая наивная, как ты!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/15.mp3",
			["Answers"] = {
				{"Прости. Сложно думать над всем, всем.. этим.", 20,},
				{"Не кричи. Это огромный объём информации.", 20,},
				{"Заткнись. От тебя исходят одни отмазки.", 21,},
			},
		},
		[16] = {
			["Line"] = [[Конечно есть! Только для их принятия нужно осознать всю эту картину. Всё то, что перед тобой. Потому что само по себе оно будет казаться какой-то хернёй. Да и к тому же, все разбегутся как только Дезз сядет. Это слишком очевидно.

Он распланировал всё - и это 'всё' прямо перед тобой, на главной доске. Точки с мусором, сбыт, продажа, 'теряющиеся машины', убийства - это всё его рук дело! Да тут на тринадцать пожизненных хватит как минимум!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/16.mp3",
			["Answers"] = {
				{"Вау.", 20,},
				{"Об этом нужно хорошо подумать..", 20,},
				{"Для меня это чистые совпадения. Они слишком глупые.", 21,},
			},
		},
		[17] = {
			["Line"] = [[Это.. хорошая мысль. Только, даже одиночки и другие организации должны просить разрешение Дезза. Вот в участке есть постоянная рубрика с людьми, пропавшими при загадочных обстоятельствах. Половина из них прекрасно подпадает под убийства связных Дезза. Наши доски хотя бы дают смысл этим исчезновениям.

Думаешь, есть ещё больший игрок? Только, кто..? О, точно!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/17.mp3",
			["Answers"] = {
				{"Что?", 22,},
			},
		},
		[18] = {
			["Line"] = [[Думаешь? А много ли актёров среди чёрных? ..Ну, хорошо, среди криминала в целом? Как-то маловероятно.. Но отрицать нельзя в любом случае. Учитывая, как Дезз оркестрирует всем хаосом вокруг - это тоже возможно. ..Ну конечно!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/18.mp3",
			["Answers"] = {
				{"Что?", 22,},
			},
		},
		[19] = {
			["Line"] = [[Это вполне может быть кто-то другой, но пока что у нас нет даже и намёка, чтобы делать такие предположения. Или этот кто-то настолько хорош, или мы уже на верном пути. ..Точно!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/19.mp3",
			["Answers"] = {
				{"Что?", 22,},
			},
		},
		[20] = {
			["Line"] = [[..Прости. Жить с таким набором информации сложно. Вот это всё - тоже сложно. Я ни в коем не заставляю тебя всё принимать как есть, и не даю никакие временные рамки. Просто.. Ну конечно!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/20.mp3",
			["Answers"] = {
				{"Что?", 22,},
			},
		},
		[21] = {
			["Line"] = [[Ты не веришь? Я раскрываю тебе тайну, какой не купить за весь Форт Нокс, а ты не веришь? Да как ты смеешь! Тупица! Вот увидишь! Всему своё время! ..О, знаю!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/21.mp3",
			["Answers"] = {
				{"Что?", 22,},
			},
		},
		[22] = {
			["Line"] = [[Дело же не стоит на месте! Как я могла забыть, что наша задача - упростить кейс для судьи? Мы обязательно всех переловим! И этот склад будем использовать как штаб. Все улики, все предположения, какие-либо претензии - всё будем оставлять тут. 

Наверное, стоит ещё кое-что упомянуть, пусть это и очевидно. Тут хранятся очень важные документы. Никого не пускай, даже не намекай на существование этого склада! Не важно, кто спросит - лучший друг, Джона, у меня амнезия случится.. Ни при каких обстоятельствах!

..Если вдруг кому-то пригодятся сами папки и ящики с делами, или что-то нужно будет перенести, то это нужно будет сделать лично. Пока что этим буду заниматься я, но Джона может попросить и тебя.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/22.mp3",
			["Answers"] = {
				{"Хорошо. Что дальше?", 23,},
			},
		},
		[23] = {
			["Line"] = [[А дальше у нас дела. Я буду сильнее думать над тем что тут происходит, а как сформируется какой-нибудь план или мысль, то сообщу. Мы будем часто выдвигаться в разные точки - искать зацепки и производить рейды. Везде будем косить под глупых и делать девяносто вещей одновременно.

А ты.. Напиши пожалуйста рапорт, я его потом привезу комиссару. Не пиши об этом месте - просто скажи, что обо всём теперь знаешь. А, и перенеси в юнит коробки, пожалуйста. Грузовик же тут? Должен быть тут. Только не заезжай на нём внутрь.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/23.mp3",
			["Answers"] = {
				{"Ладно.", "MQS Continue quest",},
				{"Чей это грузовик?", 24,},
				{"Я могу как-то помочь с продвижением нашего плана?", 25,},
				{"Ты ничего не забыла?", 26,},
			},
		},
		[24] = {
			["Line"] = [[Грузовик департамента. Подобные часто используют для разных защищённых перевозок, ну и.. Я решила реквизировать его для наших дел. Это совершенно законно, если что. ..Так, пора работать. Рапорт, коробки, а потом ожидание. Идёт?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/24.mp3",
			["Answers"] = {
				{"Идёт.", "MQS Continue quest",},
				{"Я могу как-то помочь с продвижением нашего дела?", 25,},
				{"Ты ничего не забыла?", 26,},
			},
		},
		[25] = {
			["Line"] = [[Хм.. Прямо сейчас - только тем, что я от тебя прошу. У нас нет ничего большего, что потребовало бы наше срочное внимание. Только грузовик, перенос улик и дать мне собрать пазл воедино. Хорошо?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/25.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Чей это грузовик?", 24,},
				{"Ты ничего не забыла?", 26,},
			},
		},
		[26] = {
			["Line"] = [[..О, точно! Вот, перед тобой блокнот - в нём все мои мысли. Как-нибудь пригодится; понимаешь, к чему я? А, и вторые ключи не забудь. Они где-то на столе с мониторами.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/unit/26.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Чей это грузовик?", 24,},
				{"Я могу как-то помочь с продвижением нашего дела?", 25,},
			},
		},
	}
}