-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\police_wolf_threat.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["police_wolf_threat"] = {
	name = "Арианна Вульф",
	desc = "Детектив",
	n_icon = Material("ranks_ui/icons/nypd/dt1.png", "smooth"),
	model = "models/cityrp/pm/nypd/female_01.mdl",
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = true,
	pos = {},
	sequence = "pose_standing_01",
	uselimit = false,
	skin = 1,
	bgr = {[2] = 1,[5] = 1,},
	ClModels = {
		{ model = "models/cityrp/nypd/badge_dt1.mdl", pos = Vector(3,-1.9,7.25), ang = Angle(0,150,60), bone = 4},
	},
	dialogs = {
		[1] = {
			["Line"] = [[...]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "close",},
			},
		},
		[2] = {
			["Line"] = [[О, вот и ты. Нам наконец дали дело. Как голова? Думать можешь?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/2.mp3",
			["Answers"] = {
				{"Да.", 8,},
				{"Наверное.", 3,},
				{"Нет.", 3,},
			},
		},
		[3] = {
			["Line"] = [[Тупица! Это что надо делать, чтобы не отойти к рабочему дню?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/3.mp3",
			["Answers"] = {
				{"Пить?", 4,},
				{"Пробовать наркотики?", 4,},
				{"Не выспаться после тяжёлой рабочей недели?", 6,},
				{"Забыться в кафетерии от недоедания?", 7,},
			},
		},
		[4] = {
			["Line"] = [[Скажи что ты шутишь. Пожалуйста.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/4.mp3",
			["Answers"] = {
				{"Не шучу. Честное полицейское.", 5,},
				{"Конечно шучу.", 7,},
			},
		},
		[5] = {
			["Line"] = [[...

..Нет, я не могу это так оставить.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/5.mp3",
			["Answers"] = {
				{"Постой..!", "MQS Fail quest",},
			},
		},
		[6] = {
			["Line"] = [[..Тупица. Ну ты конечно умеешь пугать. Знаешь, советую тебе купить тоналку. Видишь мои мешки под глазами? Это для нас нормальное состояние. Зарабатывается на первый же рабочий день. Ну, ты и так это знаешь, скорее всего. На твоих можно носить блоки для египетских пирамид.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/6.mp3",
			["Answers"] = {
				{"Спасибо. Так для чего сейчас надо думать?", 8,},
			},
		},
		[7] = {
			["Line"] = [[..Тупица. Ну ты конечно умеешь пугать. Знаешь, советую тебе купить чай. Кофе не всем можно, а вот чай очень помогает прийти в себя. Прям во лбу лёгкость чувствуется.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/7.mp3",
			["Answers"] = {
				{"Спасибо. Так для чего сейчас надо думать?", 8,},
			},
		},
		[8] = {
			["Line"] = [[Не знаю даже, как продолжить. Это как-то.. не правильно. Но это нужно сделать.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/8.mp3",
			["Answers"] = {
				{"Ты о чём?", 9,},
			},
		},
		[9] = {
			["Line"] = [[Да я про задачу. Я думала взять на себя самую тяжёлую часть, с точки зрения морали. Уже план составила, всё готово, и тут осознание: самая тяжёлая часть у тебя. Вечная ходьба и обзвоны выматывают, но.. Незаконная установка прослушивающего устройства будет терзать дольше.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/9.mp3",
			["Answers"] = {
				{"Как насчёт поменяться?", 10,},
				{"Да ладно тебе. Справлюсь.", 11,},
				{"Это не правильно.", 12,},
			},
		},
		[10] = {
			["Line"] = [[Мы не можем. Я уже всё решила, занялась своей частью и совсем не хочу ничего менять. Меня разорвёт иначе, я всё распланировала и расписала! Я знаю, я глупая, но что на моём месте сделал бы кто угодно другой? ..То же самое. Это срочное дело. Это нужно решать сразу.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/10.mp3",
			["Answers"] = {
				{"Почему?", 13,},
			},
		},
		[11] = {
			["Line"] = [[Думаешь? Это тебе только пока кажется, что моральные корни ничего не сделают. Поверь, у меня и не такое бывало, а гложило потом долго. Нет, будь ещё время - я бы не беспокоилась и уделила бы внимание тебе, на борьбу с дурной психикой. А тут.. Задание срочное. И отказаться никак. Нужно решать сразу.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/11.mp3",
			["Answers"] = {
				{"Почему?", 13,},
			},
		},
		[12] = {
			["Line"] = [[Я о том же! ..Пожалуйста, прости меня. Я не могу не решать всё наперёд - всю жизнь так живу и работаю! Спасло шкуры многих полицейских бесчисленное количество раз. А тут ещё и выбора нет - дело срочное. Отказаться никак. Нужно решать сразу.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/12.mp3",
			["Answers"] = {
				{"Почему?", 13,},
			},
		},
		[13] = {
			["Line"] = [[Подозреваемый параноик настолько же, насколько мы одиноки. И он связан с этим гигантским нарко-траффиком. Доказательств пока прямых нет, только конъектура - но для нас этого должно быть достаточно, нужно давить! Не пугать, не ловить, а вязать сразу же! Только мы не можем.

Мы ничего не можем. Постоянно одно и то же. Мерзотные лидеры преступных соединений закрываются бумагами, педофилы стирают себя из интернета прикрываясь гайдлайнами.. Это не справедливо. Всё, как Джона говорит.

Поэтому нужно поставить прослушку. Ставить жучок незаконно, а использовать его в качестве доказательств можно. Это единственный вариант.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/13.mp3",
			["Answers"] = {
				{"Почему жучок?", 14,},
				{"Почему ты думаешь, что это единственный вариант?", 14,},
				{"Почему нельзя его взять на допрос?", 14,},
			},
		},
		[14] = {
			["Line"] = [[Потому что он молчаливый. Я знаю такой типаж - они раскалываются, если давить. ..Если есть чем давить. А он бывалый - дружит с такими, как Дезз. Может, знаешь про такого. Мелочёвка, за этим точно стоит кто-то повыше. Такие разговаривают там, где им дают поговорить.

А если им не дают, то они создают себе зону для разговоров. Из-за давления наш подозреваемый снял в аренду загородный дом, подальше от всей, кхм, 'движухи'. В каждом из домов на улице Мэйпл есть подвал - и я просто не верю, что он его не использует.

Этот город слишком опасный, чтобы стоять на улице как мы и спокойно говорить. Он будет использовать эту возможность.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/14.mp3",
			["Answers"] = {
				{"Почему?", 15,},
				{"Это всё - вообще всё - одно твоё предположение?", 16,},
			},
		},
		[15] = {
			["Line"] = [[Потому что мой опыт не даёт соединить картину иначе. Пазл перед нами - надо действовать. А если тебе и этого мало, то в деле на некоего 'Лил Вэйна' стоит пометка, что тот очень-очень болтливый. А перед нами оказывается молчаливый. Не находишь это странным?

Нужно давить. Нужно наглеть. Давай, ты сможешь!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/15.mp3",
			["Answers"] = {
				{"Что мне делать? Где достать прослушку?", 17,},
			},
		},
		[16] = {
			["Line"] = [[Впечатляет, не так ли? Детективами не становятся просто так. А если тебе вдруг этого как-то мало, то в деле на некоего 'Лил Вэйна' стоит пометка, что тот очень-очень болтливый. А перед нами оказывается молчаливый. Не находишь это странным?

Нужно давить. Нужно наглеть. Давай, ты сможешь!]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/16.mp3",
			["Answers"] = {
				{"Что мне делать? Где достать прослушку?", 17,},
			},
		},
		[17] = {
			["Line"] = [[Я уже всё подготовила. Прослушивающее устройство лежит в пакете. Там же ты найдёшь отмычку. ..Что? Мы носим отмычки на случай, если никого нет дома. Ну, то есть, на месте преступления. Не выламывать же дверь с петель при каком-то намёке?

Только не взламывай замок сразу же, как мокрица какая - если в доме кто-то есть, то попроси открыть дверь. Если вдруг кто просто прописан - выпиши ордер. А когда уже всё никак, то ломай. Не забудь только опечатать, как закончишь.

..Стой, забудь. Опечатаешь - параноик что-то заподозрит. Попробуй просто закрыть дверь снаружи.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/17.mp3",
			["Answers"] = {
				{"Хорошо. Приступаю.", 18,},
			},
		},
		[18] = {
			["Line"] = [[Постой! Я как закончу, то буду ждать на этом же месте. Расскажешь, как всё пройдёт?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/18.mp3",
			["Answers"] = {
				{"Да. Пора идти.", "MQS Continue quest",},
				{"Зачем?", 19,},
			},
		},
		[19] = {
			["Line"] = [[Мы партнёры, или как? У нас общее дело. Так будет быстрее.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/19.mp3",
			["Answers"] = {
				{"Точно. Тогда приступаю.", "MQS Continue quest",},
			},
		},
		[20] = {
			["Line"] = [[Как всё прошло?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/20.mp3",
			["Answers"] = {
				{"Гладко.", 21,},
				{"Не лучшим образом. Там уже стоял жучок.", 24,},
			},
		},
		[21] = {
			["Line"] = [[Совсем? Без всякой дичи? У такого параноика..?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/21.mp3",
			["Answers"] = {
				{"Представь себе - да.", 22,},
				{"Кроме того факта, что там стояла ещё одна прослушка.", 24,},
			},
		},
		[22] = {
			["Line"] = [[Вау. Хорошо. Тогда я работать над второй частью плана. Буду слушать и перебирать то, что нашла. Поведаю потом. Как на это смотришь?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/22.mp3",
			["Answers"] = {
				{"Позитивно.", "MQS Continue quest",},
				{"Негативно. Расскажи сейчас.", 23,},
				{"Негативно. Картину можно сложить сейчас. Там стоял ещё один жучок.", 24,},
			},
		},
		[23] = {
			["Line"] = [[Прости, пока что это мозговая бессмыслица. Куча разных планов, для которых даже я не могу собрать общую картину.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/23.mp3",
			["Answers"] = {
				{"Хорошо. Удачи.", "MQS Continue quest",},
				{"..Только в голову влетело. Там стояла ещё одна прослушка.", 24,},
			},
		},
		[24] = {
			["Line"] = [[..Блять! Тупица! Чего ты сразу о таком не говоришь? Для чего тебе телефон?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/24.mp3",
			["Answers"] = {
				{"...", 25,},
				{"Следи за языком.", 25,},
				{"Извини.", 25,},
				{"Так с тобой вообще никак не связаться!", 25,},
			},
		},
		[25] = {
			["Line"] = [[Прости, меня понесло. Это очень важная зацепка! Теперь всё имеет смысл! О боже.. Такое удовлетворение, что слов нет. ..А? Ой, точно. Помнишь тебе приходилось лизать задницу Хогстону? Вот те наркотики очень даже связаны с Лил Вэйном. А Вэйн связан с Деззом.

Мне кажется что это его жучок. И если это так, то какой-то там мелкий барыга окажется криминальным лордом. Лордом, понимаешь? Вся эта империя мусорных баков - часть огромного плана! Нас водят за нос таким лёгким образом! ..Больше не водят. Благодаря нам.

В особенности тебе. Спасибо. Ты только про наши авантюры не говори никому - товарищу Колдуэллу тоже. Наш карточный домик может легко сдуться. С меня как-нибудь ужин. ]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/25.mp3",
			["Answers"] = {
				{"..Могу я вставить хоть слово?", 26,},
				{"Спасибо, учту.", 29,},
				{"Спасибо, откажусь.", 29,},
				{"Это твоя плата за молчание?", 29,},
			},
		},
		[26] = {
			["Line"] = [[Тебе есть, что сказать?]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/26.mp3",
			["Answers"] = {
				{"..Нет. Пока нет. Не знаю.", 27,},
				{"Как-то всё не сочетается. Звучит слишком фантастично. Как какая-то книга.", 27,},
				{"Ты молодец. Как у тебя получается бывать в стольких местах одновременно?", 28,},
			},
		},
		[27] = {
			["Line"] = [[..Вот я о том же. Ты всё скоро поймёшь, нам просто нужно время! Доверься мне! Пожалуйста.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/27.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Нам нужно рассказать комиссару.", "MQS Continue quest",},
				{"Я пока не могу.", "MQS Continue quest",},
			},
		},
		[28] = {
			["Line"] = [[Сама не понимаю, как до такого докатилась. У меня нет жизни. И отсутствие собственных амбиций выливается в помощь народу. Я понимаю как это всё звучит - тоже начинала с того же, что и ты. Просто доверься мне! Пожалуйста.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/28.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Нам нужно рассказать об этом комиссару.", "MQS Continue quest",},
				{"Я пока не могу.", "MQS Continue quest",},
			},
		},
		[29] = {
			["Line"] = [[Я настаиваю. Это моя благодарность тебе. Ты и Джона - единственные, кто на меня не смотрит косо. ..Ну или не так косо. В любом случае, мне надо всё это переварить. А тебе пора вернуться в обычную жизнь. У тебя она к счастью есть.]],
			["Sound"] = "https://macnco.one/gmod/vo/wolf/threat/29.mp3",
			["Answers"] = {
				{"Хорошо. Удачи.", "MQS Continue quest",},
				{"Нам нужно рассказать об этом комиссару.", "MQS Continue quest",},
				{"Я тебе не доверяю.", "MQS Continue quest",},
			},
		},
	}
}