-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\season_valve.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["season_valve"] = {
	name = "Магистраль",
	model = "models/hunter/blocks/cube075x1x1.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	noinfo = true,
	pos = {},
	submat = {
		[0] = "null"
	},
	sequence = "",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Давление в порядке. По крайней мере, трубы не дают видимых сбоев.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Давление существенно упало. Последний вызов пожарных иссушил магистраль.]],
			["Sound"] = "",
			["Answers"] = {
				{"Взглянуть на вентили поближе", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[На трубах нет никаких обозначений. На двух единственных вентилях счётчики - и оба держатся у самого начала. Давление почти на нуле.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 4,},
				{"Прокрутить второй вентиль", 6,},
				{"Подождать", 10,},
			},
		},
		[4] = {
			["Line"] = [[Давление в первой трубе поднялось. По трубе заметно что-то полилось.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 11,},
				{"Прокрутить второй вентиль", 5,},
				{"Подождать", 12,},
			},
		},
		[5] = {
			["Line"] = [[Давление стабилизировалось.]],
			["Sound"] = "",
			["Answers"] = {
				{"Вернуть вентили в исходное положение", "MQS Continue quest",},
			},
		},
		[6] = {
			["Line"] = [[Ничего не произошло. Если бы звук этого 'ничего' шёл через трубу - он бы звучал как медленно пустеющая раковина.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 7,},
				{"Прокрутить второй вентиль", 11,},
				{"Подождать", 13,},
			},
		},
		[7] = {
			["Line"] = [[Напора не хватает для стабилизации обеих главных труб.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 9,},
				{"Прокрутить второй вентиль", 8,},
				{"Подождать", 7,},
			},
		},
		[8] = {
			["Line"] = [[Давление в первой трубе поднялось.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 11,},
				{"Прокрутить второй вентиль", 5,},
				{"Подождать", 12,},
			},
		},
		[9] = {
			["Line"] = [[Опять звук опустошения. Вода не идёт.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 7,},
				{"Прокрутить второй вентиль", 11,},
				{"Подождать", 13,},
			},
		},
		[10] = {
			["Line"] = [[Что-то должно измениться?]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 4,},
				{"Прокрутить второй вентиль", 6,},
				{"Подождать", 10,},
			},
		},
		[11] = {
			["Line"] = [[Всё вернулось назад. Начинаем сначала.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 4,},
				{"Прокрутить второй вентиль", 6,},
				{"Подождать", 10,},
			},
		},
		[12] = {
			["Line"] = [[Давление в первой трубе критическое. Ожидание не поможет.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 11,},
				{"Прокрутить второй вентиль", 5,},
				{"Подождать", 12,},
			},
		},
		[13] = {
			["Line"] = [[Звук пропал. Вода - тоже.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 7,},
				{"Прокрутить второй вентиль", 11,},
				{"Подождать", 13,},
			},
		},
		[14] = {
			["Line"] = [[Давление в первой трубе критическое. Во второй его нет. Видимо, пришлось задействовать больше воды чем обычно.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 16,},
				{"Прокрутить второй вентиль", 5,},
				{"Подождать", 15,},
			},
		},
		[15] = {
			["Line"] = [[Шипящий пар просачивается через трубные соединения. Неужели ожидание стоит исхода?]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 16,},
				{"Прокрутить второй вентиль", 5,},
				{"Подождать", 15,},
			},
		},
		[16] = {
			["Line"] = [[Давление снижается до нормального положения. Однако, это не надолго.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 18,},
				{"Прокрутить второй вентиль", 6,},
				{"Подождать", 17,},
			},
		},
		[17] = {
			["Line"] = [[Давление в обоих главных трубах упало до нуля. Отлично. Пора подать воду заново - и как следует.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 4,},
				{"Прокрутить второй вентиль", 6,},
				{"Подождать", 10,},
			},
		},
		[18] = {
			["Line"] = [[Давление вернулось к критическому.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прокрутить первый вентиль", 16,},
				{"Прокрутить второй вентиль", 5,},
				{"Подождать", 15,},
			},
		},
	}
}