-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\season_care.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["season_care1"] = {
	name = "Пациент",
	model = "models/cityrp/pm/normal/male_08.mdl",
	namepos = 80,
	theme = "Retro",
	submat = {
		[4] = "gbskins/outfit/top_204",
		[8] = "gbskins/outfit/pants_204",
		[9] = "gbskins/outfit/boots_71"
	},
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "injured3",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["season_care1_1"] = {
	name = "Пациент",
	model = "models/cityrp/pm/normal/male_08.mdl",
	namepos = 80,
	theme = "Retro",
	submat = {
		[4] = "gbskins/outfit/top_204",
		[8] = "gbskins/outfit/pants_204",
		[9] = "gbskins/outfit/boots_71"
	},
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "injured4_sitpostidle",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Старика стошнило на окружение и на себя. И как только его так угораздило..?]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "MQS Continue quest",},
			},
		},
		[3] = {
			["Line"] = [[Нужды бедного деда так игнорировали, что тот сходил под себя. И как только никто не заметил вонь в стерильных условиях..?]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "MQS Continue quest",},
			},
		},
		[4] = {
			["Line"] = [[Пациент получил побои, пока передвигался без надзора. И как только его не заметили..?]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["season_care2"] = {
	name = "Пациент",
	model = "models/cityrp/pm/normal/male_02.mdl",
	namepos = 80,
	theme = "Retro",
	submat = {
		[4] = "gbskins/outfit/top_204",
		[8] = "gbskins/outfit/pants_204",
		[9] = "gbskins/outfit/boots_71"
	},
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "d1_town05_wounded_idle_1",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Пациент стабилен. Однако, стабильность нужно поддерживать. Физраствор почти закончился.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
		[4] = {
			["Line"] = [[Пациенту плохо. Изначально и не понять, что не так.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["season_care3"] = {
	name = "Пациент",
	model = "models/cityrp/pm/normal/male_07.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	submat = {
		[4] = "gbskins/outfit/top_204",
		[8] = "gbskins/outfit/pants_204",
		[9] = "gbskins/outfit/boots_71"
	},
	pos = {},
	sequence = "d1_town05_wounded_idle_2",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Пациенту нехорошо. Кто-то забыл подключить человека к капельнице.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
		[4] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 5,},
				{"Отойти", "close",},
			},
		},
		[5] = {
			["Line"] = [[Пациенту плохо. Изначально и не понять, что не так.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
		[6] = {
			["Line"] = [[В истории пациента указано вялое нежелание удовлетворять свои базовые потребности. Больной не выходил есть несколько дней.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["season_care4"] = {
	name = "Пациент",
	model = "models/cityrp/pm/normal/male_05.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	pos = {},
	submat = {
		[4] = "gbskins/outfit/top_204",
		[8] = "gbskins/outfit/pants_204",
		[9] = "gbskins/outfit/boots_71"
	},
	sequence = "d1_town05_winston_down",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Кажется, у человека болит сердце.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
		[4] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 5,},
				{"Отойти", "close",},
			},
		},
		[5] = {
			["Line"] = [[Пациенту плохо. Изначально и не понять, что не так.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
		[6] = {
			["Line"] = [[В истории пациента расписано неприличное количество болезней. Иммунитет оставляет желать лучшего.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["season_care5"] = {
	name = "Пациент",
	model = "models/cityrp/pm/normal/male_02.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	submat = {
		[4] = "gbskins/outfit/top_204",
		[8] = "gbskins/outfit/pants_204",
		[9] = "gbskins/outfit/boots_71"
	},
	pos = {},
	sequence = "d1_town05_wounded_idle_2",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[..Хотя, надо ли оно спящему человеку?]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
		[4] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 5,},
				{"Отойти", "close",},
			},
		},
		[5] = {
			["Line"] = [[Пациенту плохо. Изначально и не понять, что не так.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
		[6] = {
			["Line"] = [[В истории пациента обозначены необходимые для приёма препараты. Скорее всего, больному их не дали.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["season_care6"] = {
	name = "Пациент",
	model = "models/cityrp/pm/normal/male_06.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	submat = {
		[4] = "gbskins/outfit/top_204",
		[8] = "gbskins/outfit/pants_204",
		[9] = "gbskins/outfit/boots_71"
	},
	pos = {},
	sequence = "d1_town05_wounded_idle_2",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Пациент изобразил рукой стакан и сделал вид, будто пьёт. Кажется, ему нужно воды.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
		[4] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 5,},
				{"Отойти", "close",},
			},
		},
		[5] = {
			["Line"] = [[Пациенту плохо. Изначально и не понять, что не так.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
		[6] = {
			["Line"] = [[В истории пациента отдельно выделена строка с аллергенами. Скорее всего, предыдущий врач проигнорировал наставления.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["season_care7"] = {
	name = "Пациент",
	model = "models/cityrp/pm/normal/male_08.mdl",
	namepos = 80,
	theme = "Retro",
	--material = "null",
	submat = {
		[4] = "gbskins/outfit/top_204",
		[8] = "gbskins/outfit/pants_204",
		[9] = "gbskins/outfit/boots_71"
	},
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "d1_town05_wounded_idle_2",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Пациент указывает на подушку. Перья разложились, подушка совсем распрямилась.]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
		[4] = {
			["Line"] = [[За пациентом явно недоглядывают. Если бы только кто-то обратил на него внимание..]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 5,},
				{"Отойти", "close",},
			},
		},
		[5] = {
			["Line"] = [[..Хотя, надо ли оно спящему человеку?]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["season_wolf"] = {
	name = "Пациент",
	model = "models/cityrp/pm/normal/female_01.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "lying_down",
	uselimit = false,
	skin = 1,
	bgr = {},
	submat = {
		[4] = "gbskins/outfit/top_204",
		[9] = "gbskins/outfit/pants_204",
		[10] = "gbskins/outfit/boots_71"
	},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Пациент уже издалека выглядит крайне больным. Чего уж тут говорить про нюансы?]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Пациент уже издалека выглядит крайне больным. Чего уж тут говорить про нюансы?]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Девушка бледная. Она еле реагирует на внешние воздействия. Скорее всего, она в коматозе.]],
			["Sound"] = "",
			["Answers"] = {
				{"Проверить капельницу", 4,},
				{"Просмотреть аппарат жизнеобеспечения", 5,},
				{"Рассмотреть видимые части тела", 6,},
			},
		},
		[4] = {
			["Line"] = [[Прямо сейчас происходит переливание крови. Рядом висит пустой пакет с кровью. Литровые объёмы.]],
			["Sound"] = "",
			["Answers"] = {
				{"Просмотреть аппарат жизнеобеспечения", 5,},
				{"Рассмотреть видимые части тела", 6,},
				{"Сделать выводы", 9,},
			},
		},
		[5] = {
			["Line"] = [[Сердце бьётся крайне быстро. Стресс, или нехватка организмом чего-то жизненно необходимого?]],
			["Sound"] = "",
			["Answers"] = {
				{"Проверить капельницу", 4,},
				{"Рассмотреть видимые части тела", 6,},
				{"Сделать выводы", 9,},
			},
		},
		[6] = {
			["Line"] = [[Видно только лицо. Руки перебинтованы.]],
			["Sound"] = "",
			["Answers"] = {
				{"Проверить капельницу", 4,},
				{"Просмотреть аппарат жизнеобеспечения", 5,},
				{"Снять бинты", 7,},
				{"Сделать выводы", 9,},
			},
		},
		[7] = {
			["Line"] = [[На венах рубцы. Не от порезов - от резких проникновений по прямой. Размеры аномалий схожи с малым пистолетным калибром.]],
			["Sound"] = "",
			["Answers"] = {
				{"Забинтовать руки назад", 8,},
			},
		},
		[8] = {
			["Line"] = [[Девушка бледная. Она еле реагирует на внешние воздействия. Скорее всего, она в коматозе.]],
			["Sound"] = "",
			["Answers"] = {
				{"Проверить капельницу", 4,},
				{"Просмотреть аппарат жизнеобеспечения", 5,},
				{"Рассмотреть видимые части тела", 6,},
				{"Сделать выводы", 9,},
			},
		},
		[9] = {
			["Line"] = [[Человек не в стабильном состоянии. Почему больным не занимаются врачи?]],
			["Sound"] = "",
			["Answers"] = {
				{"Принять к сведению", "MQS Continue quest",},
			},
		},
		[10] = {
			["Line"] = [[По документам, человек почти в порядке. Его собираются выписывать через несколько дней. Не хватает лишь одной решающей врачебной подписи - за или против.]],
			["Sound"] = "",
			["Answers"] = {
				{"Узнать личные данные пациента", 11,},
				{"Просмотреть рекомендации к лечению", 12,},
				{"Поставить подпись", "MQS Continue quest",},
			},
		},
		[11] = {
			["Line"] = [[Арианна Вульф. Офицер полиции. Работает в полицейском участке №92. В больницу попала после перестрелки. Место инцидента: улица Плезант, дом 2.]],
			["Sound"] = "",
			["Answers"] = {
				{"Просмотреть рекомендации к лечению", 12,},
				{"Поставить подпись", "MQS Continue quest",},
			},
		},
		[12] = {
			["Line"] = [[Больному советуют постельный режим и правильный рацион питания. Типично.]],
			["Sound"] = "",
			["Answers"] = {
				{"Узнать личные данные пациента", 11,},
				{"Поставить подпись", "MQS Continue quest",},
			},
		},
	}
}