-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\season_tablet.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["season_tablet"] = {
	name = "Планшет",
	model = "models/uc/props_interior/extinguisher_case.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	pos = {
		["rp_southside_noire"] = {Vector(-283.73333740234,-1613.015625,4537.03125), Angle(0,-2.0558528900146,0 )},
	},
	sequence = "lineidle02",
	uselimit = false,
	ignore = true,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Время учёта. И недочётов.]],
			["Sound"] = "",
			["Answers"] = {
				{"Вытащить планшет", 2,},
			},
		},
		[2] = {
			["Line"] = [[Что же тут не так?]],
			["Sound"] = "",
			["Answers"] = {
				{"Отметить полный порядок", 3,},
				{"Выделить отсутствие огнетушителя на видном месте", 4,},
				{"Уточнить замену знака 'выход' сигнализацией", 5,},
				{"Написать про беспорядок", 6,},
				{"Выдумать незначительные нарушения", 9,},
			},
		},
		[3] = {
			["Line"] = [[Очень хорошо. Пока дело не дойдёт до практики, разумеется.]],
			["Sound"] = "",
			["Answers"] = {
				{"Убрать планшет", "MQS Continue quest",},
			},
		},
		[4] = {
			["Line"] = [[Есть он на деле или нет - доказывать владельцу этого места. Головная боль всем участникам процесса гарантирована. Кроме вас, конечно же.]],
			["Sound"] = "",
			["Answers"] = {
				{"Убрать планшет", "MQS Continue quest",},
			},
		},
		[5] = {
			["Line"] = [[Креативно, однако. Правда, юристы явно не оценят отход от традиций в принципах пожарной безопасности. В любом случае, это уже совсем другая история.]],
			["Sound"] = "",
			["Answers"] = {
				{"Убрать планшет", "MQS Continue quest",},
			},
		},
		[6] = {
			["Line"] = [[Владелец заведения прямо напрашивается на неприятности! Поверят ли без подробностей? Тем и лучше если нет - наконец возьмутся за свою работу сами.]],
			["Sound"] = "",
			["Answers"] = {
				{"Убрать планшет", "MQS Continue quest",},
			},
		},
		[7] = {
			["Line"] = [[И что делать?]],
			["Sound"] = "",
			["Answers"] = {
				{"Вытащить планшет", 8,},
			},
		},
		[8] = {
			["Line"] = [[Верно. Работа требует выполнения в любом случае.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отметить полный порядок", 9,},
				{"Выделить, что заведение закрыто навсегда", 9,},
				{"Уточнить нецелесообразность проведения проверок для этого места", 9,},
				{"Выдумать незначительные нарушения", 9,},
			},
		},
		[9] = {
			["Line"] = [[Кажется, примерно так и работает пожарный департамент на самом деле..]],
			["Sound"] = "",
			["Answers"] = {
				{"Убрать планшет", "MQS Continue quest",},
			},
		},
	}
}