-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\season_inspector.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["season_inspector1"] = {
	name = "Марк Донован",
	model = "models/cityrp/pm/normal/male_09.mdl",
	submat = {
		[3] = "models/gmodbest/citizens/facemaps/erdim_facemap3",
		[9] = "gbskins/outfit/boots_3",
		[8] = "gbskins/outfit/pants_3",
		[4] = "gbskins/outfit/top_34",
	},
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "idle_all_01",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Да? Вы что-то хотели?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/1.mp3",
			["Answers"] = {
				{"Нет, простите.", "close",},
			},
		},
		[2] = {
			["Line"] = [[Да? Вы что-то хотели?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/1.mp3",
			["Answers"] = {
				{"Это вы писали по поводу работы?", 4,},
				{"Марк Донован?", 3,},
				{"Нет, простите.", "close",},
			},
		},
		[3] = {
			["Line"] = [[Мы знакомы?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/3.mp3",
			["Answers"] = {
				{"Возможно. Вы писали по поводу работы.", 4,},
				{"Вы знакомы с моим знакомым. Кем-то, кто порекомендовал меня.", 4,},
			},
		},
		[4] = {
			["Line"] = [[Ага.. так и думал что ошибся.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/4.mp3",
			["Answers"] = {
				{"Вы ждали кого-то другого?", 5,},
			},
		},
		[5] = {
			["Line"] = [[Не знаю, знаете ли вы такого человека или нет - я ждал Арианну Вульф. ..Что-ж, раз уж вы уже здесь, и раз нужный мне человек так и не откликнулся, то не вижу ничего плохого в предложении работы вам. Что думаете по поводу бюро расследования пожаров?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/5.mp3",
			["Answers"] = {
				{"Интересно.", 6,},
				{"Никогда не приходилось о таком задумываться.", 7,},
				{"Это не моё. До свидания.", "MQS Fail quest",},
			},
		},
		[6] = {
			["Line"] = [[Тогда, как насчёт попробовать себя в этом деле?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/6.mp3",
			["Answers"] = {
				{"Давайте.", 9,},
				{"Прямо сейчас?", 8,},
			},
		},
		[7] = {
			["Line"] = [[Не думаете попробовать себя в этом деле? Там нет ничего сложного - нужно всего лишь искать причинно-следственные связи.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/7.mp3",
			["Answers"] = {
				{"Попробуем.", 9,},
				{"Прямо сейчас?", 8,},
			},
		},
		[8] = {
			["Line"] = [[Да, прямо сейчас. Сегодня сложились все обстоятельства для проверки возможного будущего сотрудника пожарного департамента.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/8.mp3",
			["Answers"] = {
				{"Давайте попробуем.", 9,},
				{"Я пас. До свидания.", "MQS Fail quest",},
			},
		},
		[9] = {
			["Line"] = [[Чудно. У меня на примете как раз замечательное место для вашего теста - прямо за моей спиной. Недавно в этом доме произошло любопытное возгорание. Я и мои коллеги нашли три тела, уже разобрались в чём дело; вам никто не будет мешать расследовать ситуацию лично.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/9.mp3",
			["Answers"] = {
				{"Хорошо.", 10,},
			},
		},
		[10] = {
			["Line"] = [[После вас. Вы поймёте, куда заходить.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/10.mp3",
			["Answers"] = {
				{"Окей.", "MQS Continue quest",},
				{"Ага.", "MQS Continue quest",},
			},
		},
		[11] = {
			["Line"] = [[И так. Что думаете?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/11.mp3",
			["Answers"] = {
				{"Прямо перед участком. Смело.", 12,},
				{"Кошмар.", 12,},
				{"Обычное дело в Бруклине. Необычно место действия.", 12,},
			},
		},
		[12] = {
			["Line"] = [[Вот-вот. Обратите внимание на чёрное пятно.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/12.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[13] = {
			["Line"] = [[Ничего не напоминает?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/13.mp3",
			["Answers"] = {
				{"Начало возгорания пошло оттуда.", 14,},
				{"Взрыв.", 14,},
				{"Без понятия.", 15,},
			},
		},
		[14] = {
			["Line"] = [[Бинго. Походите вокруг, осмотритесь. Может, найдёте ещё что-то интересное. Как насмотритесь - подходите, рассказывайте свои доводы. 
			
Только, небольшая просьба - поторопитесь. Не хотелось бы мешать детективам в завершении..]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/14.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
			},
		},
		[15] = {
			["Line"] = [[Это, как бы помягче сказать.. главная точка эпицентра. Походите вокруг, осмотритесь. Может, тогда у вас соберётся картина произошедшего. Как насмотритесь - подходите, рассказывайте свои доводы. 
			
Только, небольшая просьба - поторопитесь. Не хотелось бы мешать детективам в завершении..]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/15.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
			},
		},
		[16] = {
			["Line"] = [[И так, есть идеи?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/16.mp3",
			["Answers"] = {
				{"Кажется, кто-то пытался делать коктейли молотова. Там бутылки, плитка, химикаты. Всё сходится.", 18,},
				{"Возможно, некто поджигатель взломал квартиру своего врага с целью поджечь. На это наталкивает куча алкоголя. Взял что попало - не хотел палиться.", 18,},
				{"Всему виной ссора. Разбросанная мебель, физическая перепалка.. вот и решили замаскировать, ведь она закончилась печально. Страховое мошенничество.", 18,},
				{"Пока нет. Мне нужно ещё немного времени.", "close",},
				{"Без понятия. Кажется, это не моё.", 17,},
			},
		},
		[17] = {
			["Line"] = [[Жалко. В таком случае, до свидания. Спасибо за ваше время.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/17.mp3",
			["Answers"] = {
				{
					"До свидания.", {
						id = "MQS Skip to",
						data = {
							id = 14,
							quest_id = "season1_govern_1"
						}
					},
				},
			},
		},
		[18] = {
			["Line"] = [[Действительно, часть квартиры похожа на удел криминала. Однако, причина возгорания совсем другая. Простите, вы не подойдёте для нашей работы. Спасибо за ваше время.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/18.mp3",
			["Answers"] = {
				{
					"До свидания.", {
						id = "MQS Skip to",
						data = {
							id = 14,
							quest_id = "season1_govern_1"
						}
					},
				},
				{
					"Жалко.", {
						id = "MQS Skip to",
						data = {
							id = 14,
							quest_id = "season1_govern_1"
						}
					},
				},
				{
					"Ой..", {
						id = "MQS Skip to",
						data = {
							id = 14,
							quest_id = "season1_govern_1"
						}
					},
				},
			},
		},
		[19] = {
			["Line"] = [[И так, есть идеи?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/16.mp3",
			["Answers"] = {
				{"Кажется, есть. Над чёрным пятном что-то взорвалось - специально или нет - а фабрика горючих коктейлей уже закончила дело. Это может быть кто и что угодно.", 20,},
				{"Пока нет. Мне нужно ещё немного времени.", "close",},
			},
		},
		[20] = {
			["Line"] = [[Да, примерно такую картину мы и представляли. Вы молодец!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/20.mp3",
			["Answers"] = {
				{"Спасибо. Что дальше?", 21,},
				{"Что у нас дальше?", 21,},
			},
		},
		[21] = {
			["Line"] = [[Дальше у нас приём на работу. Вот, держите куртку.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/21.mp3",
			["Answers"] = {
				{"Куртка городского рабочего? Не сотрудника пожарного департамента?", 22,},
				{"Подождите. Я не хочу на вас работать. Меня интересовала только проверка своих навыков.", 17,},
			},
		},
		[22] = {
			["Line"] = [[У нас.. немного туго с финансами из-за последних событий на станции. Работа не официальная, мимо начальства. К сожалению особых почестей не будет, а показывать авторитет на сцене как-то надо. Думаю, ты понимаешь.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/22.mp3",
			["Answers"] = {
				{"Хотя бы так.", 23,},
				{"Это не отразится на моей зарплате?", 23,},
				{"Бесплатный сыр только в мышеловке. Нужно было догадаться..", 23,},
			},
		},
		[23] = {
			["Line"] = [[Насчёт счетов не бойся - за хорошую работу тебе причитается. А так, звони - мелочи для внимательных всегда найдутся. Там и до инспекторских задач недалеко.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/23.mp3",
			["Answers"] = {
				{"Хорошо. До свидания.", "MQS Continue quest",},
				{"Окей. До связи.", "MQS Continue quest",},
			},
		},
		[24] = {
			["Line"] = [[И так, есть идеи?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/16.mp3",
			["Answers"] = {
				{"Есть. Очень чёткая картина. Две банды, что-то не поделили, одна захотела избавиться от другой. Выждала момент, чтобы замаскировать налёт под халатность конкурентов.", 25,},
			},
		},
		[25] = {
			["Line"] = [[Очень.. интересная история. У тебя есть чем доказать фантазию?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/25.mp3",
			["Answers"] = {
				{"Ствол от пистолета, за столом. Может, там и вовсе весь пистолет; с угла не видно. Гильз не находили?", 26,},
			},
		},
		[26] = {
			["Line"] = [[Не находили. ..И мы это пропустили. Ты превосходишь все мои ожидания, отличная работа! Обязательно передам информацию полиции сразу после нашего разговора.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/26.mp3",
			["Answers"] = {
				{"Спасибо. Что дальше?", 21,},
				{"Что у нас дальше?", 21,},
			},
		},
	}
}

MCS.Spawns["season_inspector2"] = {
	name = "Марк Донован",
	desc = "Старший инспектор",
	model = "models/cityrp/pm/nypd/male_09.mdl",
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "pose_standing_02",
	uselimit = false,
	skin = 1,
	bgr = {},
	submat = {
		[4] = "models/gmodbest/suit/male/topf",
		[7] = "models/gmodbest/acc/rankems",
		[3] = "models/gmodbest/citizens/facemaps/erdim_facemap3"
	},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Есть что-нибудь?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_1.mp3",
			["Answers"] = {
				{"Пока нет.", "close",},
				{"Ищу.", "close",},
			},
		},
		[2] = {
			["Line"] = [[..Вот и вы. Добрый день.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_2.mp3",
			["Answers"] = {
				{"Добрый.", 10,},
				{"На добрый не особо похоже.", 9,},
				{"Вот это да..", 10,},
				{"Я так понимаю, вы позвали меня сюда не просто так?", 11,},
			},
		},
		[3] = {
			["Line"] = [[..Поджогов в Бруклине хватает. Все они имеют какие-то очевидные первопричины. Все, кроме этого и прошлого - куда я вас позвал. Думаю, вы понимаете..]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_3.mp3",
			["Answers"] = {
				{"...", 4,},
				{"Думаете, у них есть связь?", 7,},
				{"Значит, они связаны.", 8,},
			},
		},
		[4] = {
			["Line"] = [[Это не набор единичных актов. Я не верю в это. Я хочу дойти до сути.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_4.mp3",
			["Answers"] = {
				{"Я помогу.", 5,},
				{"За что стоит зацепиться?", 5,},
				{"С чего начнём?", 5,},
				{"Откуда такое рвение?", 6,},
			},
		},
		[5] = {
			["Line"] = [[Посмотрите на эту стену - на пересечение комнат.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_5.mp3",
			["Answers"] = {
				{"Сейчас..", "MQS Continue quest",},
			},
		},
		[6] = {
			["Line"] = [[Расскажу позже, как разберёмся. Пока что, посмотрите на эту стену - на пересечение комнат.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_6.mp3",
			["Answers"] = {
				{"Сейчас..", "MQS Continue quest",},
			},
		},
		[7] = {
			["Line"] = [[Именно. Здесь есть умысел, попытки что-то скрыть. Это не набор единичных актов. Я хочу подтвердить это.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_7.mp3",
			["Answers"] = {
				{"Я помогу.", 5,},
				{"За что стоит зацепиться?", 5,},
				{"С чего начнём?", 5,},
				{"Откуда такое рвение?", 6,},
			},
		},
		[8] = {
			["Line"] = [[Тоже заметили совпадения? Как будто кто-то ненамеренно оставляет нам сигнал.. Это не набор единичных актов. Я хочу удостовериться в этом.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_8.mp3",
			["Answers"] = {
				{"Я помогу.", 5,},
				{"За что стоит зацепиться?", 5,},
				{"С чего начнём?", 5,},
				{"Откуда такое рвение?", 6,},
			},
		},
		[9] = {
			["Line"] = [[Да, вы правы. День не может идти по-доброму даже при случайных несчастиях. А тут..]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_9.mp3",
			["Answers"] = {
				{"...", 10,},
				{"Тут?", 10,},
			},
		},
		[10] = {
			["Line"] = [[...]],
			["Sound"] = "",
			["Answers"] = {
				{"...", 3,},
				{"Марк?", 3,},
			},
		},
		[11] = {
			["Line"] = [[Да, вы всё поняли правильно.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_11.mp3",
			["Answers"] = {
				{"...", 10,},
			},
		},
		[12] = {
			["Line"] = [[Видите то же, что и я?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_12.mp3",
			["Answers"] = {
				{"Наверное.", 16,},
				{"Это заброшенная квартира.", 13,},
				{"Здесь промышляли нелегалом.", 13,},
				{"Я не знаю ваших мыслей.", 16,},
			},
		},
		[13] = {
			["Line"] = [[..Прямо как с прошлым делом. Тоже следы 'мануфактуры', тоже жильцы ни о чём не в курсе, тоже.. сгоревшие трупы. Полиция не проверяет помещения из-за отсутствия жалоб; счета платят исправно.. Нет дежурства, когда оно нужно.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_13.mp3",
			["Answers"] = {
				{"За каждым не уследишь.", 14,},
				{"Вы переходите в философию.", 15,},
			},
		},
		[14] = {
			["Line"] = [[Поэтому нам приходится разгребать последствия. Кхм, простите.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_14.mp3",
			["Answers"] = {
				{"Всё же кажется совпадением. Несчастные случаи на 'производстве'.", 17,},
				{"Вы правы. Кто-то умышленно устраивает для нас работу.", 22,},
				{"Что скажете по делу? Какая информация по трупам?", 18,},
			},
		},
		[15] = {
			["Line"] = [[Кхм, простите. Неприятно разгребать последствия. Лучше исправлять первопричины.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_15.mp3",
			["Answers"] = {
				{"Всё же кажется совпадением. Несчастные случаи на 'производстве'.", 17,},
				{"Вы правы. Кто-то умышленно устраивает для нас работу.", 22,},
				{"Что скажете по делу? Какая информация по трупам?", 18,},
			},
		},
		[16] = {
			["Line"] = [[Квартира давно заброшена. Здесь промышляли нелегалом перед нашим носом. Конкретнее - тоже следы 'мануфактуры', тоже жильцы ни о чём не в курсе, тоже.. сгоревшие трупы. Полиция не проверяет помещения из-за отсутствия жалоб, счета платят исправно..

Нет дежурства, когда оно нужно.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_16.mp3",
			["Answers"] = {
				{"За каждым не уследишь.", 14,},
				{"Вы переходите в философию.", 15,},
			},
		},
		[17] = {
			["Line"] = [[Ключевое слово 'кажется'. Знали бы вы про оборудование дальней части квартиры.. здесь промышляли профессионалы. Профи не загораются сами собой.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_17.mp3",
			["Answers"] = {
				{"Всё может быть.", 18,},
				{"А прошлое дело? То что со взрывом?", 18,},
			},
		},
		[18] = {
			["Line"] = [[Улица Виски. Три трупа. Один умер на месте от взрыва, двое других зарезали друг друга. Смерти наступили до горения. Холодное оружие нашли у обоих в руках, осколки от взрывчатки вытащили. Дело отложили в сторону. Когда сцена очевидно подстроена.

Гранд Вэй. Три трупа. Двух убило сразу, третий горелый с порезами в ванной. Больше никого нет. Остальные убежали? Забрали тела с собой? ..Вы же понимаете? Видите связь?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_18.mp3",
			["Answers"] = {
				{"Их убили.", 19,},
				{"Почему вы начали не с этого?", 20,},
				{"Не понимаю.", 21,},
			},
		},
		[19] = {
			["Line"] = [[Любому человеку это понятно. Однако, правосудие слепо. Нужны доказательства связи, нужны причастные. ..Простите, продолжайте осматривать помещение.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_19.mp3",
			["Answers"] = {
				{"Конечно.", "MQS Continue quest",},
				{"Не нравится мне это..", "MQS Continue quest",},
			},
		},
		[20] = {
			["Line"] = [[Простите. Не все такие же проницательные, как вы. Закон например требует доказательства связи, причастных.. Правосудие слепо. ..Продолжайте осматривать помещение.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_20.mp3",
			["Answers"] = {
				{"Конечно.", "MQS Continue quest",},
				{"Не нравится мне это..", "MQS Continue quest",},
			},
		},
		[21] = {
			["Line"] = [[Их убили. Те же люди или обратная месть - нам предстоит разобраться. Нужны доказательства связи, нужны причастные. ..Простите, продолжайте осматривать помещение.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_21.mp3",
			["Answers"] = {
				{"Конечно.", "MQS Continue quest",},
				{"Не нравится мне это..", "MQS Continue quest",},
			},
		},
		[22] = {
			["Line"] = [[Или очень неумело маскируется.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_22.mp3",
			["Answers"] = {
				{"Что вы имеете в виду?", 18,},
			},
		},
		[23] = {
			["Line"] = [[Есть что-нибудь?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_1.mp3",
			["Answers"] = {
				{"Есть. Разбитая бутылка, нижняя часть. Похожая на бутылку с Виски. ..Ну, улицы.", 24,},
			},
		},
		[24] = {
			["Line"] = [[Прям та же бутылка? Или имеете в виду Молотов?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_24.mp3",
			["Answers"] = {
				{"И то и то. Скорее всего.", 25,},
				{"Молотов.", 25,},
			},
		},
		[25] = {
			["Line"] = [[Нижней части маловато. Попробуйте найти верхнюю часть бутылки.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_25.mp3",
			["Answers"] = {
				{"Окей.", 26,},
				{"Хорошо.", 26,},
			},
		},
		[26] = {
			["Line"] = [[Вы молодец. Правда.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_26.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Спасибо.", "MQS Continue quest",},
				{"Сюда бы несколько таких как мы..", "MQS Continue quest",},
			},
		},
		[27] = {
			["Line"] = [[Есть что-нибудь?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_1.mp3",
			["Answers"] = {
				{"Верхняя часть разбитой бутылки, за одним из столов. Горло заклеено. Всё выжжено.", 28,},
			},
		},
		[28] = {
			["Line"] = [[Всё-таки не провал на производстве. В смысле провал, но не- ..Кхм, вы поняли.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_28.mp3",
			["Answers"] = {
				{"Очень чётко.", 29,},
				{"Молотов кинули в самый разгар работы. Простите за каламбур.", 29,},
			},
		},
		[29] = {
			["Line"] = [[..Боюсь, детективам этого мало, чтобы связать оба дела вместе. Должно быть что-то ещё, прямо на поверхности!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_29.mp3",
			["Answers"] = {
				{"Что насчёт сейфа?", 30,},
				{"Например?", 32,},
			},
		},
		[30] = {
			["Line"] = [[Бинго! Сейф! Эта модель закрывается настоящим ключом - не комбинацией. Полицейские вроде находили какие-то ключи.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_30.mp3",
			["Answers"] = {
				{"Попробую поискать.", "MQS Continue quest",},
				{"Спрошу у них.", 31,},
			},
		},
		[31] = {
			["Line"] = [[Эти двое офицеров занимались другой задачей. Спрашивать не у кого.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_31.mp3",
			["Answers"] = {
				{"Тогда поищу самостоятельно.", "MQS Continue quest",},
			},
		},
		[32] = {
			["Line"] = [[Например.. точно, сейф! Эта модель закрывается настоящим ключом - не комбинацией. Полицейские вроде находили какие-то ключи.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_32.mp3",
			["Answers"] = {
				{"Попробую поискать.", "MQS Continue quest",},
				{"Спрошу у них.", 31,},
			},
		},
		[33] = {
			["Line"] = [[Что-нибудь нашли?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_33.mp3",
			["Answers"] = {
				{"Пистолет без ствола.", 34,},
				{"Вы не поверите..", 35,},
			},
		},
		[34] = {
			["Line"] = [[Ствол в первой квартире, остальная часть пистолета в другой.. Связь есть. Чёткая связь.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_34.mp3",
			["Answers"] = {
				{"Дело закрыто?", 36,},
				{"Вы не звучите радостно.", 37,},
			},
		},
		[35] = {
			["Line"] = [[..Это риторический вопрос. В ничто иное я и поверить не могу. Ствол в первой квартире, остальная часть пистолета в другой.. Связь есть. Чёткая связь.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_35.mp3",
			["Answers"] = {
				{"Дело закрыто?", 36,},
				{"Вы не звучите радостно.", 37,},
			},
		},
		[36] = {
			["Line"] = [[Наоборот. Полиция не сможет закрыть дело после такой находки. К тому же, вы спасли и нас. Думаю, вы понимаете..]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_36.mp3",
			["Answers"] = {
				{"Не совсем.", 37,},
				{"Финансирование?", 37,},
				{"Вопрос увольнения?", 37,},
			},
		},
		[37] = {
			["Line"] = [[Можно с вами по душам?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_37.mp3",
			["Answers"] = {
				{"Да.", 38,},
				{"Наверное.", 39,},
				{"Нет.", 40,},
			},
		},
		[38] = {
			["Line"] = [[Мне.. горько делать свою работу. Что бы ни случилось - крайними остаются инспектора. То не предотвратили, это не остановили.. Да и когда разберёмся - особого спасибо от начальства не жди. Я понимаю, почему так. И от понимания мерзко.

На пожарных давит полиция. А на полицию не давит никто. Они банально хотят купаться в хвальбе - в чужих заслугах. Вот скажите, вы когда-нибудь слышали хотя бы комплимент пожарным за раскрытие преступлений с огнём? А за прямое спасение? ..Учитывая как много не знают правил игры со спичками, ответ очевиден.

Нас принимают за должное. Нам не выделяют нужные средства для работы. В глаза бросаются идиоты, а не каждодневные герои.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_38.mp3",
			["Answers"] = {
				{"Это.. сильно.", 40,},
				{"Прекрасно вас понимаю.", 40,},
				{"Идиотов тоже хватает, более чем. Особенно на ближайшей станции.", 41,},
				{"Нет слишком высокой цены. Необходимая жертва. Полиция тоже много чего отдаёт во время службы.", 41,},
			},
		},
		[39] = {
			["Line"] = [[Тогда.. попробую объяснить профессиональным языком: на инспекторов давит начальство, на начальство давит полиция, а на полицию не давит никто. Детективы из другого департамента получают полную награду за наши заслуги.

Ведь это полиция следит за порядком, а не мы. В том и дело - следит, а не поддерживает. Это мы ходим по заведениям с проверками, мы агитируем не играться со спичками. Что делают другие? Жалуются. Бесконечно жалуются.

Нас принимают за должное. Нам не выделяют нужные средства для работы. В глаза бросаются идиоты, а не каждодневные герои.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_39.mp3",
			["Answers"] = {
				{"Это.. сильно.", 40,},
				{"Прекрасно вас понимаю.", 40,},
				{"Идиотов тоже хватает, более чем. Особенно на ближайшей станции.", 41,},
				{"Нет слишком высокой цены. Необходимая жертва. Полиция тоже много чего отдаёт во время службы.", 41,},
			},
		},
		[40] = {
			["Line"] = [[..Спасибо за вашу помощь. Продолжайте работать как работали. Уверен, это не конец.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_40.mp3",
			["Answers"] = {
				{"Удачи вам.", "MQS Continue quest",},
				{"До связи.", "MQS Continue quest",},
				{"Надеюсь, эта цепочка преступлений закончится быстро.", "MQS Continue quest",},
			},
		},
		[41] = {
			["Line"] = [[Вы правы. Частично. Затор в одной трубе - парализация всей канализации. Надеюсь, вы понимаете. ..Спасибо за вашу помощь. Продолжайте работать как работали. Уверен, это не конец.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_41.mp3",
			["Answers"] = {
				{"Удачи вам.", "MQS Continue quest",},
				{"До связи.", "MQS Continue quest",},
				{"Надеюсь, эта цепочка преступлений закончится быстро.", "MQS Continue quest",},
			},
		},
		[42] = {
			["Line"] = [[Вот и ты. Посмотри на это безобразие.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_42.mp3",
			["Answers"] = {
				{"И так видно.", 43,},
				{"Очередной поджог?", 44,},
				{"Продолжение?", 44,},
			},
		},
		[43] = {
			["Line"] = [[Нет. Посмотри на тела. Посмотри на эту.. халтуру.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_43.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Сейчас..", "MQS Continue quest",},
			},
		},
		[44] = {
			["Line"] = [[Не то слово. Завершение. Только посмотри на эту.. халтуру.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_44.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Сейчас..", "MQS Continue quest",},
			},
		},
		[45] = {
			["Line"] = [[Доказательства неопровержимые. Все три поджога друг с другом связаны. Одни устроили рейд, вторые отомстили, а первые ответили вторым на месть. Как дети..]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_45.mp3",
			["Answers"] = {
				{"Не то слово.", 46,},
				{"Обычное дело.", 47,},
			},
		},
		[46] = {
			["Line"] = [[Действительно, не то. С каждым делом всё меньше попыток скрывать авантюры от полиции. Столько бесполезных смертей.. Так ведь их количество не уменьшится. Поймают одних - появятся другие. Ещё тупее и наглее.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_46.mp3",
			["Answers"] = {
				{"Теперь дело ушло полиции?", 48,},
				{"Что дальше?", 50,},
				{"Их точно поймают.", 49,},
			},
		},
		[47] = {
			["Line"] = [[С каждым таким 'обычным' делом всё меньше попыток скрыться от полиции. Только бандитизма совсем не уменьшается. Поймают одних - появятся другие. Ещё тупее и наглее.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_47.mp3",
			["Answers"] = {
				{"Теперь дело ушло полиции?", 48,},
				{"Что дальше?", 50,},
				{"Их точно поймают.", 49,},
			},
		},
		[48] = {
			["Line"] = [[С концами. Мы сделали больше, чем только нашу работу. И что мы получим в ответ? Ничего.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_48.mp3",
			["Answers"] = {
				{"...", 51,},
			},
		},
		[49] = {
			["Line"] = [[Ты будто бы не слушаешь. Какой толк? Что изменится?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_49.mp3",
			["Answers"] = {
				{"...", 51,},
			},
		},
		[50] = {
			["Line"] = [[Ничего хорошего.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_50.mp3",
			["Answers"] = {
				{"...", 51,},
			},
		},
		[51] = {
			["Line"] = [[Бюджета нам за такой героизм точно не выделят. Но и забирать оставшееся не посмеют. Спасибо тебе.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_51.mp3",
			["Answers"] = {
				{"Приятно иметь с вами дело.", 52,},
				{"Я так понимаю, меня не возьмут на постоянку?", 53,},
				{"Это конец?", 53,},
			},
		},
		[52] = {
			["Line"] = [[Взаимно. ..Слушай, у меня есть предложение.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_52.mp3",
			["Answers"] = {
				{"Какое?", 54,},
			},
		},
		[53] = {
			["Line"] = [[Нет. Наоборот. ..Слушай, у меня есть предложение.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_53.mp3",
			["Answers"] = {
				{"Какое?", 54,},
			},
		},
		[54] = {
			["Line"] = [[Мы можем продолжить работать вместе. Немного по-другому, правда. Я со своими коллегами более официальными поручениями - по специальности. А ты - как 'тайный покупатель' от нашей станции. Понимаешь, к чему я веду?

Городские рабочие светятся везде. Они кажутся безобидными. Их куртки никто не отбирает, под ними ничего не проверяют. И тут появляешься ты, без предупреждения осматриваешь помещение.. И нам меньше бумажной мороки, и всем больше прока от нежданного подхода.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_54.mp3",
			["Answers"] = {
				{"Мне нравится.", 55,},
				{"Надо подумать.", 56,},
				{"Не очень интересно.", 56,},
			},
		},
		[55] = {
			["Line"] = [[Тогда, до встречи. Позвони как захочешь устроить обход.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_55.mp3",
			["Answers"] = {
				{"Окей.", "MQS Continue quest",},
				{"Хорошо.", "MQS Continue quest",},
				{"До свидания.", "MQS Continue quest",},
			},
		},
		[56] = {
			["Line"] = [[Подумай над предложением. Позвони если захочешь устроить обход. Мы никогда не откажемся от сторонней помощи.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_inspector/2_56.mp3",
			["Answers"] = {
				{"Окей.", "MQS Continue quest",},
				{"Хорошо.", "MQS Continue quest",},
				{"До свидания.", "MQS Continue quest",},
			},
		},
	}
}