-- "addons\\mc_simple_npcs\\lua\\mcs_npcs\\npcs\\work.lua"
-- Retrieved by https://github.com/lewisclark/glua-steal
MCS.Spawns["jobs_civ"] = {
	name = "Волтер Мэй",
	desc = "Отдел Кадров",
	checkpos = true,
	model = "models/cityrp/pm/suit/male_05.mdl",
	namepos = 77,
	boneid = 6,
	hint = 1,
	theme = "Default",
	scare_anim = {"seq_cower", "menu_gman"},
	scare_timer = 15,
	scale = 1,
	questNPC = false,
	pos = {
		["rp_southside_noire"] = {Vector(-1444.03125, 5041.6577148438, -104.96875), Angle(0, 0, 0)},
		["rp_southside"] = {Vector(-1444.03125, 5041.6577148438, -104.96875), Angle(0, 0, 0)},
	},
	sequence = "menu_gman",
	uselimit = false,
	skin = 1,
	submat = {
		[5] = "models/gmodbest/suit/male/suit_sheet1",
		[7] = "models/gmodbest/suit/male/suit_sheet1"
	},
	ClModels = {
		{
			model = "models/props_lab/clipboard.mdl",
			pos = Vector(-0.1, 0, 1.1),
			ang = Angle(90, 0, 90),
			bone = 11
		},
	},
-- VOICE - JOSH T
	dialogs = {
		[1] = {
			["Line"] = [[Здравствуйте, добро пожаловать в местное отделение World Corp! Могу я вам чем-нибудь помочь?]],
			["Sound"] = "https://macnco.one/cityrp/npcsound/jobs_civ/1.mp3",
			["Answers"] = {
				{
					"Хочу посмотреть список доступных вакансий.", "close", function()
						DarkRP.OpenJobMenu()
					end,
					function() return LocalPlayer():getDarkRPVar("character") == 1 end
				},
				{"Что находится в этом здании?", 6,},
				{"Пока нет, спасибо.", "close",},
			},
		},
		[3] = {
			["Line"] = [[При всём уважении, я не имею права отклоняться от сертифицированного списка слов. В ваших интересах будет выучить одобренные нами методические рекомендации по разговору с представителями корпоративной, городской, и/или мировой деятельности.]],
			["Sound"] = "https://macnco.one/cityrp/npcsound/jobs_civ/3.mp3",
			["Answers"] = {
				{
					"..Хорошо. Так что там по этим самым контрактам?", "close", function()
						DarkRP.OpenJobMenu()
					end,
					function() return LocalPlayer():getDarkRPVar("character") == 1 end
				},
				{"Я ничего не понимаю. Наверное, мне надо не сюда.", 4,},
				{"Да пошли вы знаете куда?", 4,},
			},
		},
		[4] = {
			["Line"] = [[Нам жаль, что World Corp не смогла оправдать ваших ожиданий. Спасибо за уделение вашего внимания нашему работовластному коллективу!]],
			["Sound"] = "https://macnco.one/cityrp/npcsound/jobs_civ/4.mp3",
			["Answers"] = {
				{"Удачи.", "close",},
				{"Да-да..", "close",},
				{"Да заткнись ты уже!", "close",},
			},
		},
		[5] = {
			["Line"] = "Наш коллектив вынужден сообщить вам с глубочайшим сожалением, что контракты под категорией особой важности, в данный момент, недоступны. Наши премиальные привелегированные и предпочтительные контракторы только планируют расширяться в направлении района Бруклин города Нью-Йорк.\n\nМы сообщим вам, как только будет доступна такая возможность. У нас есть ваши контакты, и наши алгоритмы подскажут нам, когда настанет наилучший момент связаться с вами.",
			["Sound"] = "https://macnco.one/cityrp/npcsound/jobs_civ/5.mp3",
			["Answers"] = {
				{"Как скажете. Тогда я хочу посмотреть список обычных контрактов.", "close",},
				{"Как скажете. В таком случае, мне пора.", 4,},
			},
		},
		[6] = {
			["Line"] = "Данный бизнес-центр полностью принадлежит World Corp, и мы с радостью расскажем вам о важности данной корпорации и её символической роли в этом районе! Как и весь мир - в том числе этот город - мы занимаемся развитием, прогрессивностью и процветанием.\n\nМы следим за тем, чтобы вы процветали в правильном направлении и не выбирали нежелательные пути жизненного опыта. Как мы это делаем? Мы развиваем инфраструктуры сотни городов мира и предоставляем возможность заключать контракты с государством на получение временного дохода.\n\nЗвучит прекрасно, не так ли? Преступность падает, вакансии растут, гражданское счастье выше прогнозирующих графиков! Мы даём возможность каждому почувствовать себя важным и особенным. Оглянитесь - кто правит этим городом? Водители, кондитеры, огородники и честные работники!\n\nА вы уже решили, куда направите свои силы? World Corp - с нами, о вас будут помнить целый месяц, пока текущая мода не сменит себя иной прогрессией!",
			["Sound"] = "https://macnco.one/cityrp/npcsound/jobs_civ/6.mp3",
			["Answers"] = {
				{
					"..Хорошо. Так что там по этим самым контрактам?", "close", function()
						DarkRP.OpenJobMenu()
					end,
					function() return LocalPlayer():getDarkRPVar("character") == 1 end
				},
				{"Ты сам-то в это веришь?", 7,},
				{"Работа это хорошо, а как же образование?", 8,},
				{"Звучит как-то сомнительно. Пойду-ка я.", 4,},
			},
		},
		[7] = {
			["Line"] = [[Конечно! Каждый сотрудник World Corp, а также их контрактники, обязаны по договорным обязательствам верить в прогресс и в свою работовластную компанию. Наш коллектив настолько дружный, что количество потенциальных алгоритмированных самоубийц снижается на два каждый день!\n\nСекрет прост: наши менеджеры выписывают зарплаты вовремя за отказ от суицида.]],
			["Sound"] = "https://macnco.one/cityrp/npcsound/jobs_civ/7.mp3",
			["Answers"] = {
				{
					"..Хорошо. Так что там по этим самым контрактам?", "close", function()
						DarkRP.OpenJobMenu()
					end,
					function() return LocalPlayer():getDarkRPVar("character") == 1 end
				},
				{"Так это потому что они умирают из-за рабских условий труда!", 3,},
				{"По вам видно.", 4,},
				{"..Не, слушайте, я лучше пойду.", 4,},
			},
		},
		[8] = {
			["Line"] = "Мы с радостью обучим вас базовым принципам работ, на которые мы составляем контракты с государством. Для этого вам даже не нужно учиться в школе! В случае с высокопоставленными должностями, мы готовы предоставить вам университетский кредит на два поколения.\n\nДаже если с вами случится что-то нехорошее вне сертифицированного перечня возможных несчастий, ваша семья сможет погасить вашу задолженность. А наша семейная реферальная программа позволит уменьшить затраты по задолженностям, при сдаче вашего ребёнка в один из наших африканских центров опеки - по 10% за чадо. Удобно!",
			["Sound"] = "https://macnco.one/cityrp/npcsound/jobs_civ/8.mp3",
			["Answers"] = {
				{
					"..Хорошо. Так что там по этим самым контрактам?", "close", function()
						DarkRP.OpenJobMenu()
					end,
					function() return LocalPlayer():getDarkRPVar("character") == 1 end
				},
				{"Я имею в виду не обучение как работать, а учёбу как явление. Это же грабёж получается!", 3,},
				{"..Как-то сомнительно. Я лучше пойду.", 4,},
			},
		},
	}
}

if game.GetMap() == "rp_southside" then
	MCS.Spawns["jobs_civ"].name = "Уильям Степ"
	MCS.Spawns["jobs_civ"].model = "models/cityrp/pm/suit/male_07.mdl"
end

MCS.Spawns["clark"] = {
	name = "Доска дежурного",
	model = "models/props_interiors/clipboardholder01.mdl",
	namepos = 72,
	theme = "Retro",
	scale = 1,
	noinfo = true,
	noshadow = true,
	questNPC = false,
	pos = {
		["rp_southside_noire"] = {Vector(9129.34375,2144.15625,-44.75), Angle(0,-90,0)},
		["rp_southside"] = {Vector(9116.15625, 1450.3125, -41.6875), Angle(0, 180, 0)},
	},
	submat = {
		[5] = "models/gmodbest/suit/female/topf",
		[7] = "models/gmodbest/acc/rankems"
	},
	sequence = "idlepackage",
	uselimit = true,
	skin = 1,
	bgr = {
		[1] = 0,
		[2] = 2,
		[3] = 4,
	},
	ClModels = {
		{
			model = "models/props_lab/clipboard.mdl",
			pos = Vector(-6, 3, 0),
			ang = Angle(180, 5, 0),
			bone = 16
		},
	},
	teams = {
		[3] = 2,
		[13] = 2,
		[14] = 2,
		[18] = 2,
	},
	dialogs = {
		[1] = {
			["Line"] = [[Тут висит множество планшетов.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Тут висит множество планшетов.]],
			["Sound"] = "",
			["Answers"] = {
				{
					"Встать на смену", "close", function()
						DarkRP.OpenJobMenuEMS()
					end,
					function() return LocalPlayer():Team() == 3 end
				},
				{
					"Закончить смену", "close", function()
						RunConsoleCommand("rp_job", 3)
					end,
					function() return LocalPlayer():isEMS() end
				},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Тут висит множество планшетов.]],
			["Sound"] = "",
			["Answers"] = {
				{"Взять свободный планшет", "MQS Continue quest",},
				{"Отойти", "close",},
			},
		},
		[4] = {
			["Line"] = [[Тут висит множество планшетов.]],
			["Sound"] = "",
			["Answers"] = {
				{"Положить планшет с отчётом", "MQS Continue quest",},
				{"Отойти", "close",},
			},
		},
	}
}

MCS.Spawns["fdny"] = {
	name = "Руководство FDNY",
	model = "models/props_lab/binderredlabel.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	noinfo = true,
	pos = {
		["rp_southside_noire"] = { Vector(9590.375,1730.15625,231), Angle(-1.3623046875,-10.167846679688,89.785766601563)},
		["rp_southside"] = { Vector(950.9375,4236.96875,-9151.46875 ), Angle(-1.29638671875,44.928588867188,90.37353515625 )},
	},
	sequence = "idle",
	uselimit = false,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Книга "Руководство FDNY"]],
			["Sound"] = "",
			["Answers"] = {
				{"Открыть книгу", "close", function()
					MSD.LoadBook("fdny")
				end},
			},
		},
	}
}

MCS.Spawns["elevator1"] = {
	name = "Лифтовой механизм",
	model = "models/hunter/blocks/cube075x075x075.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	pos = {},
	questNPC = false,
	sequence = "",
	uselimit = false,
	noinfo = true,
	skin = 1,
	bgr = {},
	ClModels = {},
	submat = {
		[0] = "null"
	},
	dialogs = {
		[1] = {
			["Line"] = [[Это механизм подъёма лифта. Им должен заниматься квалифицированный рабочий.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Причина резкой остановки лифта бросается в глаза подобно падающему солнцу: на компьютерной плате перегорело всё, что могло сгореть.

Учитывая локацию самого здания, первоисточник исправить никогда не удастся.]],
			["Sound"] = "",
			["Answers"] = {
				{"Заменить перегоревшие детали на плате", 4,},
				{"Заменить саму плату", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Как хорошо, что при работе на кого-то не нужно лично платить за чудеса импорта. Новая плата от MICRONIQ сразу же встала на своё место. Пару щелчков, и готово.]],
			["Sound"] = "",
			["Answers"] = {
				{"Опечатать механизм и отойти", "MQS Continue quest",},
			},
		},
		[4] = {
			["Line"] = [[Детали может и подошли, однако кто заменит сам текстолит? Шанс повторной поломки не так уж и мал.]],
			["Sound"] = "",
			["Answers"] = {
				{"Оставить как есть и запустить механизм.", "Damage player",},
				{"Заменить саму плату", 3,},
			},
		},
		[5] = {
			["Line"] = [[На первый взгляд, ничего не выбивается из общего вида. Скорее всего из-за общей старинности электронных внутренностей.]],
			["Sound"] = "",
			["Answers"] = {
				{"Нажать кнопку включения", 7,},
				{"Осмотреть механизм получше", 9,},
				{"Отойти", "close",},
			},
		},
		[6] = {
			["Line"] = [[Ничего не произошло. Даже искры не появилось.]],
			["Sound"] = "",
			["Answers"] = {
				{"Нажать кнопку включения ещё раз", 7,},
				{"Осмотреть механизм получше", 9,},
				{"Отойти", "close",},
			},
		},
		[7] = {
			["Line"] = [[Ничего не произошло. Даже искры не появилось.]],
			["Sound"] = "",
			["Answers"] = {
				{"Нажать кнопку включения ещё раз", 7,},
				{"Пнуть корпус механизма", 8,},
				{"Осмотреть механизм получше", 9,},
				{"Отойти", "close",},
			},
		},
		[8] = {
			["Line"] = [[После тряски аппарат заискрился и заработал. Как оказалось, у него всего-лишь отошли контакты.]],
			["Sound"] = "",
			["Answers"] = {
				{"Опечатать механизм и отойти", "MQS Continue quest",},
			},
		},
		[9] = {
			["Line"] = [[Последний ремонтник явно поскупился использовать заготовленную плату от MICRONIQ: вместо нормальной электроники, весь аппарат буквально состоит из скрученных кусков меди. Часть концов и вовсе не контактирует друг с другом.

Намёк на компьютерную инженерию стоит отдельного упоминания. Недоразумение даже не припаяли к остальным компонентам.]],
			["Sound"] = "",
			["Answers"] = {
				{"Припаять провода к пустым выступам на плате", 11,},
				{"Перекрутить все 'провода' друг с другом", "Damage player",},
				{"Прислонить 'провода' к пустым выступам на плате", 10,},
			},
		},
		[10] = {
			["Line"] = [[При прислонении аппарат мигом включался. Как только контакт разрывался - всё гасло. Как примитивная азиатская лампочка.]],
			["Sound"] = "",
			["Answers"] = {
				{"Припаять провода к пустым выступам на плате", 12,},
				{"Перекрутить все 'провода' друг с другом", "Damage player",},
			},
		},
		[11] = {
			["Line"] = [[Только вот, какие и куда? Медные окончания выглядят крайне опасно, чтобы сразу браться за паяльник.]],
			["Sound"] = "",
			["Answers"] = {
				{"Проверять 'провода', поднося их по одному к контактам", 12,},
				{"Перекрутить все 'провода' друг с другом", "Damage player",},
			},
		},
		[12] = {
			["Line"] = [[Нужные куски меди отобрались методом исключения. Несколько минут пайки, и аппарат готов к работе.]],
			["Sound"] = "",
			["Answers"] = {
				{"Опечатать механизм и отойти", "MQS Continue quest",},
			},
		},
		[13] = {
			["Line"] = [[На корпусе горели все красные лампочки выделяющейся формы. Что бы то ни было - снаружи проблема выглядит серьёзной.]],
			["Sound"] = "",
			["Answers"] = {
				{"Заглянуть внутрь корпуса", 14,},
				{"Найти обозначения в документации", 16,},
				{"Отойти", "close",},
			},
		},
		[14] = {
			["Line"] = [[Лампочки тянулись проводами к системам защиты от перепадов. Как оказалось, данный лифт использует аж четыре таких механизма. Кем бы ни был проектировщик всей конструкции - он будто знал, какая в Бруклине проблема с электричеством.

А вот человеческий фактор тот гений явно недооценил..]],
			["Sound"] = "",
			["Answers"] = {
				{"Сбросить все системы защиты", 15,},
			},
		},
		[15] = {
			["Line"] = [[Всё мигом заработало. Сколько ещё в мире вызовов решатся банальным нажиманием одной кнопки..?]],
			["Sound"] = "",
			["Answers"] = {
				{"Опечатать механизм и отойти", "MQS Continue quest",},
			},
		},
		[16] = {
			["Line"] = [[Большое руководство еле раскрылось из-за своей толщины, текст почти не читался из-за мелкости букв, а сама проблема.. не расписана. Указан лишь источник проблемы - перепад напряжения. Однако, в самом здании точно всё хорошо.]],
			["Sound"] = "",
			["Answers"] = {
				{"Заглянуть внутрь корпуса", 14,},
				{"Переподключить аппарат", 17,},
				{"Постучать по лампочке", 17,},
				{"Включить весь механизм, невзирая на проблему", 17,},
			},
		},
		[17] = {
			["Line"] = [[Ничего не произошло. Совсем.]],
			["Sound"] = "",
			["Answers"] = {
				{"Заглянуть внутрь корпуса", 14,},
				{"Переподключить аппарат", 17,},
				{"Постучать по лампочке", 17,},
				{"Включить весь механизм, невзирая на проблему", 17,},
			},
		},
		[18] = {
			["Line"] = [[Снаружи никаких проблем точно нет. А вот внутри что-то точно не так. Фазу выбивает каждый раз, как подаётся питание.]],
			["Sound"] = "",
			["Answers"] = {
				{"Подать питание", "Damage player",},
				{"Осмотреть корпус снаружи", 18,},
				{"Продиагностировать механизм изнутри", 19,},
				{"Отойти", "close",},
			},
		},
		[19] = {
			["Line"] = [[Перегорел один небольшой элемент большой современной платы. Заменить его не составит труда.]],
			["Sound"] = "",
			["Answers"] = {
				{"Заменить всю плату на новую", 3,},
				{"Заменить нерабочий компонент платы", 20,},
			},
		},
		[20] = {
			["Line"] = [[Готово. Всё работает.]],
			["Sound"] = "",
			["Answers"] = {
				{"Опечатать механизм и отойти", "MQS Continue quest",},
			},
		},
		[21] = {
			["Line"] = [[Ещё до подхода к аппарату, в холле, одна из дверей лифта оставалась открытой. Диагностирующая электроника как бы намекает на ложность ситуации - лифт считает, что он 'закрыт'. Да и глаза не обманывают - часть дверного механизма стоит на места, а другая сидит в другой части корпуса.]],
			["Sound"] = "",
			["Answers"] = {
				{"Вызвать подмогу для спуска в шахту лифта", 23,},
				{"Со всей силы потянуть на себя отпавший элемент", 22,},
				{"Отойти", "close",},
			},
		},
		[22] = {
			["Line"] = [[Удивительным образом, это сработало. Дверь закрылась, а элемент сам собой закрепился.]],
			["Sound"] = "",
			["Answers"] = {
				{"Опечатать механизм и отойти", "MQS Continue quest",},
			},
		},
		[23] = {
			["Line"] = [[Бюджет позволил нанять только вас. Придётся или спускаться, или делать что-то на месте. А так как оборудования для работы в техническом помещении нигде не наблюдается.. выбор мягко говоря не велик.]],
			["Sound"] = "",
			["Answers"] = {
				{"Со всей силы потянуть на себя отпавший элемент", 22,},
				{"Попытаться раскрыть вторую дверь", 24,},
				{"Заставить компьютер посчитать лифт 'открытым'", 25,},
			},
		},
		[24] = {
			["Line"] = [[Человеческих сил для таких манёвров точно не хватит. Места слишком мало даже чтобы опереться на сам корпус.]],
			["Sound"] = "",
			["Answers"] = {
				{"Со всей силы потянуть на себя отпавший элемент", 22,},
				{"Заставить компьютер посчитать лифт 'открытым'", 25,},
			},
		},
		[25] = {
			["Line"] = [[Компьютер послушно выполнил команду. Дверь продолжает висеть в открытом состоянии без возможности вернуться назад.]],
			["Sound"] = "",
			["Answers"] = {
				{"Со всей силы потянуть на себя отпавший элемент", 22,},
				{"Попытаться раскрыть вторую дверь", 24,},
			},
		},
		[26] = {
			["Line"] = [[Кто-то зверски избил подъёмный механизм ломом. Видимо, офисному рабочему надоели условия работы в World Corp, и тот решил отыграться на корпусе.]],
			["Sound"] = "",
			["Answers"] = {
				{"Заменить весь корпус", 27,},
				{"Продиагностировать внутреннюю часть механизма", 28,},
				{"Запустить подъёмный механизм", 15,},
				{"Отойти", "close",},
			},
		},
		[27] = {
			["Line"] = [[Мгновенно пришедший отказ 'сверху' заставляет решить проблему иначе. Похоже, причина остановки лифта кроется в том же..]],
			["Sound"] = "",
			["Answers"] = {
				{"Продиагностировать внутреннюю часть механизма", 28,},
				{"Запустить подъёмный механизм", 15,},
			},
		},
		[28] = {
			["Line"] = [[Внутри не пострадало абсолютно ничего. Похоже, лифт выключили из-за боязни дальнейших технических потерь.]],
			["Sound"] = "",
			["Answers"] = {
				{"Запустить подъёмный механизм", 15,},
			},
		},
	}
}

MCS.Spawns["misc_generator"] = {
	name = "Генератор",
	model = "models/hunter/blocks/cube05x1x05.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "",
	uselimit = false,
	skin = 1,
	noinfo = true,
	bgr = {},
	submat = {
		[0] = "null"
	},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Подземный генератор очень плохо себя чувствует. Кажется, с ним 'поигрались' бездомные.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Подземный генератор очень плохо себя чувствует. Кажется, с ним 'поигрались' бездомные. По крайней мере, один из них лежит перед генератором, с вырванными проводами в зубах.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор", 3,},
				{"Обесточить генератор", 10,},
				{"Заменить компоненты", 14,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Генератор агрессивно заискрился и выключился с концами. Кажется, теперь сгорела остальная часть 'начинки'.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор ещё раз", 4,},
				{"Обесточить генератор", 10,},
				{"Заменить компоненты", 14,},
			},
		},
		[4] = {
			["Line"] = [[Ничего не происходит.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор ещё раз", 5,},
				{"Обесточить генератор", 10,},
				{"Заменить компоненты", 14,},
			},
		},
		[5] = {
			["Line"] = [[Ничего не происходит.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор ещё раз", 6,},
				{"Обесточить генератор", 10,},
				{"Заменить компоненты", 14,},
			},
		},
		[6] = {
			["Line"] = [[Ничего не происходит.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор ещё раз", 7,},
				{"Обесточить генератор", 10,},
				{"Заменить компоненты", 14,},
			},
		},
		[7] = {
			["Line"] = [[Ничего не происходит.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор ещё раз", 8,},
				{"Обесточить генератор", 10,},
				{"Заменить компоненты", 14,},
			},
		},
		[8] = {
			["Line"] = [[Генератор страшно закряхтел. Возможно, следующая попытка включения окончится взрывом.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор ещё раз", 9,},
				{"Обесточить генератор", 10,},
				{"Заменить компоненты", 14,},
			},
		},
		[9] = {
			["Line"] = [[Каким-то электродным чудом, генератор запустился. Вероятно, само питание 'ушло в защиту', и не выдержала как раз проводка канализации. 

Это уже чужая забота - генератор завёлся. Задание выполнено.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "MQS Continue quest",},
			},
		},
		[10] = {
			["Line"] = [[Все лампочки погасли. Все шипящие проводки и конденсаторы - тоже.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор", 11,},
				{"Заменить компоненты", 12,},
			},
		},
		[11] = {
			["Line"] = [[На одной силе воли машина не запустится.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор ещё раз", 11,},
				{"Заменить компоненты", 12,},
			},
		},
		[12] = {
			["Line"] = [[Менять много не пришлось: бедолага умер до нанесения существенного ущерба. По крайней мере технике.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор", 13,},
			},
		},
		[13] = {
			["Line"] = [[Генератор запустился без особых проблем. Задание выполнено.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "MQS Continue quest",},
			},
		},
		[14] = {
			["Line"] = [[Оголённые провода набросились подобно гидре из древнегреческих мифов. Ожоги от них будут ещё долго напоминать о бесполезности перчаток. И о такой глупой ошибке.]],
			["Sound"] = "",
			["CallBack"] = {
				name = "Damage player"
			},
			["Answers"] = {
				{"Попробовать включить генератор", 4,},
				{"Обесточить генератор", 10,},
				{"Попробовать заменить компоненты ещё раз", 14,},
			},
		},
		[15] = {
			["Line"] = [[Подземный генератор очень плохо себя чувствует. Кажется, с ним 'поигрались' бездомные. Или они приняли его за туалет - с конструкции стекает жидкость, лужа тянется до человека напротив, и в комнате стоит глазораздирающий запах.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор", 3,},
				{"Обесточить генератор", 10,},
				{"Заменить проводку", 14,},
				{"Отойти", "close",},
			},
		},
		[16] = {
			["Line"] = [[Подземный генератор очень плохо себя чувствует. Кажется, с ним 'поигрались' бездомные. Кто-то посчитал 'замечательной' идею использовать агрегат как пиньяту - вся установка ужасно деформирована. Даже ужасней, чем лицо нападавшего.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать включить генератор", 9,},
				{"Обесточить генератор", 10,},
				{"Заменить компоненты", 14,},
				{"Отойти", "close",},
			},
		},
	}
}

MCS.Spawns["warehouse_loader"] = {
	name = "Манифест",
	model = "models/props_c17/oildrum001.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	pos = {
		["rp_southside_noire"] = {Vector(-281.60079956055,-1744.1365966797,4672.9331054688), Angle(0, -3.2650666236877, 0)},
		["rp_southside"] = {Vector(-5036.0581054688, -2379.6696777344, -9183.96875), Angle(0, -3.2650666236877, 0)},
	},
	sequence = "",
	uselimit = false,
	skin = 0,
	bgr = {},
	dialogs = {
		[1] = {
			["Line"] = [[Коробки расположены на поддоне согласно инструкциям на самих коробках. Всё в порядке.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отметить соответствие манифесту", "MQS Continue quest",},
			},
		},
		[2] = {
			["Line"] = [[Коробки сильно измяты. Будто ими играли в футбол прямо на складе.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отметить нарушение на планшете", "MQS Continue quest",},
				{"Закрыть глаза на недочёт и отметить проверенность груза", "MQS Continue quest",},
			},
		},
		[3] = {
			["Line"] = [[Несмотря на отсутствие поддона, груз в порядке. Пока что.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отметить недочёт на планшете", "MQS Continue quest",},
				{"Закрыть глаза на недочёт и отметить проверенность груза", "MQS Continue quest",},
			},
		},
		[4] = {
			["Line"] = [[На удивление, ничем не прикрытые фрукты совсем не испортились и подлежат дальнейшей отправке.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отметить соответствие манифесту", "MQS Continue quest",},
			},
		},
		[5] = {
			["Line"] = [[Наши фрукты - самые лучшие. ..А недавно импортированные уже перечернели. Не нужно быть экспертом, чтобы учуять резкий запах гнили.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отметить нарушение на планшете", "MQS Continue quest",},
				{"Закрыть глаза на недочёт и отметить проверенность груза", "MQS Continue quest",},
			},
		},
		[6] = {
			["Line"] = [[Синий контейнер под завязку набит ящиками с бытовой химией. Ничего запрещённого, ничего опасного. ..Если только не принимать их в пищу, разумеется.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отметить соответствие манифесту", "MQS Continue quest",},
			},
		},
		[7] = {
			["Line"] = [[Синий контейнер под завязку набит ящиками с бытовой химией. Однако, за ними еле заметен сундук. О нём ничего не сказано в манифесте.]],
			["Sound"] = "",
			["Answers"] = {
				{"Проверить сундук", 8,},
			},
		},
		[8] = {
			["Line"] = [[Под соломенной обивкой лежал целый брикет кокаина. Кажется, кто-то пытался провезти наркотики в страну. На данный момент успешно.]],
			["Sound"] = "",
			["Answers"] = {
				{
					"Ничего не трогать, закрыть сундук и отметить запрещённый продукт", {
						id = "MQS Skip to",
						data = {
							id = 176,
							quest_id = "loader1"
						}
					}
				},
				{
					"Забрать предмет себе", {
						id = "MQS Skip to",
						data = {
							id = 182,
							quest_id = "loader1"
						}
					}
				},
			},
		},
		[9] = {
			["Line"] = [[Красный контейнер заполнен бочками с нефтепродуктами. Импортированные бочки надёжно закреплены ремнями, отчего никаких повреждений и разливов не случилось.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отметить соответствие манифесту", "MQS Continue quest",},
			},
		},
	}
}