--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/club.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["club_guard"] = {
	name = "Охранник",
	model = "models/cityrp/pm/normal/male_03.mdl",
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {
		["rp_southside_noire"] = {Vector(-7599.576171875, 5427.9423828125, 224.03125), Angle(0, 90.688255310059, 0)},
	},
	submat = {
		[4] = "gbskins/outfit/top_205",
		[8] = "gbskins/outfit/pants_7"
	},
	sequence = "idle_drip",
	uselimit = false,
	skin = 1,
	bgr = {
		[1] = 1,
	},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Куда?]],
			["Sound"] = "",
			["Answers"] = {
				{"Туда.", 2,},
				{"Что за этой дверью?", 3,},
				{"Я к боссу.", 4,},
				{"Забудь.", "close",},
			},
		},
		[2] = {
			["Line"] = [[Не понял?]],
			["Sound"] = "",
			["Answers"] = {
				{"Туда, говорю.", "Throw",},
				{"Я к боссу.", 4,},
				{"Забудь.", "close",},
			},
		},
		[3] = {
			["Line"] = [[Если ты не знаешь - значит тебе туда не надо. Потеряйся.]],
			["Sound"] = "",
			["Answers"] = {
				{"Вообще-то, мне туда надо.", "Throw",},
				{"Ладно.", "close",},
			},
		},
		-- UNINVITED
		[4] = {
			["Line"] = [[Знай своё место. Это мой босс. И тебя твой 'босс' не ждёт.]],
			["Sound"] = "",
			["Answers"] = {
				{"Дезз не там?", 3,},
				{"...", "close",},
			},
		},
		-- INVITED
		[5] = {
			["Line"] = [[С возвращением. Тебя ждут.]],
			["Sound"] = "",
			["Answers"] = {
				{"Знаю.", "GetIn",},
			},
		},
		-- BADENDING
		[6] = {
			["Line"] = [[Знай своё место. Тебя здесь не ждут.]],
			["Sound"] = "",
			["Answers"] = {
				{"Серьёзно?", "Throw",},
			},
		},
		-- QUEST
		[7] = {
			["Line"] = [[Добро пожаловать. Тебя ждут.]],
			["Sound"] = "",
			["Answers"] = {
				{"Спасибо.", "MQS Continue quest",},
			},
		},
		-- QUEST COP
		[8] = {
			["Line"] = [[Куда?]],
			["Sound"] = "",
			["Answers"] = {
				{"У меня есть нерешённое дело с вашим боссом.", 9,},
			},
		},
		[9] = {
			["Line"] = [[Чё?]],
			["Sound"] = "",
			["Answers"] = {
				{"Не компостируй мозги, пропусти пока проблем ещё больше не накопилось.", 10,},
			},
		},
		[10] = {
			["Line"] = [[Дела реально плохи. Ладно, не дай мне пожалеть об этом.]],
			["Sound"] = "",
			["Answers"] = {
				{"Поверь, мы всё быстро решим.", "MQS Continue quest",},
			},
		},
		-- QUEST INVITED
		[11] = {
			["Line"] = [[С возвращением. Тебя ждут.]],
			["Sound"] = "",
			["Answers"] = {
				{"Знаю.", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["club_apns"] = {
	name = "Сутенёр-по-Имени-Прилизанный",
	model = "models/hunter/plates/plate1x2.mdl",
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {
		["rp_southside_noire"] = {Vector(-7680.1845703125, 5093.7915039062, 224.03125), Angle(0, 88.400413513184, 0)},
	},
	sequence = "d1_t02_plaza_sit01_idle",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Нигга чё-ты-хош?]],
			["Sound"] = "",
			["Answers"] = {
				{"", "close",},
				{"", "close",},
				{"", "close",},
				{"", "close",},
			},
		},
		[2] = {
			["Line"] = [[Нигга э-то-кто?]],
			["Sound"] = "",
			["Answers"] = {
				{"Я от Дезза.", 3,},
				{"Дезз сказал, ты мой новый босс.", 3,},
			},
		},
		[3] = {
			["Line"] = [[А, пешка Дезза! Босс сказал к Сутенёру-по-Имени-Прилизанный придёт выполнятель джоба. Рил толк!]],
			["Sound"] = "",
			["Answers"] = {
				{"Ты сутенёр?", 4,},
				{"Ты прилизанный?", 4,},
				{"Так кто Сутенёр по имени Прилизанный?", 5,},
			},
		},
		[4] = {
			["Line"] = [[Нигга ты-глу-хой? Меня зовут Сутенёр-по-Имени-Прилизанный!]],
			["Sound"] = "",
			["Answers"] = {
				{"Так прилизанный же?", 6,},
				{"Я и обращаюсь - сутенёр.", 6,},
				{"Сутенёр-по-Имени-Прилизанный. Запомню.", 5,},
			},
		},
		[5] = {
			["Line"] = [[Эт я! Сутенёр-по-Имени-Прилизанный - моё имя. И в водитьском так записан, и в паспорте. Всё целиком, через чёрточки! Так ко мне и обращайсь, полностью шоб.]],
			["Sound"] = "",
			["Answers"] = {
				{"Интересное имя.", 10,},
				{"Учту.", 10,},
				{"А в свидетельстве о рождении?", 9,},
			},
		},
		[6] = {
			["Line"] = [[Нигга ты-глу-хой? Меня зовут Сутенёр-по-Имени-Прилизанный! Повторяй за мной: Сутенёр-по-Имени-Прилизанный!]],
			["Sound"] = "",
			["Answers"] = {
				{"Так прилизанный же!", 7,},
				{"Я и обращаюсь - сутенёр!", 7,},
				{"Прям всё целиком? Сутенёр-по-Имени-Прилизанный?", 5,},
			},
		},
		[7] = {
			["Line"] = [[Нигга ты-ту-пой? Меня зовут Сутенёр-по-Имени-Прилизанный! Ещё раз: Сутенёр-по-Имени-Прилизанный! Полностью, всё сразу!]],
			["Sound"] = "",
			["Answers"] = {
				{"Это же бред! Прилизанный!", 8,},
				{"Я не собираюсь говорить всё сразу. Сутенёр есть сутенёр! Я обращаюсь по 'званию'!", 8,},
				{"Серьёзно? Сутенёр-по-Имени-Прилизанный? Это у кого имя из четырёх слов состоит?", 5,},
			},
		},
		[8] = {
			["Line"] = [[Никакого уваженья! Даже имя Сутенёра-по-Имени-Прилизанный сказать не можешь! Иди еби себя на улицах!]],
			["Sound"] = "",
			["Answers"] = {
				{"Подожди!", "Throw",},
				{"Могу - и говорю - Прилизанный!", "Throw",},
			},
		},
		[9] = {
			["Line"] = [[Нигга за-е-бёшь! ..Там тоже так записано. Всё, отстань! Смысе, это.. Делай свой джоб и не останешься с блоуджобом.]],
			["Sound"] = "",
			["Answers"] = {
				{"..Ладно?", 10,},
			},
		},
		[10] = {
			["Line"] = [[Вы со Слимом заварили кашу, и терь её надо хлебать пока мы се не захлебнулись.]],
			["Sound"] = "",
			["Answers"] = {
				{"Мне?", 11,},
			},
		},
		[11] = {
			["Line"] = [[Кнешно те! Кому ещё? У 'босса' со Слимом разговор другой, а босс сейчас занят. И чтобы помочь боссу, те надо прикрыть 'босса'. Понимаешь?]],
			["Sound"] = "",
			["Answers"] = {
				{"Да.", 12,},
				{"Нет.", 12,},
				{"Слишком много слова 'босс'. Может не будешь о себе в третьем лице?", 13,},
			},
		},
		[12] = {
			["Line"] = [[Короче, в порту остались части и моего сюрприза, и вашего. Моё точняк найдут из-за вашего - скоро на городской склад приедут копы и всё там перевернут вверх дном.]],
			["Sound"] = "",
			["Answers"] = {
				{"Какой твой сюрприз?", 14,},
				{"Какие такие сюрпризы?", 17,},
			},
		},
		[13] = {
			["Line"] = [[Нигга за-е-бёшь! Сутенёр-по-Имени-Прилизанный базарит как ему вздумается! Сутенёр-по-Имени-Прилизанный не шлюха!]],
			["Sound"] = "",
			["Answers"] = {
				{"...", 12,},
			},
		},
		[14] = {
			["Line"] = [[Нигга ты-че-го? Наркотики, какой ещё? Ты думаешь Сутенёр-по-Имени-Прилизанный перевозит шлюх в контейнерах?]],
			["Sound"] = "",
			["Answers"] = {
				{"Я-то откуда знаю?", 15,},
			},
		},
		[15] = {
			["Line"] = [[Вот терь знаешь - босс не тупой, и 'босс' находит оба товара практичным образом. Шлюхи сами приходят к папочке. Иначе шлюхи - не шлюхи!]],
			["Sound"] = "",
			["Answers"] = {
				{"А наркотики?", 16,},
			},
		},
		[16] = {
			["Line"] = [[А эт уже твой джоб. Дуй в порт, найди кокс, и не дай никому тебя увидеть! Он где-то в фруктах.]],
			["Sound"] = "",
			["Answers"] = {
				{"Что сделать с наркотиками в итоге?", 19,},
				{"Что делать с частями бомбы?", 20,},
				{"Я так понимаю, я не успею сделать обе задачи сразу?", 22,},
			},
		},
		[17] = {
			["Line"] = [[Мой сюрприз - кокс. Твой сюрприз - материалы для бомбы. Как вы ваще это достали? Вам Тех Найн подсунул?]],
			["Sound"] = "",
			["Answers"] = {
				{"Это к Слиму, не ко мне.", 18,},
				{"Он собирал. Как - не знаю.", 18,},
			},
		},
		[18] = {
			["Line"] = [[Лан, не важно - есть джоб по-важнее. Дуй в порт, найди кокс, и не дай никому тебя увидеть! Он где-то в фруктах.]],
			["Sound"] = "",
			["Answers"] = {
				{"Что сделать с наркотиками в итоге?", 19,},
				{"Что делать с частями бомбы?", 20,},
				{"Я так понимаю, я не успею сделать обе задачи сразу?", 22,},
			},
		},
		[19] = {
			["Line"] = [[Можешь считать кокс за оплату труда. Тока не облюбывайся своим товаром, а то закончишь как Тони Монтана. Даже шестёрки должны это помнить!]],
			["Sound"] = "",
			["Answers"] = {
				{"Я за работу.", "MQS Continue quest",},
				{"Что делать с частями бомбы?", 20,},
				{"Я так понимаю, я не успею сделать обе задачи сразу?", 22,},
			},
		},
		[20] = {
			["Line"] = [[Нигга ты-глу-хой? Я те американским по-чёрному объясняю: ты работаешь на 'босса'; босс хочет шоб нашей операции не пришёл конец! Кокс может напрямую привести сюда!]],
			["Sound"] = "",
			["Answers"] = {
				{"Я за работу.", "MQS Continue quest",},
				{"Что сделать с наркотиками в итоге?", 19,},
				{"'Может'? То есть ты сомневаешься?", 21,},
				{"Я так понимаю, я не успею сделать обе задачи сразу?", 22,},
			},
		},
		[21] = {
			["Line"] = [[Нигга за-е-бёшь! Ты всего лишь пешка! Никаких полумер, а то тя отправят плавать как полимеры в Аппере!]],
			["Sound"] = "",
			["Answers"] = {
				{"Я за работу.", "MQS Continue quest",},
				{"Бомба - важнее. Наркотики сами по себе не притянут, а убийство копа натянут как сову на глобус.", "MQS Continue quest",},
			},
		},
		[22] = {
			["Line"] = [[Не успеешь. Копы приедут уже сегодня - надо щас работать! Слушайся 'босса', и босс останется доволен. Ты - пешка, твоя задача - наркотики, не бомба!]],
			["Sound"] = "",
			["Answers"] = {
				{"Я за работу.", "MQS Continue quest",},
				{"Бомба - важнее. Наркотики сами по себе не притянут, а убийство копа натянут как сову на глобус.", "MQS Continue quest",},
			},
		},
		[23] = {
			["Line"] = [[Здарова! Чё не звонишь?]],
			["Sound"] = "",
			["Answers"] = {
				{"Пришлось продавать кокаин.", 24, function() end, function() return MQS.GetSData(nil, "mcs.count", 0) > 0 end},
				{"Пришлось избавляться от улик.", 27, function() end, function() return MQS.GetSData(nil, "mcs.count", 0) == 0 end},
			},
		},
		[24] = {
			["Line"] = [[Да, кстати, насчёт этого.. Босс недоволен. Сутенёр-по-Имени-Прилизанный отбирает у тебя абонемент на сучек!]],
			["Sound"] = "",
			["Answers"] = {
				{"В смысле? Это твоя идея с кокаином!", 25,},
			},
		},
		[25] = {
			["Line"] = [[Нигга о-ху-ел? Обвиняешь Сутенёра-по-Имени-Прилизанный в сходстве мозгов со шлюхой? Босс привёл тебя к 'боссу' чтобы заполнить пробелы, а не создавать проблемы! Ты знаешь разницу между 'слушаться' и 'слушать'? Тебя Вэйн ничему не научил?]],
			["Sound"] = "",
			["Answers"] = {
				{"Что мне остаётся делать, когда все говорят не поступать по-разумному?", 26,},
				{"Даже не думай его приплетать.", 26,},
			},
		},
		[26] = {
			["Line"] = [[Лан, заткнись. Мы все на нервах. Пусть Бог воздаст ебучим копам большим недоёбом и малым количеством сучек!]],
			["Sound"] = "",
			["Answers"] = {
				{"Что дальше?", 28,},
			},
		},
		[27] = {
			["Line"] = [[Босс доволен твоим решением. Сутенёр-по-Имени-Прилизанный тоже доволен. Ты пойми - мы все на нервах, правильные решения из-за сисек у глаз ваще не видно.]],
			["Sound"] = "",
			["Answers"] = {
				{"Что дальше?", 32,},
			},
		},
		[28] = {
			["Line"] = [[Из-за проёба на складе копы пошли обшаривать все мастерские на районе. Тех Найн собирал бомбу у себя на работе - в автомастерской на Гоу Стрит. Те нужно прийти туда и прибраться на его рабочем месте.]],
			["Sound"] = "",
			["Answers"] = {
				{"Почему Тех Найн не может это сделать сам?", 29,},
				{"Почему кто-то другой не может это сделать за меня?", 33,},
			},
		},
		[29] = {
			["Line"] = [[Потому что он сучка! Найн никогда не оставлял таких громких следов. Обычно он переделывал теки под автоматы, это дело незаметное. А тут.. Даже Сутенёр-по-Имени-Прилизанный зассыт на его месте. Только Сутенёр-по-Имени-Прилизанный сидит здесь и не суётся.]],
			["Sound"] = "",
			["Answers"] = {
				{"Нужно вести себя тихо, да.", 30,},
			},
		},
		[30] = {
			["Line"] = [[Давай: гоу на Гоу Стрит, строение второе. Откроешь снаружи правую гаражную дверь, и за работу. И быстрее - копы могут туда сунуться в любой момент!]],
			["Sound"] = "",
			["Answers"] = {
				{"Опять?", 31,},
				{"Пора работать.", "MQS Continue quest",},
			},
		},
		[31] = {
			["Line"] = [[Да, опять. Нехуй подрывать детективов!]],
			["Sound"] = "",
			["Answers"] = {
				{"Кто-ж знал..?", "MQS Continue quest",},
			},
		},
		[32] = {
			["Line"] = [[Копы нихуя не нашли на складе, и думают напороться стадом на какие-нить улики в местных мастерских. Тех Найн собирал бомбу у себя на работе - в автомастерской на Гоу Стрит. Те нужно прийти туда и прибраться на его рабочем месте.]],
			["Sound"] = "",
			["Answers"] = {
				{"Почему Тех Найн не может это сделать сам?", 29,},
				{"Почему кто-то другой не может это сделать за меня?", 33,},
			},
		},
		[33] = {
			["Line"] = [[Нигга ты-ту-пой? Мозг в передачу следующую переставь - зачем ты живёшь если не можешь работать? За проблемы нужно платить!]],
			["Sound"] = "",
			["Answers"] = {
				{"И вправду.", 30,},
				{"Я Слиму припомню..", 30,},
			},
		},
		[34] = {
			["Line"] = [[Нигга ус-по-койся! Биферы под контролем!]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[35] = {
			["Line"] = [[И чё?]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[36] = {
			["Line"] = [[Всё что ты щас замочишь - это свои штаны. А теперь замолчи!]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[37] = {
			["Line"] = [[Нигга за-мол-чи! Ваша мясорубка фальшивая - она прикрывает нас уже сколько?!]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[38] = {
			["Line"] = [[Нигга не-вле-зай! Мы дела решаем!]],
			["Sound"] = "",
			["Answers"] = {
				{"Я дела решаю. Что в этот раз случилось?", 39,},
				{"Я здесь чтобы за вами убирать. Что в этот раз случилось?", 39,},
			},
		},
		[39] = {
			["Line"] = [[Те короткую или длинную историю?]],
			["Sound"] = "",
			["Answers"] = {
				{"Короткую.", 40,},
				{"Длинную.", 41,},
			},
		},
		[40] = {
			["Line"] = [[Биферы обосрались, Худеры недовольствуют - а Биферам не нравится этот пиздёж. И как нигеры решают дела? Ниггер-моментами - стреляют пока патроны не закончатся.]],
			["Sound"] = "",
			["Answers"] = {
				{"Ниггер-моменты не смертельны же?", 42,},
				{"Дай угадаю - надо как-то примирить обе банды?", 42,},
			},
		},
		[41] = {
			["Line"] = [[Помнишь стрельбу в клубе? Один из Биферов сыканул и открыл огонь по копу. ..Этого же копа вы потом домочили, но это не важно. Важно с кого всё началось - и это не нравится никому. Биферы звереют с обвинений, остальные не видят в себе их отражений..

Вот нигеры и дошли до ниггер-момента.]],
			["Sound"] = "",
			["Answers"] = {
				{"Ниггер-моменты не смертельны же?", 42,},
				{"Дай угадаю - надо как-то примирить обе банды?", 42,},
			},
		},
		[42] = {
			["Line"] = [[Нигга, как же ты щас ошибаешься.. Это не обычное прикрывалово - щас Биферы на полном серьёзе хотят вычистить Худеров. И Биферов нельзя отстреливать в ответ - весь этот фарс играет нам на руку. Дезз же говорил как мы работаем? Кто работает? На кого?]],
			["Sound"] = "",
			["Answers"] = {
				{"Упоминал.", 43,},
				{"Нет. Только сейчас узнаю.", 43,},
			},
		},
		[43] = {
			["Line"] = [[Вот, ближе к делу совсем узнаешь. Щас от тя требуется проследить за.. процессом.]],
			["Sound"] = "",
			["Answers"] = {
				{"Проследить? Перестрелка же начнётся!", 44,},
			},
		},
		[44] = {
			["Line"] = [[Они уже! Где вы щас собираетесь?]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[45] = {
			["Line"] = [[Вот, как раз территории ваши пересекаются.]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[46] = {
			["Line"] = [[Нигга ты-ту-пой?]],
			["Sound"] = "",
			["Answers"] = {
				{"Так, хватит. Что ты хочешь?", 47,},
			},
		},
		[47] = {
			["Line"] = [[В смысле?]],
			["Sound"] = "",
			["Answers"] = {
				{"Ты говоришь Биферы перестреляют Худеров, и Биферов нельзя трогать.", 48,},
				{"Ты говоришь надо вести себя тихо - какое это тихо?", 48,},
				{"Конфликт слишком близко к клубу. Сам факт конфликта прямо сейчас между ближайшими бандами - знак, падающий на нас.", 48,},
			},
		},
		[48] = {
			["Line"] = [[Ой блять.. Короче, минимизируй потери!]],
			["Sound"] = "",
			["Answers"] = {
				{"Сделаем.", "MQS Continue quest",},
				{"Ты - авторитет, ты мог всё решить раньше. Теперь это приходится расхлёбывать мне.", "MQS Continue quest",},
				{"Тебе совсем похуй что ли?", 49,},
			},
		},
		[49] = {
			["Line"] = [[Нигга ты-сов-сем? У меня и так забот хватает!]],
			["Sound"] = "",
			["Answers"] = {
				{"Их хватает из-за такого похуизма! Копы нам дышат в спину - а ты чё делаешь? Помогаешь разваливаться!", 50,},
			},
		},
		[50] = {
			["Line"] = [[...]],
			["Sound"] = "",
			["Answers"] = {
				{
					"Правильно, не надо ничего говорить! Надо проблемы решать. Уже еду.", {
						id = "MQS StoreData",
						data = {
							id = "bold",
							info = 1,
							quest_id = "chapter2_criminal_3"
						},
					}
				},
				{
					"И хули ты молчишь? Копы сунутся сюда если допустить стрельбу! Опять мне чинить всё!", {
						id = "MQS StoreData",
						data = {
							id = "bold",
							info = 1,
							quest_id = "chapter2_criminal_3"
						},
					}
				},
				{
					"Думай как эту хуйню отгородить от нас, я поеду сейчас затыкать недовольных.", {
						id = "MQS StoreData",
						data = {
							id = "bold",
							info = 1,
							quest_id = "chapter2_criminal_3"
						},
					}
				},
			},
		},
	}
}