--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/criminal_slim_breakin.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["criminal_slim_breakin"] = {
	name = "Слим Шейди",
	model = "models/cityrp/pm/normal/male_06.mdl",
	submat = {
		[4] = "gbskins/outfit/top_200",
		[8] = "gbskins/outfit/pants_200",
		[9] = "gbskins/outfit/boots_51"
	},
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = true,
	pos = {},
	sequence = "lineidle04",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Чё надо?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/1.mp3",
			["Answers"] = {
				{"Ничего. Я пойду.", "close",},
			},
		},
		[2] = {
			["Line"] = [[Чё надо?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/2.mp3",
			["Answers"] = {
				{"Я по работе.", 4,},
				{"О, так ты живой! Мне казалось, тебя должны были загрести.", 5,},
				{"Ничего. Я пойду.", 3,},
			},
		},
		[3] = {
			["Line"] = [[Ну дак не шатайся тоды, э!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/3.mp3",
			["Answers"] = {
				{"Постой..!", "MQS Fail quest",},
			},
		},
		[4] = {
			["Line"] = [[Какой работе? Мне ничё не говорили.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/4.mp3",
			["Answers"] = {
				{"Я от Дезза.", 9,},
				{"Неужели для меня совсем ничего нет?", 11,},
				{"Мне казалось, что тут что-то недавно творилось.", 12,},
			},
		},
		[5] = {
			["Line"] = [[Чё? Шалава, ты прослушку носишь? На меня копам балаболишь?!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/5.mp3",
			["Answers"] = {
				{"Ни в коем случае!", 7,},
				{"Я имею в виду, что в таком бизнесе долго не живут. А с твоей болтовнёй..", 8,},
				{"Хотелось бы.", 6,},
			},
		},
		[6] = {
			["Line"] = [[Не, забудь. Ваще забудь. Сгинься, ну!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/6.mp3",
			["Answers"] = {
				{"Постой..!", "MQS Fail quest",},
			},
		},
		[7] = {
			["Line"] = [[Блять, не нервируй.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/7.mp3",
			["Answers"] = {
				{"Я имею в виду, что в таком бизнесе долго не живут. А с твоей болтовнёй..", 8,},
				{"А мне хочется. Ты слишком грубый.", 6,},
			},
		},
		[8] = {
			["Line"] = [[Это ты типа меня так крысой называешь? Тогда хули я тут стою, живой? ..Слушай сюда: крысы долго не живут, а Дезза я знаю достаточно. И он мне нихера не говорил про встречу с тобой. Это типа чё?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/8.mp3",
			["Answers"] = {
				{"Я от Дезза.", 9,},
				{"Неужели для меня совсем ничего нет?", 11,},
				{"Мне казалось, что тут что-то недавно творилось.", 12,},
			},
		},
		[9] = {
			["Line"] = [[Тогда чё я ничё не знаю?! Я мож дохуя в пустоту болтаю, но я не планктон какой-то, чтоб за пять минут игрушки из стекла надуть.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/9.mp3",
			["Answers"] = {
				{"Мне пришло уведомление на телефон. Это был не он?", 10,},
				{"Неужели для меня совсем ничего нет?", 11,},
				{"Мне казалось, что тут что-то недавно творилось.", 12,},
			},
		},
		[10] = {
			["Line"] = [[..Хуйня какая-то. Ну раз пришло, знач пришло. Те хотя-б доверять можно. Ну, в смысе мелкую дичь доверять, работу всякую. Кароч, раз ты тут, то грей уши: один чудень на букву 'м' нашего мужика копам сдал. Не, дело-то плюс-минус обычное, да вот респектабельный же чел был. Так прост так не поступают.

Сто пудов на него надавили, ну! Ща по улицам слухи ходят про какого-то комиссара - и вмесь с ним наших в гадильник только так завозят. Мож обосрался, хз - но поблажек никому давать нельзя. Правила на то и правила: шо в Африке, шо на улицах.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/10.mp3",
			["Answers"] = {
				{"Что нужно сделать?", 13,},
			},
		},
		[11] = {
			["Line"] = [[Для тебя - нет. ..Но мож чё и найдётся. Те хотя-б доверять можно. Ну, в смысе мелкую дичь доверять. Кароч, грей уши: один чудень на букву 'м' нашего мужика копам сдал. Не, дело-то плюс-минус обычное, да вот респектабельный же чел был. Так прост так не поступают.

Сто пудов на него надавили, ну! Ща по улицам слухи ходят про какого-то комиссара - и вмесь с ним наших в гадильник только так завозят. Мож обосрался, хз - но поблажек никому давать нельзя. Правила на то и правила: шо в Африке, шо на улицах.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/11.mp3",
			["Answers"] = {
				{"Что нужно сделать?", 13,},
			},
		},
		[12] = {
			["Line"] = [[Не, тут постоянно чё-то мутится, базару нет. Но ты тут каким боком? ..Хотя, есть кое чё; те хотя-б доверять можно. Ну, в смысе мелкую дичь доверять. Кароч, грей уши: один чудень на букву 'м' нашего мужика копам сдал. Не, дело-то плюс-минус обычное, да вот респектабельный же чел был. Так прост так не поступают.

Сто пудов на него надавили, ну! Ща по улицам слухи ходят про какого-то комиссара - и вмесь с ним наших в гадильник только так завозят. Мож обосрался, хз - но поблажек никому давать нельзя. Правила на то и правила: шо в Африке, шо на улицах.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/12.mp3",
			["Answers"] = {
				{"Что нужно сделать?", 13,},
			},
		},
		[13] = {
			["Line"] = [[Ну не тупи, у тя же ходка уже была - урок преподать надо! Ток не бедлам мутить как с золотом, а именно что маляву символичную оставить. Ломани форточку отмычкой, а чтоб наверняк - ещё стырь чё нить дорогое. 'Вилку' дам, машину тоже - всё за углом.

Товарищ этот оч скользкий, так что его самого ты вряд ли встретишь. Как закончишь, то делай как в прошлый раз - скидывай честно награбленное в мусорку. В эту вот, позади.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/13.mp3",
			["Answers"] = {
				{"Хорошо, я работать.", "MQS Continue quest",},
				{"Теперь-то 'шуметь' можно?", 14,},
				{"Можешь дать совет для дела?", 15,},
				{"Кстати, а почему мусорки? Ну, именно помеченные крысами?", 18,},
			},
		},
		[14] = {
			["Line"] = [[Можно. Ты ток не загреби как он, лады? И не ебашь всё на своём пути - думай. Думалка у тя на месте, поугрожай пушкой еси есть. Должна уже быть к такому моменту, ну?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/14.mp3",
			["Answers"] = {
				{"Ладно.", "MQS Continue quest",},
				{"Что, если пушки нет?", 16,},
				{"Можешь дать совет для дела?", 15,},
				{"Кстати, а почему мусорки? Ну, именно помеченные крысами?", 18,},
			},
		},
		[15] = {
			["Line"] = [[..Ну тут сложно. Люди в этом бизнесе друг про друга инфу обычно не балакают, он свою хату спалил вообще случайно. Хз есть ли у этого чёрта родня, хз подпирает чё окно или нет. Там войти с балкона можно, но те в любом случае нужно будет отмычкой орудовать.

У него мож стоять электронка, но даж такую дверь 'вилкой' ломануть можно. Не ищи панелей - хуярь прямо так. Они хрупкие, как малолетки.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/15.mp3",
			["Answers"] = {
				{"Спасибо. Тогда приступаю.", "MQS Continue quest",},
				{"Теперь-то 'шуметь' можно?", 14,},
				{"Что делать, если там все-все эти страшилки будут?", 16,},
				{"Кстати, а почему мусорки? Ну, именно помеченные крысами?", 18,},
			},
		},
		[16] = {
			["Line"] = [[Да меня не ебёт! Ты сюда ковыляешь, за язык меня тянешь, и я ещё с ложечки кормить тя должен? Может, те ещё и имя своё сказать?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/16.mp3",
			["Answers"] = {
				{"..Давай потом? Я лучше делом займусь.", "MQS Continue quest",},
				{"Почему нет?", 17,},
			},
		},
		[17] = {
			["Line"] = [[Мы типа собутыльники, шоб так базарить? ..Лан, зови меня Слим Шейди. Всё, иди деньги делать!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/17.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Теперь-то 'шуметь' можно?", 14,},
				{"Можешь дать совет для дела?", 15,},
				{"Кстати, а почему мусорки? Ну, именно помеченные крысами?", 18,},
			},
		},
		[18] = {
			["Line"] = [[Не, ну ты даёшь. Знаешь такую тему, как 'логистика'? А 'планирование'?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/breakin/18.mp3",
			["Answers"] = {
				{"До меня дошло. Я работать.", "MQS Continue quest",},
				{"Теперь-то 'шуметь' можно?", 14,},
				{"Можешь дать совет для дела?", 15,},
				{"Да. Но почему именно крысы? Что, если этот символизм раскроют?", 16,},
			},
		},
	}
}