--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/criminal_slim_jewelry.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["criminal_slim_jewelry"] = {
	name = "Слим Шейди",
	model = "models/cityrp/pm/normal/male_06.mdl",
	namepos = 80,
	theme = "Default",
	submat = {
		[4] = "gbskins/outfit/top_200",
		[8] = "gbskins/outfit/pants_200",
		[9] = "gbskins/outfit/boots_51"
	},
	scale = 1,
	questNPC = true,
	pos = {},
	sequence = "lineidle04",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Чё надо?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/1.mp3",
			["Answers"] = {
				{"Ничего. Я пойду.", "close",},
			},
		},
		[2] = {
			["Line"] = [[Чё надо?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/2.mp3",
			["Answers"] = {
				{"Я по поводу задания.", 4,},
				{"Ты бы ещё в мусорке спрятался. Настолько копов боишься?", 3,},
				{"Ничего, пока что.", 17,},
			},
		},
		[3] = {
			["Line"] = [[Слыш, я тя не знаю.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/3.mp3",
			["Answers"] = {
				{"Постой..!", "MQS Fail quest",},
			},
		},
		[4] = {
			["Line"] = [[Чего-чего?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/4.mp3",
			["Answers"] = {
				{"Я от Дезза.", 6,},
				{"Задание, говорю. Дело, поручение.. Работа, понимаешь?", 3,},
				{"Ничего. Я пойду.", 5,},
			},
		},
		[5] = {
			["Line"] = [[Слыш, фраер! Стопэ за мной ходить.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/5.mp3",
			["Answers"] = {
				{"Постой..!", "MQS Fail quest",},
			},
		},
		[6] = {
			["Line"] = [[А, ну так бы сразу. Тода зырь, дело такое: ювелирка местная платить за крышу не хочет. Не, ну внатуре чепушилы! Вот тута заскакиваешь ты - и показываешь, чё значит не платить, и о чём они забудут еси продолжат долю с намь делить. Смекаешь?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/6.mp3",
			["Answers"] = {
				{"Кажется, да.", 7,},
				{"А можно теперь по-человечески?", 13,},
			},
		},
		[7] = {
			["Line"] = [[Ну вона и понятно, тебя-б иначе Дезз не приметил. Короче, берёшь пушку из синего контейнера, шуму много не наводишь, и сносишь ей витрины. Шоб точняк поняли чё к чему - самое дорогое сцапай с собой. Не обеднеют, слишком кошерный бизнес.

В смысе такая тема должна по-кошерному расплачиваться, а не по-петушиному, не? ..Это, как закончишь - ты пушку с брюликами в мусорку спрячь. Не в такую же, а в помеченную. Ну, ты поймёшь в общем, таких в городе с достатком - с крысами в кружках. Бабки потом получишь.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/7.mp3",
			["Answers"] = {
				{"Хорошо, вроде всё понятно.", "MQS Continue quest",},
				{"Подожди, без шума?", 8,},
				{"Не раскроют ли такую мусорку?", 11,},
				{"Можешь дать совет для дела?", 12,},
			},
		},
		[8] = {
			["Line"] = [[Ну в смысе шоб без жертв, понимаешь? У тя пушка без патронов спецом будет, считай это как тест. Были уже кадры; эт не недоверие, а тупо предосторожность. Ей легче стекло ломать чем руками, следов не будет, ещё и люди пугаются. Одни плюсы, ну?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/8.mp3",
			["Answers"] = {
				{"Логично. Тогда я за дело.", "MQS Continue quest",},
				{"А если я свои патроны использовать буду?", 9,},
				{"Не раскроют ли такую мусорку?", 11,},
				{"Можешь дать совет для дела?", 12,},
			},
		},
		[9] = {
			["Line"] = [[Даже блять не думай.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/9.mp3",
			["Answers"] = {
				{"Хорошо, успокойся. Я за дело.", "MQS Continue quest",},
				{"Даже если на меня нападут?", 10,},
				{"Не раскроют ли такую мусорку?", 11,},
				{"Можешь дать совет для дела?", 12,},
			},
		},
		[10] = {
			["Line"] = [[Ля, ты постоять за себя словами не могёшь? Покажи шо по-чистому живёшь, по понятиям!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/10.mp3",
			["Answers"] = {
				{"Постараюсь. Я за дело.", "MQS Continue quest",},
				{"Что-то мне это не нравится..", 17,},
				{"Не раскроют ли такую мусорку?", 11,},
				{"Можешь дать совет для дела?", 12,},
			},
		},
		[11] = {
			["Line"] = [[Та не, мусора слишком тупые шоб в мусоре копаться. Сам эту хохму придумал, а как грица - в каждой шутке есть доля правды. На мази сё будет, не ссы! Не первый день уже так мутим.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/11.mp3",
			["Answers"] = {
				{"Логично. Тогда я за дело.", "MQS Continue quest",},
				{"Подожди, без шума?", 8,},
				{"Что-то мне это не нравится..", 17,},
				{"Можешь дать совет для дела?", 12,},
			},
		},
		[12] = {
			["Line"] = [[Ты-б ещё подобное мус- ..Кхм, я-б на твоём месте запасся отмычками, ну на всякий случай. А так, еси вдруг за тобой погоня будет, иль до мусорки не дотянуться - всегда на помощь придут стоки. Дело мокрое, во всех смыслах; ты главное не шуми.

Это тоже во всех смыслах. Там под городом такая хуйня водится, шо пиздец.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/12.mp3",
			["Answers"] = {
				{"Логично. Тогда я за дело.", "MQS Continue quest",},
				{"Подожди, без шума?", 8,},
				{"Не раскроют ли такую мусорку?", 11,},
				{"Что-то мне это не нравится..", 17,},
			},
		},
		[13] = {
			["Line"] = [[Так, человекула, слухай сюда: мы базарим по-чёрному спецом чтоб нас не закрыли, понимаешь? Или ты шевелишь извилинами и щас же по тихой всё смекаешь, или работы те не видать. Мы как легавые базарить не собираемся.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/13.mp3",
			["Answers"] = {
				{"Хорошо.", 14,},
				{"Мужик, на это время нужно. А ты его на прятки тратишь.", 5,},
				{"Тогда я не собираюсь браться за что бы то ни было.", "MQS Fail quest",},
			},
		},
		[14] = {
			["Line"] = [[Ну вот! Чё, так сложно хотя-б поддакивать шоль? Не, гордость кнеш дело человеческое, только её иногда в унитаз окунать нужно. Все начинают с низов - иногда формальности ради - без исключений. Ну, в смысе исключения есть, они щас сидят и деньги считают. А ведь они даж не ихние!

Наследство и лёгкий путь - не правильно это сё. Атмосферой типы не проникаются, ходки не мутят, опыт не крутят.. И чё они могут? Тока ебалом щёлкать.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/14.mp3",
			["Answers"] = {
				{"Так о чём работа?", 15,},
				{"Ну, болтать и ты горазд.", 16,},
				{"Я ничего не понимаю.", 17,},
			},
		},
		[15] = {
			["Line"] = [[Так бы сразу, ну! Короче, берёшь пушку из синего контейнера, шуму много не наводишь, и сносишь ей витрины. Шоб точняк поняли чё к чему - самое дорогое сцапай с собой. Не обеднеют, слишком кошерный бизнес.

В смысе такая тема должна по-кошерному расплачиваться, а не по-петушиному, не? ..Это, как закончишь - ты пушку с брюликами в мусорку спрячь. Не в такую же, а в помеченную. Ну, ты поймёшь в общем, таких в городе с достатком - с крысами в кружках. Бабки потом получишь.
]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/15.mp3",
			["Answers"] = {
				{"Хорошо, вроде всё понятно.", "MQS Continue quest",},
				{"Подожди, без шума?", 8,},
				{"Не раскроют ли такую мусорку?", 11,},
				{"Можешь дать совет для дела?", 12,},
			},
		},
		[16] = {
			["Line"] = [[Тока я по делу мелю, а не лапшу везу. Ну чё, долго мы будем тут торчать?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/16.mp3",
			["Answers"] = {
				{"Так о чём работа?", 15,},
				{"Я ничего не понимаю.", 17,},
			},
		},
		[17] = {
			["Line"] = [[Ну тода иди в другом месте шароёбиться!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/jewelry/17.mp3",
			["Answers"] = {
				{"Постой..!", "MQS Fail quest",},
			},
		},
	}
}