--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/criminal_slim_dirty.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["criminal_slim_dirty"] = {
	name = "Слим Шейди",
	model = "models/cityrp/pm/normal/male_06.mdl",
	submat = {
		[4] = "gbskins/outfit/top_200",
		[8] = "gbskins/outfit/pants_200",
		[9] = "gbskins/outfit/boots_51"
	},
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = true,
	pos = {},
	sequence = "lineidle04",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Глаза разуй! Пиздуй давай!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/1.mp3",
			["Answers"] = {
				{"...", "close",},
			},
		},
		[2] = {
			["Line"] = [[..Вот уёбок! Сука, ну как так можно? Я-ж фраеру припомню. Убью блять! Слышишь? Я это запомню! На всю жизнь запомню!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/2.mp3",
			["Answers"] = {
				{"Эй!", 3,},
			},
		},
		[3] = {
			["Line"] = [[Кто?! ..А, это ты. Господи, какой пиздец. Сначала облавы эти, а теперь.. ты ведь за ним?]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/3.mp3",
			["Answers"] = {
				{"Да.", 4,},
				{"Да. К сожалению.", 5,},
				{"Облавы? Ты хочешь сказать, что полиция смотрела не только за мной?", 6,},
				{"Я хочу помочь. Давай убьём Дезза?", 7,},
			},
		},
		[4] = {
			["Line"] = [[..Он готов. Я не буду мешать. Сделай это быстро, и чтобы Дезз услышал.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/4.mp3",
			["Answers"] = {
				{"Постараюсь.", "MQS Continue quest",},
			},
		},
		[5] = {
			["Line"] = [['К сожалению', блять. Оставь это сожаление при себе. ..Он готов. Я не буду мешать. Сделай это быстро, и чтобы Дезз услышал.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/5.mp3",
			["Answers"] = {
				{"Постараюсь.", "MQS Continue quest",},
			},
		},
		[6] = {
			["Line"] = [[Конечно блять! Чё, думаешь ты такая залупа пресная?! Да на нас всех внезапно обрушилась кара небесная! Тек Найн, Прилиза, Дезз, Вэйн, я..! Схуяли мы? Почему сейчас? Почему?! 

..Он готов. Я не буду мешать. Сделай это быстро, и чтобы Дезз услышал.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/6.mp3",
			["Answers"] = {
				{"Постараюсь.", "MQS Continue quest",},
			},
		},
		[7] = {
			["Line"] = [[Даж если-б он ща не подслушивал, то чёрта с два! Я-ж образно блять! Эт даже больше не по понятиям, чем своего кончать! Думай перед тем чё пиздишь и делаешь, а то..

..Он готов. Я не буду мешать. Сделай это быстро, и чтобы Дезз услышал.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/7.mp3",
			["Answers"] = {
				{"Постараюсь.", "MQS Continue quest",},
			},
		},
		[8] = {
			["Line"] = [[Какая хуйня..]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/8.mp3",
			["Answers"] = {
				{"Готов?", 9,},
			},
		},
		[9] = {
			["Line"] = [[Да. Нет. ..Наверное. 
			
..Вообще, знаешь чё? А пошёл-ка Дезз нахуй! Забудь чё я сказал - мы поступим по-своему! Он хочет чтоб Вэйн мучился и мы какой-то урок из этого усвоили, а сам знач сидит и общак осваивает? Да нахуй такие уроки, пусть сам так учится! Пусть учится жизни у реальных мужиков!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/9.mp3",
			["Answers"] = {
				{"Что ты имеешь в виду?", 10,},
			},
		},
		[10] = {
			["Line"] = [[Мужичелло не должен вот так разрываться. И так настрадался пацан, хватит с него! Лучше пулю в лоб, чем сразу взахлёб.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/10.mp3",
			["Answers"] = {
				{"Лёгкий путь. Это правильное решение.", 11,},
				{"Лёгкий путь. Это неправильное решение.", 11,},
				{"Ты уверен? Нам ничего с этого не будет?", 12,},
				{"Я не позволю. Мне моя шкура дорога.", 13,},
			},
		},
		[11] = {
			["Line"] = [[Захлопнись.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/11.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[12] = {
			["Line"] = [[Ваще плевать. Пусть передо мной со мной базарит, как мужик с мужиком!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/12.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[13] = {
			["Line"] = [[Тебя не спрашивали.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/13.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[14] = {
			["Line"] = [[..Знаешь, чё в этом гадюшнике так болтунов много? Пушто каждый хочет съебаться от всего подальше. Ну в смысе душевно. Всех так заёбывает эта жизнь, что люд иль руки опускает и замолкает, иль разбазаривается как он - почти, как он. Вэйн говорил мне об этом, и я ток ща допираю.

Мы не заслужили его. Слишком умный нигер, в слишком тупом мире.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/14.mp3",
			["Answers"] = {
				{"Я понимаю.", 15,},
				{"Я не понимаю.", 17,},
				{"Так.. что дальше?", 15,},
				{"Почему ты мне это говоришь?", 18,},
			},
		},
		[15] = {
			["Line"] = [[Я это так не оставлю. Кто-то за эту хуйню ответит. ..Начнём с оборотильника местного. На шальную не попрёмся - у меня есть план. Как отоспишься - звякни мне и пиздуй в клуб. ..Дезз, слышишь?! Иди нахуй! Я буду работать по-своему!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/15.mp3",
			["Answers"] = {
				{"До связи.", "MQS Continue quest",},
				{"Не, я пас.", 16,},
			},
		},
		[16] = {
			["Line"] = [[Сышишь! Мы в этой хуйне вместе, и никто прост так из неё не уходит! Вот те уже неживая доказуха - Лил Вэйн пытался - мы последнее время только его дерьмо и разгребали! ..Эх, жалко чела.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/16.mp3",
			["Answers"] = {
				{"Точно. До связи.", "MQS Continue quest",},
			},
		},
		[17] = {
			["Line"] = [[Знач поймёшь когда уже будет поздно. Ну, как я. Мы все ответим за свои ошибки. ..И следующими расплачиваться будут копы, очень скоро. На шальную не попрёмся - у меня есть план. Как отоспишься - звякни мне и пиздуй в клуб. ..Дезз, слышишь?! Иди нахуй! Я буду работать по-своему!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/17.mp3",
			["Answers"] = {
				{"До связи.", "MQS Continue quest",},
				{"Не, я пас.", 16,},
			},
		},
		[18] = {
			["Line"] = [[Сышишь! Мы в этой хуйне вместе, даж не думай как-то от жизни отмазываться! Вот те уже неживая доказуха - Лил Вэйн пытался - мы последнее время только его дерьмо и разгребали! ..Эх, жалко чела.]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/18.mp3",
			["Answers"] = {
				{"Точно.", 19,},
			},
		},
		[19] = {
			["Line"] = [[Я это так не оставлю. Кто-то за эту хуйню ответит. ..Начнём с оборотильника местного. На шальную не попрёмся - у меня есть план. Как отоспишься - звякни мне и пиздуй в клуб. ..Дезз, слышишь?! Иди нахуй! Я буду работать по-своему!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/19.mp3",
			["Answers"] = {
				{"До связи.", "MQS Continue quest",},
				{"Не, я пас.", 20,},
			},
		},
		[20] = {
			["Line"] = [[Слыш, очко, у тя дыра в мозгу или чё?! Те не отвертеться, ну!]],
			["Sound"] = "https://macnco.one/gmod/vo/slim/dirty/20.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Точно.", "MQS Continue quest",},
				{"Дыра у твоего друга. Отстань.", "MQS Continue quest",},
			},
		},
	}
}