--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/criminal_dezth_dirty.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["criminal_dezth_dirty"] = {
	name = "Дезз",
	model = "models/cityrp/pm/normal/male_01.mdl",
	submat = {
		[4] = "gbskins/outfit/top_19",
		[8] = "gbskins/outfit/pants_19",
		[9] = "gbskins/outfit/boots_3",
		[2] = "models/gmodbest/citizens/facemaps/van_facemap6"
	},
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "lineidle02",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[...]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "close",},
			},
		},
		[2] = {
			["Line"] = [[...]],
			["Sound"] = "",
			["Answers"] = {
				{"...", 3,},
				{"Привет. Есть работа?", 3,},
				{"Что ты тут делаешь?", 3,},
				{"Дай угадаю - ты пришёл за мной?", 3,},
			},
		},
		[3] = {
			["Line"] = [[Ничего не хочешь рассказать?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/3.mp3",
			["Answers"] = {
				{"О чём ты?", 4,},
				{"Нет.", 5,},
				{"Хочу. Про Слима Шейди.", 11,},
				{"Хочу. Про Лил Вэйна.", 13,},
			},
		},
		[4] = {
			["Line"] = [[О Лил Вэйне и его друге. Не про умолченную прослушку. Повторю вопрос: ничего, не хочешь, сказать?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/4.mp3",
			["Answers"] = {
				{"Я не понимаю, о чём ты.", 5,},
				{"Хочу. Про Слима Шейди.", 11,},
				{"Хочу. Про Лил Вэйна.", 13,},
				{"Не хочу.", 5,},
			},
		},
		[5] = {
			["Line"] = [[Как пожелаешь. ..Твои действия не остались незамеченными. За них придётся платить. Видишь цемент?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/5.mp3",
			["Answers"] = {
				{"Вижу.", 6,},
				{"Нет.", 8,},
			},
		},
		[6] = {
			["Line"] = [[Намёк понят?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/6.mp3",
			["Answers"] = {
				{"Понят.", 7,},
				{"Я не хочу никого убивать.", 14,},
				{"Я не хочу умирать.", 14,},
				{"Другого выхода нет?", 15,},
			},
		},
		[7] = {
			["Line"] = [[Как закончишь - иди со смесью в стоки, к смыву в океан. Дальше ты поймёшь.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/7.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"А если я не захочу?", 8,},
			},
		},
		[8] = {
			["Line"] = [[Нигер. Выёбываешься.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/8.mp3",
			["Answers"] = {
				{"Простите.", 9,},
				{"Да иди ты!", 10,},
				{"Почему тебе можно, а мне нельзя?", 10,},
				{"Ты всего лишь барыга. Это я тут делаю всю работу, и я заслуживаю уважения.", 10,},
			},
		},
		[9] = {
			["Line"] = [[Начнём с самого начала. Видишь, цемент?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/9.mp3",
			["Answers"] = {
				{"Вижу.", 16,},
				{"Нет.", 10,},
			},
		},
		[10] = {
			["Line"] = [[Надоело.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/10.mp3",
			["Answers"] = {
				{"Нет, подожди!", "Shoot player",},
			},
		},
		[11] = {
			["Line"] = [[Слушаю.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/11.mp3",
			["Answers"] = {
				{"Он болтает так же много, как Лил Вэйн. Такие обычно себя не слышат - он мог что-нибудь спалить.", 12,},
				{"Он нормальный мужик. Он точно не заслуживает такого исхода.", 12,},
				{"Он мудак редкостный. Никакой конкретики и организации. И он твоя шестёрка..?", 12,},
				{"Из-за его друга за мной шастали копы. Эти двое сто пудов крысы!", 12,},
			},
		},
		[12] = {
			["Line"] = [[Приму к сведению. Хочешь ещё что-нибудь сказать?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/12.mp3",
			["Answers"] = {
				{"Нет.", 5,},
				{"Да. Про Слима Шейди.", 11,},
				{"Да. Про Лил Вэйна.", 13,},
				{"Да. Ты бесишь своими ребусами.", 8,},
			},
		},
		[13] = {
			["Line"] = [[Слушаю.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/13.mp3",
			["Answers"] = {
				{"Он очень, очень болтливый. Кажется, у него какая-то форма логореи - словестного поноса. Он всё спалил.", 12,},
				{"Он слишком опасный актив для такой деятельности. Умные беды надумают.", 12,},
				{"Он не заслуживает этого. За ним кто-то следил, кто-то хотел его подставить!", 12,},
				{"Из-за него за мной слишком мощно шастали копы. Он крыса!", 12,},
			},
		},
		[14] = {
			["Line"] = [[Неправильная карьера. Или ты, или тебя. Время выбирать.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/14.mp3",
			["Answers"] = {
				{"Хорошо, я сделаю это.", 7,},
				{"Я не буду этого делать.", 8,},
			},
		},
		[15] = {
			["Line"] = [[Нет.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/15.mp3",
			["Answers"] = {
				{"Хорошо, я сделаю это.", 7,},
				{"Почему?", 8,},
				{"Я не буду этого делать.", 8,},
			},
		},
		[16] = {
			["Line"] = [[Намёк, понят?]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/16.mp3",
			["Answers"] = {
				{"Понят.", 17,},
				{"Нет.", 10,},
			},
		},
		[17] = {
			["Line"] = [[Как закончишь - иди со смесью в стоки, к смыву в океан. Дальше ты поймёшь.]],
			["Sound"] = "https://macnco.one/gmod/vo/dezth/dirty/17.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"А если я не захочу?", 10,},
			},
		},
	}
}