--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/itemsbackground.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["crate"] = {
	name = "Находка",
	model = "models/hunter/blocks/cube05x05x05.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	pos = {
		["rp_southside_noire"] = {Vector(-280.22021484375, 4205.5498046875, -9187.23828125), Angle(0, -176.71650695801, 0)},
	},
	bgr = {},
	sequence = "",
	submat = {
		[0] = "null"
	},
	uselimit = false,
	skin = 1,
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Под апельсинами действительно нашлись белые пакеты с порошком. Брикеты так никто и не приметил. Скоро это поменяется, если вовремя не сбежать.]],
			["Sound"] = "",
			["Answers"] = {
				{"Забрать кокаин и уйти", "MQS Continue quest",},
			},
		},
		[2] = {
			["Line"] = [[На бумаге указаны номера всех сотрудников, посменно. Среди рабочих есть Тех Найн - его номер дважды подчёркнут. Нужно позвонить раньше, чем до того доберутся полицейские.]],
			["Sound"] = "",
			["Answers"] = {
				{"Запомнить номер и отойти", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["crate2"] = {
	name = "Коробки",
	model = "models/hunter/blocks/cube05x05x05.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	submat = {
		[0] = "null"
	},
	pos = {},
	bgr = {},
	questNPC = false,
	sequence = "",
	uselimit = false,
	skin = 1,
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Коробки недавно кто-то распаковывал. Видимо, недавняя доставка.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Коробки недавно кто-то распаковывал. Видимо, недавняя доставка для Тех Найна.]],
			["Sound"] = "",
			["Answers"] = {
				{"Раскрыть коробки", 3,},
			},
		},
		[3] = {
			["Line"] = [[Внутри много разных материалов. Их разность может озадачить зоркий глаз. Этого достаточно, дабы забрать всю посылку.]],
			["Sound"] = "",
			["Answers"] = {
				{"Вытащить материалы из коробок", 4,},
			},
		},
		[4] = {
			["Line"] = [[Нужно торопиться - полиция входит позади. Главное не забыть забрать материалы!]],
			["Sound"] = "",
			["Answers"] = {
				{"Убрать материалы в отдельный ящик и закрыть коробки", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["crate3"] = {
	name = "Манифест",
	model = "models/hunter/blocks/cube05x075x025.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	submat = {
		[0] = "null"
	},
	pos = {},
	bgr = {},
	questNPC = false,
	sequence = "",
	uselimit = false,
	skin = 1,
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[На доске висит множество планшетов. Обычному человеку искать среди них нечего.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[На доске висит множество планшетов. Один из них отсылается на недавние поставки в порт через корабль. Может, там есть важные записи?]],
			["Sound"] = "",
			["Answers"] = {
				{"Читать дальше", 3,},
			},
		},
		[3] = {
			["Line"] = [[Сколько бы строки ни читались, сколько бы шифры ни проверялись - там нет ничего подозрительного, явного или банального. Трогать манифест - пустая трата времени, как оказалось.]],
			["Sound"] = "",
			["Answers"] = {
				{"Положить планшет на место", 4,},
			},
		},
		[4] = {
			["Line"] = [[На большее времени нет - через главную складскую дверь уже входит полиция.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["crate4"] = {
	name = "Ящик",
	model = "models/hunter/blocks/cube05x1x05.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Ящик с инструментами широкого спектра. Обслужит любую машину.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Ящик с инструментами широкого спектра. Обслужит любую машину. Не только дорожную.]],
			["Sound"] = "",
			["Answers"] = {
				{"Копаться в инструментах", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Инструменты разделены на разные комплекты. 'Ключ' к разгадке скрывается со своими 'братьями'.]],
			["Sound"] = "",
			["Answers"] = {
				{"Забрать красный комплект", 5,},
				{"Забрать зелёный комплект", 6,},
				{"Забрать серый комплект", 7,},
				{"Забрать все инструменты", 4,},
			},
		},
		[4] = {
			["Line"] = [[Наборы слишком тяжёлые, чтобы забрать их все. Придётся играть по чужим правилам.]],
			["Sound"] = "",
			["Answers"] = {
				{"Забрать красный комплект", 5,},
				{"Забрать зелёный комплект", 6,},
				{"Забрать серый комплект", 7,},
			},
		},
		[5] = {
			["Line"] = [[Точно красный?]],
			["Sound"] = "",
			["Answers"] = {
				{"Забрать красный комплект", "MQS Continue quest",},
				{"Вернуться к инструментам", 8,},
			},
		},
		[6] = {
			["Line"] = [[Точно зелёный?]],
			["Sound"] = "",
			["Answers"] = {
				{
					"Забрать зелёный комплект", {
						id = "MQS Skip to",
						data = {
							id = 30,
							quest_id = "chapter2_criminal_2"
						}
					}
				},
				{"Вернуться к инструментам", 8,},
			},
		},
		[7] = {
			["Line"] = [[Точно серый?]],
			["Sound"] = "",
			["Answers"] = {
				{
					"Забрать серый комплект", {
						id = "MQS Skip to",
						data = {
							id = 30,
							quest_id = "chapter2_criminal_2"
						}
					}
				},
				{"Вернуться к инструментам", 8,},
			},
		},
		[8] = {
			["Line"] = [[Инструменты послушно ждут вашего выбора.]],
			["Sound"] = "",
			["Answers"] = {
				{"Забрать красный комплект", 5,},
				{"Забрать зелёный комплект", 6,},
				{"Забрать серый комплект", 7,},
				{"Забрать все инструменты", 4,},
			},
		},
	}
}

MCS.Spawns["phone_criminal"] = {
	name = "Телефон",
	model = "models/props_trainstation/payphone001a.mdl",
	namepos = 80,
	theme = "Phone",
	scale = 1,
	questNPC = false,
	pos = {
		["rp_southside_noire"] = {Vector(-280.22021484375, 4205.5498046875, -9187.23828125), Angle(0, -176.71650695801, 0)},
	},
	sequence = "",
	uselimit = false,
	ignore = true,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		-- PIMP
		[1] = {
			["Line"] = [[Дело сделано?]],
			["Sound"] = "",
			["Answers"] = {
				{"Меня видели.", 2,},
			},
		},
		[2] = {
			["Line"] = [[Ты мозги Сутенёру-по-Имени-Прилизанный не еби - это дело шлюх. Твоё дело другое - оно сделано?!]],
			["Sound"] = "",
			["Answers"] = {
				{"Да.", 3,},
				{"Это не имеет значения.", 3,},
			},
		},
		[3] = {
			["Line"] = [[...]],
			["Sound"] = "",
			["Answers"] = {
				{"...", 4,},
				{"Они сразу-", 4,},
			},
		},
		[4] = {
			["Line"] = [[Мож не говорить, Сутенёр-по-Имени-Прилизанный обо всём знает. Плохи дела..]],
			["Sound"] = "",
			["Answers"] = {
				{"Какого хера они вообще открыли огонь?", 5,},
			},
		},
		[5] = {
			["Line"] = [[Важен не факт стрельбы как неправмерность - важен сам факт стрельбы. Нам не нужны лишние разбиратьсва. А с неубранными вовремя обстоятьсвами.. пиздец нам. Оправдают их.]],
			["Sound"] = "",
			["Answers"] = {
				{"И что делать?", 6,},
			},
		},
		[6] = {
			["Line"] = [[Надо было иначе действать. Поздно. Думать надо, думать..]],
			["Sound"] = "",
			["Answers"] = {
				{
					"Я позвоню позже.", {
						id = "MQS StoreData",
						data = {
							id = "count",
							info = 1,
							quest_id = "chapter2_criminal_1"
						},
					}
				},
			},
		},
		[7] = {
			["Line"] = [[Дело сделано?]],
			["Sound"] = "",
			["Answers"] = {
				{"Сделано.", 8,},
			},
		},
		[8] = {
			["Line"] = [[Товар у тебя?]],
			["Sound"] = "",
			["Answers"] = {
				{"Нет. Говорю же - дело сделано.", 9,},
			},
		},
		[9] = {
			["Line"] = [[Да ты- ..Кому сказали- ..Блять, ладно. Мож не такая плохая идея.]],
			["Sound"] = "",
			["Answers"] = {
				{"Посмотрим. Главное - меня не видели.", 10,},
			},
		},
		[10] = {
			["Line"] = [[Да это.. вообще, хорошо. Но недостаточно. Думать надо, думать..]],
			["Sound"] = "",
			["Answers"] = {
				{"Я позвоню позже.", "MQS Continue quest",},
			},
		},
		[11] = {
			["Line"] = [[Дело сделано?]],
			["Sound"] = "",
			["Answers"] = {
				{"Нет.", 12,},
			},
		},
		[12] = {
			["Line"] = [[Нигга ты-ту-пой? Чё ты тогда звонишь? Куда это время потеряно?]],
			["Sound"] = "",
			["Answers"] = {
				{"На манифест.", 13,},
			},
		},
		[13] = {
			["Line"] = [[Чего?]],
			["Sound"] = "",
			["Answers"] = {
				{"Манифест, говорю. Заметки, зацепки. Статус груза.", 14,},
			},
		},
		[14] = {
			["Line"] = [[И чё?]],
			["Sound"] = "",
			["Answers"] = {
				{"Ноль. Пусто. Время потеряно.", 6,},
			},
		},
		-- TECHNINE
		[15] = {
			["Line"] = [[Йоу, босс, я сегодня не выйду. Приболел чё-то.]],
			["Sound"] = "",
			["Answers"] = {
				{"Тех Найн?", 16,},
			},
		},
		[16] = {
			["Line"] = [[А? Мэн, кто звонит?]],
			["Sound"] = "",
			["Answers"] = {
				{"Расслабься, я сейчас решаю твою проблему.", 17,},
			},
		},
		[17] = {
			["Line"] = [[Сука-а-а.. Ма-фака, меня подставили!]],
			["Sound"] = "",
			["Answers"] = {
				{"Никто тебя не подставил, я от сутенёра.", 18,},
			},
		},
		[18] = {
			["Line"] = [[Мне никто не говорил про копа!]],
			["Sound"] = "",
			["Answers"] = {
				{"Не говори лишнего. Это телефон.", 19,},
			},
		},
		[19] = {
			["Line"] = [[Ух бля.. Решаешь мою проблему, говоришь? ..Я оставил свои тулы на рабочем месте. Избавься от них, йоу! Я туда больше не сунусь, мэн!]],
			["Sound"] = "",
			["Answers"] = {
				{"Хорошо.", 20,},
				{"Какие инструменты?", 22,},
				{"Так, подожди. Где мне их искать?", 25,},
			},
		},
		[20] = {
			["Line"] = [[Спасибо, от души йоу!]],
			["Sound"] = "",
			["Answers"] = {
				{"..Алло?", 21,},
				{"Эй, не сбрасывай!", 21,},
				{"Где твои инструменты?", 21,},
			},
		},
		[21] = {
			["Line"] = [[...]],
			["Sound"] = "",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Алло?", "MQS Continue quest",},
			},
		},
		[22] = {
			["Line"] = [[Бля-я-ять, они же не подписаны! Чё делать, чё делать..?]],
			["Sound"] = "",
			["Answers"] = {
				{"Успокойся. Они как-то помечены?", 23,},
				{"Как ты определяешь свои от чужих?", 23,},
				{"Забей, разберусь самостоятельно.", "MQS Continue quest",},
			},
		},
		[23] = {
			["Line"] = [[Помечены они, помечены.. Кровью моей отмечены. Я когда варился в проводах - меня ёбом токнуло. ..Блять, кровь на красном же не заметно!]],
			["Sound"] = "",
			["Answers"] = {
				{"У тебя красные инструменты?", 24,},
			},
		},
		[24] = {
			["Line"] = [[..Блять, у ма-факеров же форензика - всё найдут, всех найдут! ..Я по съёбам.]],
			["Sound"] = "",
			["Answers"] = {
				{"..Алло?", 21,},
				{"Эй, не сбрасывай!", 21,},
				{"Где твои инструменты?", 21,},
			},
		},
		[25] = {
			["Line"] = [[Там большой технический ящик, в нём наборы все держат. ..Бля-я-ять, они же не подписаны! Чё делать, чё делать..?]],
			["Sound"] = "",
			["Answers"] = {
				{"Успокойся. Они как-то помечены?", 23,},
				{"Как ты определяешь свои от чужих?", 23,},
				{"Забей, разберусь самостоятельно.", "MQS Continue quest",},
			},
		},
		-- PIMP 2
		[26] = {
			["Line"] = [[Это кто?]],
			["Sound"] = "",
			["Answers"] = {
				{"Замена Тех Найна.", 27,},
			},
		},
		[27] = {
			["Line"] = [[Нигга не-го-ни! Сутенёр-по-Имени-Прилизанный в курсе где сейчас Найн - и он не в допросной свидетьсвать против себя!]],
			["Sound"] = "",
			["Answers"] = {
				{"С ним всё в порядке?", 28,},
				{"Фух..", 28,},
			},
		},
		[28] = {
			["Line"] = [[Да. Похоже пешка Дезза не оставила никаких следов.]],
			["Sound"] = "",
			["Answers"] = {
				{"Имей уважение. Я делаю за вас всю работу.", 29,},
			},
		},
		[29] = {
			["Line"] = [[Не забывай своё место. Полезность не отменяет твой статус.]],
			["Sound"] = "",
			["Answers"] = {
				{"Мне заплатят?", 30,},
				{"Когда это закончится?", 30,},
			},
		},
		[30] = {
			["Line"] = [[Жди. Надо дать огню потухнуть.]],
			["Sound"] = "",
			["Answers"] = {
				{"Понятно.", "MQS Continue quest",},
			},
		},
		[31] = {
			["Line"] = [[Нигга о-ху-ел? Тех Найн в отличие от сучек подаётся в едином экземпляре - и как он сам себя заменит из тюрьмы?]],
			["Sound"] = "",
			["Answers"] = {
				{"Из тюрьмы?", 32,},
			},
		},
		[32] = {
			["Line"] = [[Нигга ты-ту-пой? Копы нашли что-то на Найна, нашли самого Найна, и щас они мило беседуют в допросной. Молись чтоб он нас не спалил!]],
			["Sound"] = "",
			["Answers"] = {
				{
					"С его паникой..", {
						id = "MQS StoreData",
						data = {
							id = "tech",
							info = 1,
							quest_id = "chapter2_criminal_2"
						},
					}
				},
			},
		},
		[33] = {
			["Line"] = [[Чё?!]],
			["Sound"] = "",
			["Answers"] = {
				{"Бездомный докопался.", 34,},
				{"Не тебе.", 34,},
			},
		},
		[34] = {
			["Line"] = [[Нигга, таким как ты Бог дарует зависьмость от сучек.]],
			["Sound"] = "",
			["Answers"] = {
				{"Это значит 'до встречи'?", 35,},
			},
		},
		[35] = {
			["Line"] = [[Пережди бурю и возвращайся, пешка.]],
			["Sound"] = "",
			["Answers"] = {
				{
					"Ага.", {
						id = "MQS StoreData",
						data = {
							id = "count",
							info = 1,
							add = true,
							quest_id = "chapter2_criminal_2"
						},
					}
				},
			},
		},
		[36] = {
			["Line"] = [[Это кто?]],
			["Sound"] = "",
			["Answers"] = {
				{"Замена Тех Найна.", 31,},
			},
		},
		-- SLIM SHADY
		[37] = {
			["Line"] = [[Стой где стоишь. Нам надо поговорить.]],
			["Sound"] = "",
			["Answers"] = {
				{"Это кто?", 38,},
			},
		},
		[38] = {
			["Line"] = [[Слим, кто-ж ещё?]],
			["Sound"] = "",
			["Answers"] = {
				{"Нихуя себе, у тебя телефон есть? А чего мы тогда через Дезза всё?", 44,},
				{"Я не могу сейчас разговаривать.", 39, function() end, function() return MQS.GetSData(nil, "mcs.bold", 0) == 0 end},
				{"Я щас убираюсь за боссом, не могу говорить.", 42, function() end, function() return MQS.GetSData(nil, "mcs.bold", 0) > 0 end},
			},
		},
		[39] = {
			["Line"] = [[Я как раз щас по твоей хуйне звоню, ёпта!]],
			["Sound"] = "",
			["Answers"] = {
				{"И?", 40,},
			},
		},
		[40] = {
			["Line"] = [[Хуи, блять. Ничего не делай. Дезз разбирается.]],
			["Sound"] = "",
			["Answers"] = {
				{"То есть мне никуда не дуть?", 41,},
			},
		},
		[41] = {
			["Line"] = [[Ля, дуй чё хочешь и кому хочешь - а ехать придётся, щас же. Я те лично объясню уже на месте.]],
			["Sound"] = "",
			["Answers"] = {
				{"Тогда до встречи.", "MQS Continue quest",},
			},
		},
		[42] = {
			["Line"] = [[Я знаю - поэтому и звоню. Кажется ты уже понимаешь как мы работаем.]],
			["Sound"] = "",
			["Answers"] = {
				{"Ты о чём?", 43,},
			},
		},
		[43] = {
			["Line"] = [[О равности, ёпт. Не эта гейская хуйня, а о.. как оно там.. демократия, во. Продолжай ставить на место охуевших - боссу такой подход нравится. В смысле Деззу.]],
			["Sound"] = "",
			["Answers"] = {
				{"Ты не за этим звонишь.", 44,},
			},
		},
		[44] = {
			["Line"] = [[Да. Едь на место, но ничего не делай. Дезз сказал.]],
			["Sound"] = "",
			["Answers"] = {
				{"Он заодно за эту хуйню? Да ну нахуй..", "MQS Continue quest",},
			},
		},
		[44] = {
			["Line"] = [[Как ты блять думаешь? Мозг у операции один, а пальцев - много.]],
			["Sound"] = "",
			["Answers"] = {
				{"Я не могу сейчас разговаривать.", 39, function() end, function() return MQS.GetSData(nil, "mcs.bold", 0) == 0 end},
				{"Я щас убираюсь за боссом, не могу говорить.", 42, function() end, function() return MQS.GetSData(nil, "mcs.bold", 0) > 0 end},
			},
		},
	}
}