--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/misc_letter_car.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["misc_letter_car"] = {
	name = "Записка",
	model = "models/props_lab/clipboard.mdl",
	namepos = 80,
	theme = "Retro",
	noinfo = true,
	scale = 1,
	questNPC = false,
	pos = {},
	submat = {
		[0] = "gbskins/clip_dirty"
	},
	sequence = "idle",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Этот кусок бумаги сильно отличается от остального Бруклинского мусора. Однако, это всё ещё мусор.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Этот кусок бумаги сильно отличается от остального Бруклинского мусора. Её мог оставить Лил Вэйн.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прочитать записку", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Записка в основном состоит из бессвязного набора букв. Эта бессмыслица очень похожа на какой-то шифр. Возможно, его получится разгадать прямо на месте.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать шестнадцатеричный код", 4,},
				{"Попробовать шифр Цезаря", 7,},
				{"Попробовать разбить алфавит на квадраты", 9,},
				{"Отложить бумагу в сторону", "close",},
			},
		},
		[4] = {
			["Line"] = [[В тексте изначально не присутствало никаких цифр, однако набор букв легко перешёл в другое 'агрегатное состояние'. Результату точно чего-то не хватает.]],
			["Sound"] = "",
			["Answers"] = {
				{"Перевести результат в двоичный код", 5,},
				{"Попробовать шифр Цезаря", 6,},
				{"Попробовать разбить алфавит на квадраты", 6,},
				{"Начать сначала", 11,},
			},
		},
		[5] = {
			["Line"] = [[Нули и единицы имеют даже меньше смысла, чем иная криптография. Может, стоит попробовать другой метод?]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать шифр Цезаря", 7,},
				{"Попробовать разбить алфавит на квадраты", 9,},
			},
		},
		[6] = {
			["Line"] = [[Это точно сюда не подойдёт. Вряд ли к такой комбинации криптографических методов вообще что-то подойдёт. Может, стоит начать с чего-то другого?]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать шестнадцатеричный код", 4,},
				{"Попробовать шифр Цезаря", 7,},
				{"Попробовать разбить алфавит на квадраты", 9,},
			},
		},
		[7] = {
			["Line"] = [[Сам по себе метод Цезаря вряд ли принесёт какие-то плоды, ведь так решено лишь полбеды. Вне зависимости от взятого промежутка для 'сдвига', нужно сделать что-то ещё. Только вот, что?]],
			["Sound"] = "",
			["Answers"] = {
				{"Перевести результат в двоичный код", 5,},
				{"Очистить результат от лишнего", 8,},
				{"Попробовать разбить алфавит на квадраты", 6,},
				{"Начать сначала", 11,},
			},
		},
		[8] = {
			["Line"] = [[Солянка из случайных букв никак ни во что не собирается. Если и следовать методике Римского автократа, то уж точно не с самого начала.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать шестнадцатеричный код", 4,},
				{"Попробовать разбить алфавит на квадраты", 9,},
			},
		},
		[9] = {
			["Line"] = [[Буквы послушно сложились в ровные квадраты, как какие-то солдаты. Они ожидают дальнейшей команды - дальнейшей расшифровки.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать двоичный код", 5,},
				{"Попробовать шифр Цезаря", 12,},
				{"Исключать наборы букв, пока что-нибудь не случится", 10,},
				{"Начать сначала", 11,},
			},
		},
		[10] = {
			["Line"] = [[Что по отдельности, что вместе - алфавитная матрица и в Африке останется матрицей. Постоянные взаимодействия с запиской оставляют всё меньше сомнений - это не тот ход. Как минимум, безостановочные вычисления портят бумагу.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать двоичный код", 5,},
				{"Попробовать шифр Цезаря", 12,},
				{"Начать сначала", 11,},
			},
		},
		[11] = {
			["Line"] = [[Записка никуда не убежит. У неё есть всё время на этом свете. У неё есть все ответы.]],
			["Sound"] = "",
			["Answers"] = {
				{"Попробовать шестнадцатеричный код", 4,},
				{"Попробовать шифр Цезаря", 7,},
				{"Попробовать разбить алфавит на квадраты", 9,},
				{"Отложить бумагу в сторону", "close",},
				{"Сдаться и порвать бумагу", "MQS Fail quest",},
			},
		},
		[12] = {
			["Line"] = [[От перестановки слагаемых сумма не меняется. Однако, от перестановки точно заиграет восприятие. Чёткое разделение на столбцы позволило беспрепятственно двигать целые ряды, а нужное сообщение само пришло на вид сквозь строки.

'Стоянка у улицы Плезант'.]],
			["Sound"] = "",
			["Answers"] = {
				{"Забрать записку с собой и последовать дальше", "MQS Continue quest",},
			},
		},
		[13] = {
			["Line"] = [[Вторая записка отличается не только от привычного всем мусора, но и от первого письма. Самое большое первичное отличие - почерк.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прочитать записку", 14,},
				{"Отойти", "close",},
			},
		},
		[14] = {
			["Line"] = [[Второе большое отличие - шифр. Он присутствует, только его примитивность никак не сходится с тем, с чего всё начиналось. Как будто этого клочок бумаги хочет, чтобы его разгадали.]],
			["Sound"] = "",
			["Answers"] = {
				{"Применить шифр Цезаря", 15,},
			},
		},
		[15] = {
			["Line"] = [[Дальнейшие попытки разгадать послание лишь сильнее то подтвердили. Буквы сразу же сложились в фразу: 'Стоянка у шоссе'. У больших дорог Бруклина их две. Кажется, стоит проверить обе.]],
			["Sound"] = "",
			["Answers"] = {
				{"Забрать записку с собой и последовать дальше", "MQS Continue quest",},
			},
		},
		[16] = {
			["Line"] = [[Третья бумажка очень сильно похожа на первую. Почти что копия, явно сделанная наспех. Или криво скопированная.]],
			["Sound"] = "",
			["Answers"] = {
				{"Взяться за расшифровку, как в первый раз", 17,},
			},
		},
		[17] = {
			["Line"] = [[Вышел тот же результат, с небольшим дополнением - 'Стоянка у улицы Плезант. Седан.'. Это послание точно делал первый отправитель - детали так и намекают. А интуиция не замолкает.]],
			["Sound"] = "",
			["Answers"] = {
				{"Забрать записку с собой и последовать дальше", "MQS Continue quest",},
			},
		},
	}
}