--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/misc_letter_strange.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["misc_letter_strange"] = {
	name = "Планшет",
	model = "models/props_lab/clipboard.mdl",
	namepos = 80,
	theme = "Retro",
	noinfo = true,
	scale = 1,
	questNPC = false,
	pos = {},
	submat = {
		[0] = "gbskins/clip_dirty"
	},
	sequence = "idle",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Этот кусок бумаги сильно отличается от остального Бруклинского мусора. Однако, это всё ещё мусор.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Только офицер полиции найдёт что-то знакомое в этом планшете, ибо подобные документы очень похожи на полицейский рапорт. Или на форму для сдачи улик.]],
			["Sound"] = "",
			["Answers"] = {
				{"Просмотреть бумаги внимательнее", 3,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[На удивление, на планшете закреплены все данные о каком-то гражданине, какие только можно себе представить. Одна из его наиболее известных уличных 'кличек' - Лил Вэйн.]],
			["Sound"] = "",
			["Answers"] = {
				{"Все данные?", 4,},
			},
		},
		[4] = {
			["Line"] = [[Вообще все. Места жительства, автомобили, отпечатки пальцев, различные пояснения и подробный план налёта на этот самый магазин. Как будто его подставили. Или заставили сознаться.]],
			["Sound"] = "",
			["Answers"] = {
				{"Аккуратно разложить улики по пакетам", "MQS Continue quest",},
			},
		},
	}
}