--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/police_commissioner_all.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["police_commissioner_all"] = {
	name = "Джона Колдуэлл",
	desc = "'Комиссар'",
	model = "models/cityrp/pm/nypd/male_08.mdl",
	n_icon = Material("ranks_ui/icons/nypd/sgt.png", "smooth"),
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = true,
	pos = {
		--["rp_southside_noire"] = {Vector(8741.0625,8735.15625,289), Angle(0,178,0)},
		["rp_southside_noire"] = {Vector(8630.884765625,8820,288.03189086914), Angle(0,-90,0)},
	},
	sequence = "idle_to_lean_back",
	uselimit = true,
	skin = 1,
	bgr = {[1] = 0,[2] = 2,[5] = 1,},
	ClModels = {
		{ model = "models/cityrp/nypd/badge_sgt.mdl", pos = Vector(5,-0.1,7.25), ang = Angle(0,150,60), bone = 4},
		{ model = "models/props_lab/clipboard.mdl", pos = Vector(10,0,-1), ang = Angle(-10,-1,-90), bone = 11},
	},
	submat = {
		[0] = "gbskins/story/comissar",
		[9] = "models/gmodbest/acc/rank2",
		[11] = "models/gmodbest/acc/hash/4",
		[19] = "models/gmodbest/acc/hat_02"
	},
	teams = {
		[4] = 48,
		[5] = 48,
		[6] = 48,
		[7] = 48,
		[19] = 48,
		[15] = 48,
	},
	dialogs = {
-- CIVILIAN	
		[1] = {
			["Line"] = [[Слушаю вас.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/1.mp3",
			["Animation"] = "lean_back_to_idle",
			["Answers"] = {
				{"Здравствуйте. Это вы тот известный комиссар?", 2},
				{"Здравствуйте. Как обстоит ситуация с нелегалом на улицах?", 17},
				{"Прошу прощения.", "close",},
			},
		},
		[2] = {
			["Line"] = [[Не комиссар, а сержант. Сержант Джона. Лондонеры не часто тут встречаются, оттуда и прозвище. Если это всё, то прошу вас пожалуйста покинуть офис. У нас много работы.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/2.mp3",
			["Answers"] = {
				{"Как обстоит ситуация с нелегалом на улицах?", 17, nil, function()
					return not LocalPlayer():isCP()
				end},
				{"Прошу прощения.", "close", nil, nil, "idle_to_lean_back"},
			},
		},
-- QUEST 1		
		[3] = {
			["Line"] = [[Слушаю вас.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/3.mp3",
			["Animation"] = "lean_back_to_idle",
			["Answers"] = {
				{"Добрый день. Это вы тот известный комиссар?", 4},
				{"Добрый день. Меня вроде как перевели к вам, да?", 14},
				{"Я теперь с вами. Давайте работать.", 15},
				{"Прошу прощения.", "close"},
			},
		},
		[4] = {
			["Line"] = [[Не комиссар, а сержант. Сержант Джона. Лондонеры не часто тут встречаются, оттуда и прозвище; у нас такого звания нет. А вы зарекомендовавший себя офицер, не так ли? Приятно познакомиться.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/4.mp3",
			["Answers"] = {
				{"Взаимно.", 5,},
				{"Не далеко ли вы от дома? Штаты, как-никак.", 11,},
				{"Вам не пора на пенсию? Возраст, как-никак.", 11,},
				{"Перейдём к делу?", 5,},
			},
		},
		[5] = {
			["Line"] = [[Вы ведь в курсе, что приблизило ваш 'успех'? Смелость. Наглый подход. Настоящая деятельность, а не имитация. То, что товарищ Хогстон произносит скрипя зубы. То, что в полиции и поощряется, и наказывается. Ведь то не по протоколу.

Вас я взял тоже вне соответствии с протоколом. По званию я не могу делать и половины того, что в итоге позволило этому участку увеличить финансирование впервые за годы. Однако, один из прошлых капитанов увидел пользу в моём подходе, и никто с тех пор не пытается оспаривать эти решения.

От вас я ожидаю не прямого повиновения, а здоровых рабочих отношений.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/5.mp3",
			["Answers"] = {
				{"Наконец-то. Именно этого полиции и не хватает.", 6,},
				{"Всё-таки, у нас действительно всё очень плохо, раз это должно упоминаться. Ещё и в такой форме.", 6,},
				{"Как насчёт перейти к задаче, а не вечно болтать?", 7,},
			},
		},
		[6] = {
			["Line"] = [[Увы. Если я что за всю свою жизнь и понял, так это то, что механизация ни к чему хорошему не приводит. Преступления совершаются с человеческим фактором, и раскрываются с ним же. Так почему мы должны создавать эту монотонность? Чем мы отличаемся от обычных гангстеров?]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/6.mp3",
			["Answers"] = {
				{"То, что мы на стороне закона, а закон на нашей стороне?", 8,},
				{"То, что мы можем исправиться, если согрешим?", 8,},
				{"Образование? Технологии? Возможности?", 8,},
				{"Ничем.", 9,},
			},
		},
		[7] = {
			["Line"] = [[Как скажете. Разговоры тоже могут много чего принести в работу. Тебя же что-то побудило нажаловаться капитану? А чем ты с таким подходом отличаешься от товарища Хогстона? Подумай над этим.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/7.mp3",
			["Answers"] = {
				{"Вы правы. Прошу прощения. Перейдём к делу?", 16,},
				{"Не вижу параллелей. В любом случае, продолжим?", 16,},
				{"Мой характер хотя бы оправдывается работой, а не имитацией. Как насчёт как раз поработать?", 16,},
			},
		},
		[8] = {
			["Line"] = [[Нет. Будь у нас хоть какая-то разница, то перевес бы чувствовался. Наши бойцы умирают на улицах - их 'капо' тоже умирают. Они строят грандиозные планы - а мы сооружаем не менее прекрасные перехваты. Они грабят - и мы грабим. Налогами.

Не говоря уже о том, что некоторые документы и слова ставят таких подлецов выше судов. Сначала по норам прятались они, а теперь прячемся мы. Чем этот офис - не кроличья нора? Единственное, что иное - комфорт. И вот он уже способствует изменениям.

Начинать нужно с себя.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/8.mp3",
			["Answers"] = {
				{"С чего начнём мы?", 10,},
			},
		},
		[9] = {
			["Line"] = [[Именно. Правосудие слепо. Бумаги встают на любую сторону. Похороны встречают обе половины города. Посмотри на офицеров - на того же Джимми Шаклза. Монотонность превратит его рано или поздно в Хогстона. Только от нас зависит, случится то или нет.

'Хочешь изменить мир - начни с себя'. Начни улыбаться, и улыбнутся в ответ. Мы принесём радость и компромисс, и удовлетворительный компромисс коснётся нас. Вот, чем мы отличаемся. Нас будут ставить в пример. Того же Робин Гуда - нет.

И начинать нужно с себя.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/9.mp3",
			["Answers"] = {
				{"С чего начнём мы?", 10,},
			},
		},
		[10] = {
			["Line"] = [[Со знакомства. Вас я уже знаю, меня вы тоже немного знаете. Этого достаточно для начала и работы, обменяться любезностями ещё успеем. Однако, ваш партнёр по поручениям вас не знает, а вы не знаете её. Пора это исправлять. Офицер Вульф ждёт вас в гараже.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/10.mp3",
			["Answers"] = {
				{"Хорошо. Пойду поговорю с ней.", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"'Её'? Я буду работать с девушкой?", 12,},
				{"Партнёр по поручениям? Тут есть какая-то разница?", 13,},
			},
		},
		[11] = {
			["Line"] = [[Что ни случись - к лучшему. Я нужнее тут, чем по ту сторону. Наша работа никогда не заканчивается; нам отдых лишь в гробу виден, к сожалению. По крайней мере, пока мы не возьмём себя в руки - пока не начнём с себя. Когда вам последний раз улыбался консультант в магазине? А вы ему?

Это риторический вопрос, если что. 'Относись к другу так, как хочешь, чтобы он относился к тебе'. Понимаете, к чему я веду?]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/11.mp3",
			["Answers"] = {
				{"Да.", 5,},
				{"Наверное.", 5,},
				{"Нет.", 5,},
			},
		},
		[12] = {
			["Line"] = [[Да. Не бойся, она может за себя постоять. По характеру вы схожи; дерзость с рвением окрыляют и отделяют вас от массы. Вы поладите.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/12.mp3",
			["Answers"] = {
				{"Хорошо. Пойду поговорю с ней.", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Партнёр по поручениям? Тут есть какая-то разница?", 13,},
			},
		},
		[13] = {
			["Line"] = [['Поручения' и патруль так же относятся друг к другу, как обычные офицеры к детективам. Капитаны могут как-то возразить от совместной работы двух личностей на постоянной основе, однако они не имеют права что-то сказать в экстраординарных ситуациях. Это уже не их департамент. 

..Каламбур случайно вышел. А вас я выбрал не случайно. Вы идеально сольётесь и решите тысячу дел. Эта молодость, энергия.. Кхм, прошу прощения.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/13.mp3",
			["Answers"] = {
				{"Хорошо. Пойду поговорю с ней.", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"'Её'? Я буду работать с девушкой?", 12,},
			},
		},
		[14] = {
			["Line"] = [[И да, и нет. Я не держу никакой отдел - меня лишь слушали многие сменившиеся капитаны этого участка. В молодости, я зарекомендовал себя в Лондоне. Теперь - тут. Мы в этом плане похожи. Сержант Джона. Приятно познакомиться, офицер.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/14.mp3",
			["Answers"] = {
				{"Взаимно.", 5,},
				{"Не далеко ли вы от дома? Штаты, как-никак.", 11,},
				{"Вам не пора на пенсию? Возраст, как-никак.", 11,},
				{"Перейдём к делу?", 5,},
			},
		},
		[15] = {
			["Line"] = [[Дерзко, грубо, большая спешка.. Мне нравится. Сержант Джона. Приятно познакомиться.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/15.mp3",
			["Answers"] = {
				{"Взаимно.", 5,},
				{"Вам не пора на пенсию? Возраст, как-никак.", 11,},
				{"Перейдём к делу?", 5,},
			},
		},
		[16] = {
			["Line"] = [[Конечно. Всему своё время. ..Вам вот пришло время познакомиться. Вам и вашему напарнику по поручениям. Вас я уже знаю, меня вы тоже немного знаете. Этого достаточно для начала и работы. Однако, ваш партнёр по поручениям вас не знает, а вы не знаете её. Пора это исправлять. Офицер Вульф ждёт вас в гараже.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/16.mp3",
			["Answers"] = {
				{"Хорошо. Пойду поговорю с ней.", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"'Её'? Я буду работать с девушкой?", 12,},
				{"Партнёр по поручениям? Тут есть какая-то разница?", 13,},
			},
		},
-- CIVILIAN (забыл в начале добавить, теперь оно тут)		
		[17] = {
			["Line"] = [[..Вы репортёр? Наш департамент давал официальное заявление по поводу растущего криминала. И чем больше вы спрашиваете об одном и том же - тем сильнее отвлекаете нас от его ликвидации. Если это всё, то прошу вас пожалуйста покинуть офис. У нас много работы.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/17.mp3",
			["Answers"] = {
				{"Это ведь вы тот известный комиссар?", 2,},
				{"Прошу прощения.", "close", nil, nil, "idle_to_lean_back"},
			},
		},
-- QUEST 2
		[18] = {
			["Line"] = [[Слушаю вас.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/18.mp3",
			["Animation"] = "lean_back_to_idle",
			["Answers"] = {
				{"Здравствуйте. Есть новости по нашему делу?", 19},
				{"Здравствуйте. У меня есть новости по делу.", 20},
				{"Прошу прощения.", "close"},
			},
		},
		[19] = {
			["Line"] = [[Да. Офицер Вульф рассказала мне о ваших находках. Конечно, без явных ярких подробностей, хоть и этого достаточно дабы сделать выводы.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/19.mp3",
			["Answers"] = {
				{"Отлично. Какой дальнейший план действий?", 27,},
				{"Могу рассказать подробнее.", 20,},
			},
		},
		[20] = {
			["Line"] = [[Да?]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/20.mp3",
			["Answers"] = {
				{"В квартире подозреваемого стоял жучок.", 21,},
				{"В квартире подозреваемого стоял жучок. Мы поставили второй.", 23,},
				{"Мы поставили жучок в квартиру подозреваемого.", 22,},
				{"..Не важно. Это какая-то мелочь.", 24,},
			},
		},
		[21] = {
			["Line"] = [[Вот как. Любопытно.. Это без всяких сомнений противозаконно - и вы сделали правильное решение, наведавшись к 'клиенту'. Этот подозреваемый очень важен, и Вульф собрала прекрасную модель действий. Хорошая работа на фронте.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/21.mp3",
			["Answers"] = {
				{"Она придумала весь этот план?", 25,},
				{"Что дальше?", 27,},
			},
		},
		[22] = {
			["Line"] = [[Вот как. Любопытно.. Не самая законная авантюра, однако на войне все средства хороши. Не говоря уже о том, что ФБР делают то же самое прямо сейчас, и никто не протестует против них. Этот подозреваемый очень важен, и Вульф собрала прекрасную модель действий. Хорошая работа на фронте.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/22.mp3",
			["Answers"] = {
				{"Она придумала весь этот план?", 25,},
				{"Что дальше?", 27,},
			},
		},
		[23] = {
			["Line"] = [[Вот как. Любопытно.. Не самая законная авантюра, однако на войне все средства хороши. Вы очень вовремя наведались к нашему 'клиенту', раз застали такую улику. Этот подозреваемый очень важен, и Вульф собрала прекрасную модель действий. Хорошая работа на фронте.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/23.mp3",
			["Answers"] = {
				{"Она придумала весь этот план?", 25,},
				{"Что дальше?", 27,},
			},
		},
		[24] = {
			["Line"] = [[В самом деле? Всё начинается с мелочей. И что-то побудило тебя упомянуть эту 'мелочь'. Точно не хочешь об этом поговорить?]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/24.mp3",
			["Answers"] = {
				{"В самом деле. Что у нас дальше по плану?", 27,},
				{"..В квартире подозреваемого стоял жучок.", 21,},
				{"..В квартире подозреваемого стоял жучок. Мы поставили второй.", 23,},
				{"..Мы поставили жучок в квартиру подозреваемого.", 22,},
			},
		},
		[25] = {
			["Line"] = [[Да. Очень способный полицейский. Ещё более способный детектив. Никогда не любила обычный патруль и лезла во все остальные отрасли, какие только есть. Предпочитает даже убираться в изоляторах, нежели брать какую-то рутину на свои плечи.

Если бы весь мир состоял из таких, как она.. Нет - половина мира - то история перестала бы повторять себя. Почему половина? Потому что кому-то нужно стоять на так называемом поле боя. И кому-то нужно заниматься бумагами. Тот же Хогстон так же важен, как и ты. Как я. Как многие другие.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/25.mp3",
			["Answers"] = {
				{"Мне не нравится, что она умалчивает так много деталей. Дела потеряют смысл, если единственный 'живой архив' исчезнет.", 26,},
				{"Мне нравится, что она умалчивает так много деталей. К ней никому не подобраться.", 26,},
				{"Что дальше?", 27,},
			},
		},
		[26] = {
			["Line"] = [['Проклятие и благословение в одном. Наивность и любопытство, не дающие взяться исключительно за точные указания. Противо-конформизм, следующий за какой-нибудь альтернативой. Внимательность и восприятие, видящие больше простых совпадений.'.

..Хорошее чтиво. Прекрасно напоминает о том, что есть другие люди. Такими как она невозможно управлять. Да и нужно ли? Такие как она не дадут себя в обиду, их не подкупить. Конечно, есть исключения, но.. давай не будем об этом. Закон Мёрфи. 'Что может случиться - случится'.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/26.mp3",
			["Answers"] = {
				{"Что дальше?", 27,},
			},
		},
		[27] = {
			["Line"] = [[Что-ж.. Это вам решать. Вульф не держит деталей своих расследуемых дел в участке - это общеизвестный факт. Предосторожность от всевозможных кротов и других коррумпированных зверей. Где она хранит все эти данные даже я не знаю. Хоть и знаю, что ответ есть в этом участке. Удачи.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/27.mp3",
			["Answers"] = {
				{"Хорошо..?", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Что это значит?", 28,},
				{"Не проще ли ей просто позвонить?", 29,},
			},
		},
		[28] = {
			["Line"] = [[Поищи детали в её офисе. Какие-нибудь записки, упоминания и так далее. Не в компьютере - слишком очевидно. Да и наша сеть часто взламывается.. Что только сильнее оправдывает её подход.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/28.mp3",
			["Answers"] = {
				{"Хорошо..?", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Не проще ли ей просто позвонить?", 29,},
			},
		},
		[29] = {
			["Line"] = [['Тот презираемый человеческий фактор проявлялся лишь в худшем его виде. Попытка узнать всё максимально точно, и только из якобы проверенных источников, не давала никаких надежд.'. Я рассказывал, как сильно она любит думать?

Чтобы остаться наедине со своими мыслями, Вульф отключает телефон и рацию. Когда ей нужно подкрепление, она тратит время на включение, представляешь? Пока что она оправдала такой подход.. Однако, всему своё время. К сожалению.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/29.mp3",
			["Answers"] = {
				{"Хорошо..?", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Где мне искать ответ по-человечески?", 28,},
			},
		},
-- QUEST 3
		[30] = {
			["Line"] = [[Слушаю вас.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/30.mp3",
			["Animation"] = "lean_back_to_idle",
			["Answers"] = {
				{"Здравствуйте. У меня есть новости по делу.", 31},
				{"Прошу прощения.", "close"},
			},
		},
		[31] = {
			["Line"] = [[Надеюсь, что-то существенное? Офицер Вульф уже получила за свою скрытность. От жизни, имею в виду.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/31.mp3",
			["Answers"] = {
				{"Только про неё. Она мне ничего не говорила.", 32,},
				{"Только про неё. Она всё хорошо шифрует.", 32,},
				{"Дело куда-то идёт, а куда - не понятно. Я будто курьером подрабатываю.", 33,},
				{"Дело куда-то идёт, а куда - не понятно. Лишь во время инцидента выяснилось одно имя - 'Прилизанный'.", 33,},
			},
		},
		[32] = {
			["Line"] = [[Так и знал. Что-ж, будет по вашему. Это дело в любом случае закрыто - вы взъерошили ночной клуб так сильно, что так называемый Сутенёр-по-Имени-Прилизанный сбежал. Он являлся частым гостем в том самом месте. Ваши авантюры заставили его усомниться в своей безопасности.

Это хорошо. Вы молодцы. Каждое криминальное лицо должно почувствовать, что нет бессмертных в этом мире. Правда, теперь нужно начинать сначала. Несмотря на наличие свежих следов, даже какая-нибудь пешка в виде Дезза не подпустит и намёк на копа к себе.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/32.mp3",
			["Answers"] = {
				{"Что это значит?", 34,},
			},
		},
		[33] = {
			["Line"] = [[Вот как.. Привычное дело для Вульф. Однако, несмотря на такие разногласия, вы хорошие партнёры. Пойми - не каждый посыльный способен поладить с таким архитипом. И я это говорю с учётом вашего провала. Ваши авантюры заставили так называемого Сутенёра-по-Имени-Прилизанный усомниться в своей неприкосновенности.

Это хорошо. Вы молодцы. Каждое криминальное лицо должно почувствовать, что нет бессмертных в этом мире. Правда, теперь нужно начинать сначала. Несмотря на наличие свежих следов, даже какая-нибудь пешка в виде Дезза не подпустит и намёк на копа к себе.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/33.mp3",
			["Answers"] = {
				{"Что это значит?", 34,},
			},
		},
		[34] = {
			["Line"] = [[Это значит, что пока вы можете отдыхать. Заниматься чем-то серьёзным нужно как минимум в паре с кем-то - а ставить под тебя кого-то ещё.. нецелесообразно. Для департамента, разумеется - лучше вас двоих пока попросту нет. Да и если-б кто был, то это нарушит строй.

Человеческий фактор. Его не искривить, пусть и легко наклонить.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/34.mp3",
			["Answers"] = {
				{"То есть, я могу идти?", 35,},
				{"Вы не злитесь? Прямо чувствую какие-то такие нотки.", 36,},
			},
		},
		[35] = {
			["Line"] = [[Почти. Тебя ждёт Вульф. Глупая умудрилась выписаться из больницы, так ещё и хочет вовсю скакать и смеяться. Аж улыбка выступает как думаю об этом оптимизме, хоть и в то же время - наоборот. Ты ведь знаешь, куда ей попали в перестрелке? Руки. А что человек сделает без рук? Вопрос риторический.

Не оторвало, и на том спасибо. Боязно, однако.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/35.mp3",
			["Answers"] = {
				{"Пойду поговорю с ней.", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Попробую убедить её использовать больничный по назначению.", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Как же хочется кое-кого прибить..", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
			},
		},
		[36] = {
			["Line"] = [[Нет. А за что злиться? Вы делаете свою работу - и делаете по-своему. Не всё всегда идёт по плану, и это нормально. Я нервничаю из-за Вульф, ведь вместо отдыха, она ждёт тебя у участка. Упоминала во время визита какое-то свидание.. Зная её - на него подписывалась лишь она сама.

Ей бы отдохнуть, в постели. Ты ведь знаешь, куда ей попали в перестрелке? Руки. А что человек сделает без рук? Вопрос риторический.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/36.mp3",
			["Answers"] = {
				{"Глупая. Пойду поговорю с ней.", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Попробую убедить её использовать больничный по назначению.", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Как же хочется кое-кого прибить..", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
			},
		},
		[37] = {
			["Line"] = [[Не надо ничего говорить, я уже знаю. Мы все знаем. Это не твоя вина, ты не при делах. 

Мне очень жаль..]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/37.mp3",
			["Answers"] = {
				{"...", 38,},
			},
		},
		[38] = {
			["Line"] = [[Ох, ну и времена настают.. Чёрные времена. Я бы даже сказал, нуарные. Слов нужных не набирается.. Тебе повезло, что с тобой всё хорошо.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/38.mp3",
			["Answers"] = {
				{"...", 39,},
				{"Можно без всего этого?", 39,},
				{"Ещё в клубе, Вульф сказала мне одну фразу. Теперь я понимаю её значение куда лучше. Много кто в этом городе замолкает из-за хаоса.", 40,},
			},
		},
		[39] = {
			["Line"] = [[Пожалуйста, отдохни. Не как она, а как следует. Мы постараемся разобраться в этом ужасе сами - ты заслуживаешь отдыха. Как только появится какая-то информация, то ты узнаешь об этом из первых уст.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/39.mp3",
			["Answers"] = {
				{"...", 44,},
				{"Хорошо. Спасибо.", 44,},
				{"Мне всё равно. Просто дайте в следующий раз в напарники кого-нибудь менее узколобого.", 44,},
				{"Её возможно подставили. Я не знаю кто, но это не совпадение. Это может быть 'Прилизанный'.", 46,},
			},
		},
		[40] = {
			["Line"] = [[Увы, этот хаос проявляется во всех смыслах. К сожалению, особенно в посмертном. Этот мир был создан не для неё. Мы не заслужили её.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/40.mp3",
			["Answers"] = {
				{"...", 39,},
				{"Это точно.", 39,},
				{"Может быть.", 39,},
				{"Она слишком избалованная. Она заслужила то, что получила.", 41,},
			},
		},
		[41] = {
			["Line"] = [[Низко так говорить про покойников. Ещё ниже - про друзей и партнёров.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/41.mp3",
			["Answers"] = {
				{"...", 39,},
				{"..Вы правы. Извините, нервы.", 39,},
				{"Она решала всё за меня. Ты решил поставить меня с ней. Это не партнёрство, а каторга.", 42,},
			},
		},
		[42] = {
			["Line"] = [[Ты говоришь точь в точь как она. Не захлёбываешься в иронии?]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/42.mp3",
			["Answers"] = {
				{"...", 39,},
				{"Хватит говорить учениями и строками из книг. Они не работают в реальной жизни.", 43,},
			},
		},
		[43] = {
			["Line"] = [[Почему? 'Если это другое, то почему оно так похоже?'. Раз не работают, то почему случилось то, что случилось? Я не хочу давить, однако это всего лишь первая из пяти стадий переживания. Попробуй побольше почитать в свободное время. Теперь его у тебя будет много.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/43.mp3",
			["Answers"] = {
				{"...", 39,},
			},
		},
		[44] = {
			["Line"] = [[А, и.. ещё кое-что. Проверь её офис. Это важно.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/44.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Хорошо.", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Надеюсь, там не ещё одна бомба?", 45,},
			},
		},
		[45] = {
			["Line"] = [[Плохая шутка.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/45.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Простите.", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
				{"Как скажешь.", "MQS Continue quest", nil, nil, "idle_to_lean_back"},
			},
		},
		[46] = {
			["Line"] = [[..Может быть. Всё может быть. Постарайся принять действительность, не занимайся лишним. Им займёмся мы.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/46.mp3",
			["Answers"] = {
				{"...", 44,},
				{"Хорошо.", 44,},
				{"Я хочу помочь!", 47,},
			},
		},
		[47] = {
			["Line"] = [[Пожалуйста, контролируй эмоции. За тебя говорит не твоя голова. Я ценю твоё рвение, однако.. Тебе стоит отдохнуть.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/47.mp3",
			["Answers"] = {
				{"...", 44,},
				{"Хорошо.", 44,},
			},
		},
-- POLICE (после первого квеста/можно и без этого, но обязательно копам.)  {id = "StartPoliceExam", data = { exam = "urban_sorting" }}
		[48] = {
			["Line"] = [[Слушаю вас.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/48.mp3",
			["Animation"] = "lean_back_to_idle",
			["Answers"] = {
				{"Здравствуйте. Это вы тот известный комиссар?", 2, nil, function()
					return not MQS.QuestStatusCheck("police_4_partner", LocalPlayer())
				end},
				{"Вы не против поговорить?", 50, nil, function()
					return MQS.QuestStatusCheck("police_4_partner", LocalPlayer())
				end},
				{"Как обстоит ситуация на улицах?", 49, nil, function()
					return MQS.QuestStatusCheck("police_4_partner", LocalPlayer())
				end},
				{"Я хочу начать экзамен.", "StartPoliceTest1", nil, function()
					return MRS.GetPlyRank(LocalPlayer(), "NYPD") == 1
				end},
				{"Я хочу пройти тест на знание принципов безопасного обращения с оружием.", {id = "StartPoliceExam", data = { exam = "GUN1" }}, nil, function()
					return MRS.GetPlyRank(LocalPlayer(), "NYPD") > 1 and not MRS.GetSData(nil, "exam_gun1")
				end},
				{"Я хочу пройти тест на знание первой медицинской помощи.", {id = "StartPoliceExam", data = { exam = "PDkit" }}, nil, function()
					return MRS.GetPlyRank(LocalPlayer(), "NYPD") > 3 and not MRS.GetSData(nil, "exam_pdkit")
				end},
				{"Я хочу пройти тест на право пользования полицейской техникой.", {id = "StartPoliceExam", data = { exam = "PDcar" }}, nil, function()
					return MRS.GetPlyRank(LocalPlayer(), "NYPD") > 3 and not MRS.GetSData(nil, "exam_pdcar")
				end},
				{"Прошу прощения.", "close",},
			},
		},
		[49] = {
			["Line"] = [[Что-ж.. Не думаю, что тут можно сказать что-то уникальное. С одной стороны - изменения везде. С другой - их нет нигде. Всё тот же хаос: где-то превосходим мы, где-то превосходят нас. Увы, тут нельзя сказать что-то конкретное. В этом плане, улицы мало чем отличаются от удушливых офисов.

Стабильность это плохо. Однако, постоянность позволит нам подготовиться лучше к будущим ситуациям и поменять ход истории. Предлагаю заняться как раз этим.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/49.mp3",
			["Answers"] = {
				{"Вы не против немного поговорить?", 50,},
				{"Спасибо. Удачной службы.", "close", nil, nil, "idle_to_lean_back"},
			},
		},
		[50] = {
			["Line"] = [[Конечно. Если это не долго. О чём вы хотите поговорить?]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/50.mp3",
			["Answers"] = {
				{"О вас. Мы так толком и не познакомились.", 51,},
				{"Об улицах. Как там обстоит ситуация, в широких рамках?", 49,},
				{"О работе. На ваш взгляд, чего не хватает департаменту?", 55,},
				{"..Из головы вылетело, простите. Мне надо идти.", "close", nil, nil, "idle_to_lean_back"},
			},
		},
		[51] = {
			["Line"] = [[У меня скучная жизнь. Много кто утверждает обратное, однако я категорически с этим не согласен. Видимо, для того чтобы стать в такое время 'необычным', нужно лишь не идти по течению и искать свой подход. Это единственное, что отличает меня от остальных.

Ну и, соответственно, опыт. И мои корни, вместе с именем. Джона Колдуэлл.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/51.mp3",
			["Answers"] = {
				{"Интересное имя.", 52,},
				{"Откуда вы?", 53,},
				{"Какой опыт?", 54,},
				{"Это всё, что мне хотелось узнать. Спасибо.", "close", nil, nil, "idle_to_lean_back"},
			},
		},
		[52] = {
			["Line"] = [[Символичное. Никогда не верил в бога, хотя вечно верю в человечество. Означает 'голубь', однако я никогда не летал: в Америку перебрался на морском судне. У библейского персонажа вся жизнь покрылась чёрной полосой, а у меня.. Вы видели когда-нибудь полицейского в таком возрасте?

Вряд ли. Великобритания так отличается от Штатов.. Страшно видеть старого там, где часто умирают молодые.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/52.mp3",
			["Answers"] = {
				{"Откуда вы?", 53,},
				{"Опытом?", 54,},
				{"Это всё, что мне хотелось узнать. Спасибо.", "close", nil, nil, "idle_to_lean_back"},
			},
		},
		[53] = {
			["Line"] = [[Соединённое Королевство. Если точнее, то Лондон. Если ещё точнее, то Вестминстер. Вы вряд ли слышали про это место, а потому в ярчайших подробностях рассказывать не вижу смысла. Скажу только то, что преступлений там столько, сколько тут в самом спокойном месте.

Ножи, грабежи, вечные моржи.. В смысле туристы. Они в основном и устраивают беспрядки.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/53.mp3",
			["Answers"] = {
				{"Интересное имя, для британца.", 52,},
				{"Вот, откуда у вас опыт.", 54,},
				{"Это всё, что мне хотелось узнать. Спасибо.", "close", nil, nil, "idle_to_lean_back"},
			},
		},
		[54] = {
			["Line"] = [[Всякий криминал друг на друга похож. Мотивы повторяются, активы те же самые, да и личности что стоят за беспределом. Разница в том, что тут стреляют больше. На осознание такой простой вещи уходит слишком много времени. Я тому живой пример.

Видимо, есть какой-то в этом символизм. Казалось бы - разный совершенно менталитет, а ситуации так-то одинаковые. Только детали отличаются. На то человек и человек, что не следует за одним и тем же, а собирает детали воедино. Как пазл.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/54.mp3",
			["Answers"] = {
				{"Так же можно сказать и про ваше имя.", 52,},
				{"Откуда вы? Точно же, что не отсюда.", 53,},
				{"Это всё, что мне хотелось узнать. Спасибо.", "close", nil, nil, "idle_to_lean_back"},
			},
		},
		[55] = {
			["Line"] = [[Если я скажу, что 'опыта', то это прозвучит неправильно. Ведь опыт это симптом, а его корень - подход. Вместо следования прямым инструкциям, наши офицеры вполне могли бы посмотреть на ситуацию под своим собственным углом. Только, того запрещает протокол.

Хотя, и то неверно. Это лишь оправдание. Всего можно добиться, если захотеть. А желание отбивается монотонностью и вечной протоколизацией. Вместо того, чтобы быть людьми, мы постоянно всё усложняем.

Парадокс какой-то. Простите, нам лучше вернуться к работе. Я очень рад говорить на эту тему, но одними разговорами тут не ограничиться.]],
			["Sound"] = "https://macnco.one/gmod/vo/commissioner/all/55.mp3",
			["Answers"] = {
				{"Спасибо. Удачной службы.", "close", nil, nil, "idle_to_lean_back"},
			},
		},
	}
}