--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/police_hogston_all.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["police_hogston_all"] = {
	name = "Брэдли Хогстон",
	desc = "Лейтенант",
	model = "models/cityrp/pm/nypd/male_02.mdl",
	n_icon = Material("ranks_ui/icons/us/2lt.png", "smooth"),
	namepos = 80,
	theme = "Default",
	checkpos = true,
	scale = 1,
	questNPC = true,
	turntoplayer = true,
	pos = {
		["rp_southside_noire"] = {Vector(8246.71875,8058.1875,200.03125), Angle(0,-5,0)},
	},
	sequence = {"d1_town05_leon_lean_table_posture_entry", "d1_town05_leon_lean_table_posture_idle"},
	uselimit = true,
	skin = 1,
	ClModels = {
		{ model = "models/cityrp/nypd/badge_lt.mdl", pos = Vector(5,-1.9,7.25), ang = Angle(0,150,60), bone = 4},
	},
	submat = {
		[4] = "models/gmodbest/suit/male/topc",
		[16] = "models/gmodbest/acc/hat_02"
	},
	bgr = {[1] = 0,[2] = 0,[3] = 0,[4] = 1,[5] = 1,},
	dialogs = {
-- NON-QUEST
		[1] = {
			["Line"] = [[Здравствуйте. Что-то хотели?]],
			["Animation"] = "d1_town05_leon_lean_table_posture_exit",
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/1.mp3",
			["Answers"] = {
				{"Ничего. Прошу прощения.", "close",},
			},
		},
-- QUEST 1		
		[2] = {
			["Line"] = [[Здравствуйте. Что-то хотели?]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/1.mp3",
			["Animation"] = "d1_town05_leon_lean_table_posture_exit",
			["Answers"] = {
				{"Мне сказали подойти к вам.", 3,},
				{"Ничего. Прошу прощения.", "close",},
			},
		},
		[3] = {
			["Line"] = [[Когда? Кто? Для чего? ..Вы видите эту стопку бумаг? Ты думаешь, у меня есть время запоминать каждую претензию комиссара? Не заставляй меня чувствовать себя неудобно, это тебе не регистратура кадета Шаклса.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/3.mp3",
			["Answers"] = {
				{"Я по поводу поручений.", 5,},
				{"Дядь, остынь.", 4,},
				{"Забудьте. Я пойду.", "close",},
			},
		},
		[4] = {
			["Line"] = [[Не сметь так разговаривать со старшими по званию и статусу! Марш работать!]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/4.mp3",
			["Answers"] = {
				{"Подождите..!", "MQS Fail quest",},
			},
		},
		[5] = {
			["Line"] = [[..Поручения, так.. А я не помню твоего лица. Значит, пройдёмся по самому основному. Ты - офицер полиции. Ты - закон. Тебя должны одинаково хорошо слушаться граждане и хулиганы. Только с последними выходит туго. В какой уже раз..

Кхм. В какой уже раз организованная преступная группировка 'Wild Cats' натворила страшнейшее преступление. Они смеют уродовать стены баллончиками с краской. Ладно ещё плитка - её можно переложить. А кирпичные стены? Их не заменить. Здание осыпется.

Мы никак не можем их поймать.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/5.mp3",
			["Answers"] = {
				{"Что нужно сделать?", 6,},
			},
		},
		[6] = {
			["Line"] = [[..А потому восстановление городской собственности вычитается из нашего бюджета. Ловить этих чертей бессмысленно - они вылезают там, где нет нас. Так что иди на крышу апартаментов напротив парка, и не забудь краску. Она лежит в арсенале. Арсенал на самом нижнем этаже. Ни с кем не говори, просто иди и бери.

Ты же можешь таскать тяжести? Конечно можешь - ты ведь офицер полиции. Ты - закон. Тебя должны слушаться..]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/6.mp3",
			["Answers"] = {
				{"Так точно!", "MQS Continue quest",},
				{"Тогда послушай совет, коллега: лучше найми на красковый бюджет того, кто будет заниматься такой грязью.", 8,},
				{"Почему именно 'Wild Cats', а не кто-нибудь другой? Чем они особенны?", 9,},
				{"Можете дать совет для задачи?", 10,},
				{"Я отказываюсь выполнять это глупое поручение.", 7,},
			},
		},
		[7] = {
			["Line"] = [[Это не обсуждается. Марш работать!]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/7.mp3",
			["Answers"] = {
				{"..Так точно.", "MQS Continue quest",},
				{"Засунь свой марш знаешь куда?", "MQS Fail quest",},
			},
		},
		[8] = {
			["Line"] = [[Слушай, воспринимай это как тренировку перед чем-то серьёзным. Офицер полиции обязан держать себя в хорошей форме, чтобы какой-нибудь жирдяй из 'лепреконной' не обогнал закон. Марш в арсенал!]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/8.mp3",
			["Answers"] = {
				{"..Так точно.", "MQS Continue quest",},
				{"Засунь свой марш знаешь куда?", "MQS Fail quest",},
			},
		},
		[9] = {
			["Line"] = [[Они воспользовались нашей самой большой слабостью, и подло уничтожили слой отбеливателя у кирпичей нашего прекрасного полицейского департамента. Мы не можем оставить несертифицированное неповиновение и хулиганство безнаказанными.

Они знали, что у нас заняты все экипажи. Они знали.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/9.mp3",
			["Answers"] = {
				{"Так точно!", "MQS Continue quest",},
				{"И поэтому мы должны отвлекаться на такую мелочь? Мы что, так плохо выполняем свою работу?", 7,},
				{"Как какие-то хулиганы могут знать, где легче хулиганить? Мы что, так плохо выполняем свою работу?", 7,},
				{"Можете дать совет для задачи?", 10,},
				{"Я отказываюсь выполнять это глупое поручение.", 7,},
			},
		},
		[10] = {
			["Line"] = [[А чего тут советовать? Как воевать с красколюбом? Возьми машину или попроси коллегу тебя довезти. А дальше следуй инстинктам.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/10.mp3",
			["Answers"] = {
				{"Так точно!", "MQS Continue quest",},
				{"Я отказываюсь выполнять это глупое поручение.", 7,},
			},
		},
-- QUEST 2		
		[11] = {
			["Line"] = [[Здравствуйте. Что-то хотели?]],
			["Animation"] = "d1_town05_leon_lean_table_posture_exit",
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/11.mp3",
			["Answers"] = {
				{"Я по поводу поручения.", 12,},
				{"Ничего. Прошу прощения.", "close",},
			},
		},
		[12] = {
			["Line"] = [[Какого? ..Ты видишь эту стопку бумаг? Ты думаешь, у меня есть время запоминать каждого человека и его хотелки? Не бери пример с Шаклса - он отработал уже пять лет, а с регистратуры так никуда и не шагнул.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/12.mp3",
			["Answers"] = {
				{"...", 14,},
				{"Почему у тебя такое отношение к Джимми?", 13,},
				{"Забудьте. Я пойду.", "close",},
			},
		},
		[13] = {
			["Line"] = [[Потому что этот товарищ записан как патрульный офицер, а он не патрулирует - его поставили в прихожей. А значит, он не имеет права подняться по карьерной лестнице. Вот ты видимо выходишь на улицу - я твоё лицо не помню.

..Чего ты так на меня смотришь? Да, я заведую персоналом и я поставил Шаклса на этот пост. Вот в свои добрые годы, я умудрялся держать два пистолета и менять клип на винтовке Мосина. Зубами. А он? Стоит и мямлит, как бабка на лавке!]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/13.mp3",
			["Answers"] = {
				{"...", 14,},
			},
		},
		[14] = {
			["Line"] = [[..Нет, стоп, я тебя всё-таки помню. Отличная работа с краской - слой получился настолько толстым, что 'котам' не получается нормально красить в том же месте! Только вот, они теперь гадят в переулках..

В любом случае, это уже не к тебе. Для тебя есть настоящее задание! Недалеко от ночного клуба завязалась перестрелка. Много убитых, ещё больше раненых, полный хаос..! В общем, как обычно. И офицерам нужна твоя помощь.

Рук совсем не хватает.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/14.mp3",
			["Answers"] = {
				{"Что нужно сделать?", 15,},
			},
		},
		[15] = {
			["Line"] = [[Преступление уже остановилось на наиболее благополучной ноте, нашим ребятам просто не хватает рук. ..Нет? Не дошло? Тебе нужно 'прибраться' за группой первичного реагирования и увезти машину на штраф-стоянку. В ней лежат улики на одного хмыря, доблесно сложенные в багажник офицером Доллассом. Посмертно.

Он не дотянулся до аптечки. Поэтому дотянись до немаркированного транспорта его экипажа. Закончи работу за этого ленивца.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/15.mp3",
			["Answers"] = {
				{"Так точно!", "MQS Continue quest",},
				{"Как ты смеешь так говорить про покойника?", 16,},
				{"Раз уже есть такая информация, значит на месте преступления кто-то был. Почему он не мог перевезти машину?", 17,},
				{"Можете дать совет для задачи?", 18,},
				{"Я отказываюсь выполнять это глупое поручение.", 7,},
			},
		},
		[16] = {
			["Line"] = [[Покойный полицейский ещё двадцать минут полицейский - а значит, должен выполнять свои обязанности. Вот когда в документах напишут, что случился 'конец смены' - тогда уже другой разговор. Марш за машиной!]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/16.mp3",
			["Answers"] = {
				{"..Так точно.", "MQS Continue quest",},
				{"Засунь свой марш знаешь куда?", "MQS Fail quest",},
			},
		},
		[17] = {
			["Line"] = [[Потому что это не входит в их обязанности. Они собирали оружие, упаковывали тела и проводили первичный осмотр. По-твоему, полицейский должен бросить свой патрульный транспорт, и броситься на всех порах к внедорожнику, с ключевыми кадрами к закрытию дела?

Только через мой труп. Всё должно выполняться по протоколу.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/17.mp3",
			["Answers"] = {
				{"Так точно!", "MQS Continue quest",},
				{"А я уже не офицер, раз меня отправляют на такую 'мелочь'?", 7,},
				{"Там настолько всё плохо, что какой-нибудь экипаж не мог разделиться и взяться за машину?", 7,},
				{"Я отказываюсь выполнять это глупое поручение.", 7,},
			},
		},
		[18] = {
			["Line"] = [[Попроси кого-нибудь довезти тебя до улицы Плезант. Проще всего ехать через улицу Мэйпл - через частный сектор. Не смей брать свою патрульную машину - ты представляешь, чего стоит оставить табельный автомобиль с вооружением в чернокожем районе? Ещё одного такого случая я не допущу.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/18.mp3",
			["Answers"] = {
				{"Так точно!", "MQS Continue quest",},
				{"Я отказываюсь выполнять это глупое поручение.", 7,},
			},
		},
-- QUEST 3
		[19] = {
			["Line"] = [[Здравствуйте. Что-то хотели?]],
			["Animation"] = "d1_town05_leon_lean_table_posture_exit",
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/1.mp3",
			["Answers"] = {
				{"Что там по тому заданию?", 20,},
				{"Ничего. Прошу прощения.", "close",},
			},
		},
		[20] = {
			["Line"] = [[Че-его? Какому? ..Ты видишь- ..А, стоп, это ты. Хорошая работа с автомобилем! Табельное оружие на месте, улики тоже. Даже кровь Долласса, пока тот ещё считался служивым. Криминалисты нашли больше, чем просто кровь - они отметили наркотики. Которые Долласс не задекларировал.

Как он посмел не указать такую важную деталь, пока истекал кровью? Я уже выписал отрицательную премию, которую необходимо выплатить его семье в наш бюджет. Не беспокойся, я не бессердечный - я уведомил их о поступившем запросе на перевод средств.

Как насчёт помочь криминалистам с наркотиками?]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/20.mp3",
			["Answers"] = {
				{"...", 22,},
				{"Так говорить про покойника - низко.", 21,},
			},
		},
		[21] = {
			["Line"] = [[Низко - называть покойником того, кто ещё был жив. И по протоколу он был жив. Он мог сообщить, что умирает! А в итоге Долласс забрызгал всю улицу и усложнил работу службам городского хозяйства. Ему повезло, что хотя бы успел подготовить машину для другого сотрудника.

Вот какой-нибудь Шаклс бы этого не сделал.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/21.mp3",
			["Answers"] = {
				{"...", 22,},
				{"Ты сам угробил ему карьеру. Может, Доллассу тоже. Его семье всё испортил точно.", 22,},
			},
		},
		[22] = {
			["Line"] = [[Не надо на меня так смотреть. Они знали, на что идут. Все они знали - и покойники, и живые, и их семьи! Работа такая, понимаешь? Думаешь, тебя с цветами встречать будут после пули между рёбер? Нет. Встречают так только гробы, и то если внимание обратят.

..Так вот, поручение, наркотики. Знаешь же, что такое наркотики? Это то, что никогда не стоит употреблять - даже когда химики департамента синтезируют что-то для унятия боли и называют 'морфином'. Это дрянь. Оно запрещено законом. Вот сигареты разрешены, значит не так плохо. ..И что, что рак вызывает? Наркотики убивают!

Потому их и прячут. И мы знаем, где они лежат.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/22.mp3",
			["Answers"] = {
				{"Их нужно забрать?", 23,},
			},
		},
		[23] = {
			["Line"] = [[Ну наконец-то! Хоть один догадливый офицер! ..Э-э, то есть почти. Тебе нужно найти эти самые пакеты со 'смертью'. Мы только примерно знаем, где они - в мусорках, разбросаны по городу. В помеченных мусорках - эти гангстеры почему-то любят большие контейнеры с крысами на крышках. Как говорится - яблоко от яблони..

Такие же большие и полны дерьма. Так что лучше сходи в химчистку, как закончишь.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/23.mp3",
			["Answers"] = {
				{"Так точно.", "MQS Continue quest",},
				{"Как насчёт показать, как правильно залезать в контейнер и искать?", 25,},
				{"Разве этим должен заниматься обычный патрульный?", 26,},
				{"Можете дать совет для задачи?", 27,},
				{"Я отказываюсь выполнять это глупое поручение.", 24,},
			},
		},
		[24] = {
			["Line"] = [[Это не обсуждается! Всё, никаких больше разговоров! Нервируешь! Пошёл устраивать марш-бросок по мусоркам!]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/24.mp3",
			["Answers"] = {
				{"..Так точно.", "MQS Continue quest",},
				{"Засунь свой марш знаешь куда?", "MQS Fail quest",},
			},
		},
		[25] = {
			["Line"] = [[Мне что, выписать тебе отрицательную премию за несанкционированную провокацию в виде иронизированной шутки? Марш устраивать рейды мусоркам!]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/25.mp3",
			["Answers"] = {
				{"..Так точно.", "MQS Continue quest",},
				{"Засунь свой марш знаешь куда?", "MQS Fail quest",},
			},
		},
		[26] = {
			["Line"] = [[Ты не обычный патрульный. Ты хоть что-то делаешь. А значит, и это сделаешь. Всегда же выкручиваешься. Или ты хочешь отрицательно отличиться? Мне что, уже готовить бланк для комисс- ..в смысле для сержанта?
			 Ты провоцируешь меня на несанкционированный словесный выговор!]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/26.mp3",
			["Answers"] = {
				{"Так точно.", "MQS Continue quest",},
				{"Может, это мне лучше написать сержанту рапорт?", 24,},
				{"Почему нельзя просто наведаться на свалку и устроить им проверку? Всё проходит через них - и машины с наркотиками тоже, получается.", 24,},
				{"Я отказываюсь выполнять это глупое поручение.", 24,},
			},
		},
		[27] = {
			["Line"] = [[Все эти контейнеры находятся на задних дворах многоэтажек. Куда-то ты сможешь попасть на своих двоих, а где-то придётся просить владельца пропустить. Тебе нужно проверить всё, пока ты что-то не найдёшь.

Если тебя не пустят, то выпиши ордер на обыск. А если владельца совсем-совсем нет, то тебе придётся мочиться в канализации. Ты ведь знаешь, как устроена подземка? Надо бы уже выучить все ходы и выходы. Ну? Чего стоишь? Пора отнимать у чертей их дрянь!]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/27.mp3",
			["Answers"] = {
				{"Так точно.", "MQS Continue quest",},
				{"Я отказываюсь выполнять это глупое поручение.", 24,},
			},
		},
-- QUEST 4		
		[28] = {
			["Line"] = [[Чего тебе?]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/28.mp3",
			["Animation"] = "d1_town05_leon_lean_table_posture_exit",
			["Answers"] = {
				{"Я по поводу новой задачи.", 29,},
				{"Ничего. Прошу прощения.", 32,},
			},
		},
		[29] = {
			["Line"] = [[
А нет больше задач. Всё, поезд ушёл.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/29.mp3",
			["Answers"] = {
				{"...", 30,},
				{"Что?", 30,},
				{"Забудь. Я пойду.", 30,},
			},
		},
		[30] = {
			["Line"] = [[Твоя взяла. Тебя переводят к другому человеку. Всеми отделами заведую я, всеми бумагами заведую я, а ты внезапно такая особенная личность! Хватило смелости нажаловаться, и всё - за тебя ручается сам комиссар!
			 Он даже званием ниже меня - какой-то сержантишка с британскими корнями!

Это не справедливо.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/30.mp3",
			["Answers"] = {
				{"...", 31,},
				{"Ты заслуживаешь большего. Отставки.", 31,},
				{"Наконец-то! И как тебя ещё не уволили?", 31,},
				{"Мне жаль.", 31,},
			},
		},
		[31] = {
			["Line"] = [[Да, да.. Иди к нему уже. Ты провоцируешь у меня негативные чувства.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/31.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"С удовольствием.", "MQS Continue quest",},
				{"У тебя есть чувства?", "MQS Continue quest",},
				{"Удачи на службе.", "MQS Continue quest",},
			},
		},
		[32] = {
			["Line"] = [[Вот и правильно. Уходи отсюда, не мешай работу работать.]],
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/32.mp3",
			["Answers"] = {
				{"...", 30,},
				{"Чего-чего?", 30,},
			},
		},
-- RADIANT (будучи копом не на квесте, должно открывать меню)	
		[33] = {
			["Line"] = [[Здравствуйте. Что-то хотели?]],
			["Animation"] = "d1_town05_leon_lean_table_posture_exit",
			["Sound"] = "https://macnco.one/gmod/vo/hogston/all/1.mp3",
			["Answers"] = {
				{"Добрый день. Есть какие-нибудь занятия, какие вечно откладываются в долгий ящик?", "close",},
				{"Ничего. Прошу прощения.", "close",},
			},
		},
	}
}