--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/season_joe.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["season_joe"] = {
	name = "Джо Бабуз",
	model = "models/cityrp/pm/normal/male_02.mdl",
	submat = {
		[9] = "gbskins/outfit/boots_3",
		[8] = "gbskins/outfit/pants_21",
		[4] = "gbskins/outfit/top_21",
		[0] = "models/gmodbest/citizens/facemaps/ted_facemap17"
	},
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "d1_t01_breakroom_sit02",
	uselimit = true,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Ну? Чё стоишь?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/1.mp3",
			["Answers"] = {
				{"Я думаю.", "close",},
			},
		},
		[2] = {
			["Line"] = [[О, вот и ты. Меня зовут Джо. Джо Бабуз.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/2.mp3",
			["Answers"] = {
				{"Приятно познакомиться.", 3,},
				{"Здарова.", 4,},
				{"Что дальше?", 5,},
				{"Это типа какая-то подпольная мастерская?", 6,},
			},
		},
		[3] = {
			["Line"] = [[Взаимно. Что-ж.. ты типа тут давно, да? Понимаешь чё к чему устроено?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/3.mp3",
			["Answers"] = {
				{"Да.", 9,},
				{"Типа.", 9,},
				{"Давай к делу.", 14,},
			},
		},
		[4] = {
			["Line"] = [[Здаров. Так вот, ты типа тут давно, да? Понимаешь чё к чему устроено?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/4.mp3",
			["Answers"] = {
				{"Да.", 9,},
				{"Типа.", 9,},
				{"Давай к делу.", 14,},
			},
		},
		[5] = {
			["Line"] = [[А дальше.. небольшая проверка. Ты зовёшь ся нелегалом, да?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/5.mp3",
			["Answers"] = {
				{"Да.", 10,},
				{"Криминалом. Не нелегалом.", 11,},
				{"Как посмотреть.", 15,},
			},
		},
		[6] = {
			["Line"] = [[Типа. Ты тока так громко о таком не базарь. Стены картонные.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/6.mp3",
			["Answers"] = {
				{"Точно, прости.", 8,},
				{"А то чё?", 7,},
				{"У меня нет времени. Говори что нужно делать.", 7,},
			},
		},
		[7] = {
			["Line"] = [[..Ты какая-то шпонь нетерпеливая, а не нелегал. Пиздуй-ка отсюда.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/7.mp3",
			["Answers"] = {
				{"Эй!", {id = "MQS Skip to", data = {id = 23, quest_id = "season1_criminal_1"}},},
				{"Подожди!", {id = "MQS Skip to", data = {id = 23, quest_id = "season1_criminal_1"}},},
				{"Тебе того же.", {id = "MQS Skip to", data = {id = 23, quest_id = "season1_criminal_1"}},},
			},
		},
		[8] = {
			["Line"] = [[Что-ж.. ты типа тут давно, да? Понимаешь чё к чему устроено?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/8.mp3",
			["Answers"] = {
				{"Да.", 9,},
				{"Типа.", 9,},
				{"Давай к делу.", 7,},
			},
		},
		[9] = {
			["Line"] = [[Ну да, иначе-б тебя не рекомендовали. Чё, считаешь ся достойным звания нелегала?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/9.mp3",
			["Answers"] = {
				{"Да.", 10,},
				{"Криминалом. Не нелегалом.", 11,},
				{"Как посмотреть.", 15,},
			},
		},
		[10] = {
			["Line"] = [[Нелегалу над много навыков шоб держаться на плаву. Нужна выдержка. Можешь выполнять острые поручения?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/10.mp3",
			["Answers"] = {
				{"Могу.", 16,},
				{"Смотря что нужно сделать.", 16,},
				{"Давай быстрее.", 7,},
			},
		},
		[11] = {
			["Line"] = [[Нелегал и криминал - разные вещи. Не все нелегалы стоят в переулках в ожидании тупой жертвы, не каждый при виде свободного ствола сразу берётся за него. Понимаешь, о чём я говорю?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/11.mp3",
			["Answers"] = {
				{"Да. Кому-то нужно работать за кулисами.", 13,},
				{"Да. Нужно вести себя тихо.", 13,},
				{"Да.", 13,},
				{"Нет.", 12,},
			},
		},
		[12] = {
			["Line"] = [[..Тогда нам не о чем говорить. Пиздуй-ка отсюда.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/12.mp3",
			["Answers"] = {
				{"Эй!", {id = "MQS Skip to", data = {id = 23, quest_id = "season1_criminal_1"}},},
				{"Подожди!", {id = "MQS Skip to", data = {id = 23, quest_id = "season1_criminal_1"}},},
				{"Тебе того же.", {id = "MQS Skip to", data = {id = 23, quest_id = "season1_criminal_1"}},},
			},
		},
		[13] = {
			["Line"] = [[Не только. ..Ну, мозги у тя на месте, хоть это хорошо. Чё, как насчёт острого поручения?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/13.mp3",
			["Answers"] = {
				{"Давай.", 16,},
				{"Смотря что нужно сделать.", 16,},
				{"Говори уже что нужно делать.", 7,},
			},
		},
		[14] = {
			["Line"] = [[Сышишь, в моём деле нужна выдержка. Покажи терпение или пиздуй нахуй.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/14.mp3",
			["Answers"] = {
				{"Точно, прости.", 8,},
				{"А то чё?", 7,},
				{"Я не собираюсь терпеть к себе такого отношения.", 12,},
			},
		},
		[15] = {
			["Line"] = [[О как. Типа принципы есть? Уважаемо, утверждает тя. Чё тогда, как насчёт достаточно острого поручения?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/15.mp3",
			["Answers"] = {
				{"Давай.", 16,},
				{"Смотря что нужно сделать.", 16,},
				{"Ты не тяни резину.", 7,},
			},
		},
		[16] = {
			["Line"] = [[Видишь пистолет на столе? Беретта.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/16.mp3",
			["Answers"] = {
				{"Вижу.", 17,},
			},
		},
		[17] = {
			["Line"] = [[Видишь на кресле поц, к батарее прикован?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/17.mp3",
			["Answers"] = {
				{"Вижу.", 18,},
				{"Я не буду этого делать.", 19,},
				{"Мне нужна причина, чтобы убить человека.", 20,},
				{"..Намёк понят.", "MQS Continue quest",},
			},
		},
		[18] = {
			["Line"] = [[Эт твоя проверка на вшивость.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/18.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Я не буду этого делать.", 19,},
				{"Мне нужна причина, чтобы убить человека.", 20,},
				{"..Намёк понят.", "MQS Continue quest",},
			},
		},
		[19] = {
			["Line"] = [[Принципы жмут? Кишка тонка?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/19.mp3",
			["Answers"] = {
				{"Да ладно тебе, ща всё сделаю.", "MQS Continue quest",},
				{"На слабо берёшь? ..У тебя получилось. Сейчас.", "MQS Continue quest",},
				{"Мне нужна причина, чтобы убить человека.", 20,},
				{"Всё сразу. Я так не могу.", 12,},
			},
		},
		[20] = {
			["Line"] = [[Причина? Н- ..Ты чё в игру какую-то играешь или как?! Будешь выполнять или мне нового человека искать?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/20.mp3",
			["Answers"] = {
				{"Хорошо, я это сделаю.", "MQS Continue quest",},
				{"Выполню. Только потому что я уже здесь.", "MQS Continue quest",},
				{"Совсем нет другого выхода?", 7,},
				{"Не буду.", 12,},
			},
		},
		[21] = {
			["Line"] = [[Ну чё?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/21.mp3",
			["Answers"] = {
				{"Оружие не стреляет.", 22,},
				{"..Это тест такой, да? Вот где выдержка нужна?", 23,},
				{"Это чё такое?", 24,},
			},
		},
		[22] = {
			["Line"] = [[Вот настоящий тест. Не подведи. Вон в том углу стол, приступай.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/22.mp3",
			["Answers"] = {
				{"Окей.", "MQS Continue quest",},
				{"Не, слушай, это не для меня. Забирай свой ствол.", 12,},
				{"..А чё делать-то?", 24,},
			},
		},
		[23] = {
			["Line"] = [[Ага. Вон, в том углу стол. Не подведи.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/23.mp3",
			["Answers"] = {
				{"Окей.", "MQS Continue quest",},
				{"Не, слушай, это не для меня. Забирай свой ствол.", 12,},
				{"..А чё делать-то?", 24,},
			},
		},
		[24] = {
			["Line"] = [[Алё, не тупи! Как делать деньги без единого выстрела?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/24.mp3",
			["Answers"] = {
				{"..Мне его избить?", 7,},
				{"А, точно - оружие надо обслужить!", 25,},
				{"Работать?", 25,},
				{"Я не знаю.", 12,},
			},
		},
		[25] = {
			["Line"] = [[Ну тк! Сзади тебя стол, на нём давай работай.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/25.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Что мне нужно делать?", 7,},
				{"Не, слушай, это не для меня. Забирай свой ствол.", 12,},
			},
		},
		[26] = {
			["Line"] = [[Как оно?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/26.mp3",
			["Answers"] = {
				{"Думаю, как подойти к делу.", "close",},
				{"Мне нужно время. Тут определённо больше подвоха.", "close",},
				{"Не понимаю. Это не моё. Ствол на столе. Я ухожу.", 12,},
			},
		},
		[27] = {
			["Line"] = [[Слышал?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/27.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[28] = {
			["Line"] = [[Да-а, эт он постарался. А если-б не проебался, то щас не сидел бы тут якобы роль жертвы играть.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/28.mp3",
			["Answers"] = {
				{"Что дальше?", 29,},
			},
		},
		[29] = {
			["Line"] = [[Слухай, мне этого достаточно, меня не интересуют подробности. Видно же, ты разбираешься в стволах, ты не тупо ими махаешь. Мне нужен такой человек.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/29.mp3",
			["Answers"] = {
				{"Для чего?", 30,},
				{"Подмастерье?", 30,},
				{"Спасибо за предложение. Я пас.", 33,},
			},
		},
		[30] = {
			["Line"] = [[У каждого мастера есть подмастерье, хоть какой-то подручный. В Бруклине и тех и тех крайне мало. Мне нужен креативный человек - кто-то, кто сможет заменить меня в не менее важных задачах, пока я занимаюсь основным делом.

Химикаты, инструменты, клиенты - вот сё это дело, шоб бизнес шёл. Чё скажешь?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/30.mp3",
			["Answers"] = {
				{"Я за.", 31,},
				{"Мне надо подумать.", 32,},
				{"Спасибо за предложение. Я пас.", 33,},
			},
		},
		[31] = {
			["Line"] = [[Тогда договорились. Пусть наш союз окажется самым прибыльным в этой дыре. ..Я те позвоню короче, давай.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/31.mp3",
			["Answers"] = {
				{"Удачи.", "MQS Continue quest",},
				{"Ага.", "MQS Continue quest",},
			},
		},
		[32] = {
			["Line"] = [[Слушай, у меня типа этот олух есть! Хочешь денег - думай быстро.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/32.mp3",
			["Answers"] = {
				{"Уговорил. Добро.", 31,},
				{"Уж лучше я займусь пушками, чем он. Я в деле.", 31,},
				{"Не, прости, это не моё.", 34,},
			},
		},
		[33] = {
			["Line"] = [[Точно заработать не хошь? Это прибыльный бизнес!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/33.mp3",
			["Answers"] = {
				{"..Ай, ладно, это же легко.", 31,},
				{"Хочу. Только как подработка, ладно? ..Надеюсь меня слишком не затянет.", 31,},
				{"Точно. Это не для меня.", 34,},
			},
		},
		[34] = {
			["Line"] = [[В таком случае удачи. Приятно познакомиться с кем-то толковым.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/34.mp3",
			["Answers"] = {
				{"Взаимно.", {id = "MQS Skip to", data = {id = 23, quest_id = "season1_criminal_1"}},},
				{"И тебе.", {id = "MQS Skip to", data = {id = 23, quest_id = "season1_criminal_1"}},},
				{"Да, давай.", {id = "MQS Skip to", data = {id = 23, quest_id = "season1_criminal_1"}},},
			},
		},
		[35] = {
			["Line"] = [[Как оно?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/26.mp3",
			["Answers"] = {
				{"Каждый день такое вижу. К сожалению.", 27,},
				{"Это смешно. Или грустно, смотря как посмотреть.", 27,},
				{"Какой криворукий мудак занимался этим пистолетом?", 27,},
				{"Такое ощущение, будто пушку специально испортили.", 27,},
			},
		},
		[36] = {
			["Line"] = [[Опа. Короче, сразу к делу - у меня пропали клиенты.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/36.mp3",
			["Answers"] = {
				{"Как?", 37,},
				{"Что мне нужно сделать?", 39,},
				{"Дай угадаю - нужно найти новых?", 42,},
			},
		},
		[37] = {
			["Line"] = [[Сгорели. Ты-ж знаешь в каком мы бизнесе варимся. Нам с тобой выгодно когда конкурентность здоровая, когда друг друга не хуярят до конца. А тут прям без шанса вышло - всех покупателей сожгли. ..Стоит ли говорить о копах?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/37.mp3",
			["Answers"] = {
				{"А что копы?", 38,},
				{"Что нужно сделать?", 39,},
				{"Мне нужно найти новых покупателей, так?", 42,},
			},
		},
		[38] = {
			["Line"] = [[В нашем деле паранойя - здоровое состояние. Всмысле не подавать же в открытую объявления по типу 'солью ганы фул обвесы'? ..Какие идиоты вообще такой говор придумали? Они сами понимают свои же слова..? ..В любом случае, ты понимаешь о чём я.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/38.mp3",
			["Answers"] = {
				{"Да. Как мне стоит подойти к делу?", 39,},
			},
		},
		[39] = {
			["Line"] = [[У меня на примете есть три человека. Все трое имеют рутину, все они по словам дебилы, и всех лично я не знаю чтоб правильно судить. Мне нужен тот, кто будет готов закупать стволы партиями. Типа, оглянись - вон сколько у меня вооружения! Нужно это сё превратить в деньги.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/39.mp3",
			["Answers"] = {
				{"Понимаю. Нужно поговорить с каждым, узнать что к чему?", 40,},
			},
		},
		[40] = {
			["Line"] = [[Типа того. Вон сумка - возьми её. Там пробник. Отдашь бесплатно как договорняк в конце тоннеля увидишь. Понятно?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/40.mp3",
			["Answers"] = {
				{"Понятно. Я пойду.", "MQS Continue quest",},
				{"За такой товар нужно платить деньги. Это же качество!", 41,},
			},
		},
		[41] = {
			["Line"] = [[Пробник на то и пробник - надо задобрить, чтоб брить бабки каждый сезон. Сколько овца волка ни боится - её всё равно съест именно пастух.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/41.mp3",
			["Answers"] = {
				{"И вправду. Я тогда пойду.", "MQS Continue quest",},
				{"Ладно. Я пойду.", "MQS Continue quest",},
			},
		},
		[42] = {
			["Line"] = [[Типа. У меня на примете ща три человека. Все трое имеют рутину, все они по словам дебилы, и всех лично я не знаю чтоб правильно судить. Мне нужен тот, кто будет готов закупать стволы партиями. Типа, оглянись - вон сколько у меня вооружения. Нужно это сё превратить в деньги.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe/42.mp3",
			["Answers"] = {
				{"Понимаю. Нужно поговорить с каждым, узнать что к чему?", 40,},
			},
		},
	}
}

MCS.Spawns["season_joe_friend"] = {
	name = "Мужчина в наручниках",
	model = "models/cityrp/pm/normal/male_02.mdl",
	submat = {
		[8] = "gbskins/outfit/pants_6",
		[4] = "gbskins/outfit/top_23",
		[0] = "models/gmodbest/citizens/facemaps/ted_facemap9"
	},
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "silo_sit",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Бля, ты будешь тут весь день стоять?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe_friend/1.mp3",
			["Answers"] = {
				{"...", "close",},
			},
		},
		[2] = {
			["Line"] = [[Иди ты нахуй.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_joe_friend/2.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Эй!", "MQS Continue quest",},
				{"Ты кому из нас?", "MQS Continue quest",},
				{"Тебе того же.", "MQS Continue quest",},
				{"Да ладно тебе, в первый раз всегда так.", "MQS Continue quest",},
			},
		},
	}
}

MCS.Spawns["season_gun"] = {
	noinfo = true,
	name = "Оружие",
	model = "models/hunter/blocks/cube075x075x075.mdl",
	submat = {
		[0] = "null"
	},
	namepos = 80,
	theme = "Retro",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Внешне, пистолет в порядке. Очевидно, проблема где-то внутри.]],
			["Sound"] = "",
			["Answers"] = {
				{"Передёрнуть затвор", 2,},
				{"Нажать на спусковой крючок ещё раз", 3,},
				{"Вытащить магазин", 4,},
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Затвор встал намертво. Как будто его приварили к корпусу изнутри.]],
			["Sound"] = "",
			["Answers"] = {
				{"Нажать на спусковой крючок ещё раз", 3,},
				{"Вытащить магазин", 4,},
				{"Отойти", "close",},
			},
		},
		[3] = {
			["Line"] = [[Выстрела не происходит. Патронник пуст. Или забит чем-то совсем неподходящим.]],
			["Sound"] = "",
			["Answers"] = {
				{"Передёрнуть затвор", 2,},
				{"Вытащить магазин", 4,},
				{"Отойти", "close",},
			},
		},
		[4] = {
			["Line"] = [[Магазин еле вышел из рукояти. Что любопытно - без щелчка.]],
			["Sound"] = "",
			["Answers"] = {
				{"Заглянуть внутрь рукояти", 5,},
				{"Присмотреться к магазину", 7,},
				{"Присмотреться к патронам", 6,},
			},
		},
		[5] = {
			["Line"] = [[Внутри ничего не видно. В собранном состоянии не поможет даже фонарик.]],
			["Sound"] = "",
			["Answers"] = {
				{"Разобрать пистолет", 21,},
				{"Присмотреться к магазину", 7,},
				{"Присмотреться к патронам", 6,},
			},
		},
		[6] = {
			["Line"] = [[Калибр 9мм, двухрядная зарядка. Ничего необычного.]],
			["Sound"] = "",
			["Answers"] = {
				{"Разобрать пистолет", 21,},
				{"Присмотреться к магазину", 7,},
			},
		},
		[7] = {
			["Line"] = [[Магазин совсем не подходит к этому виду пистолетов. И как только его умудрились засунуть внутрь? Не удивительно, почему он вынимался с такими аномалиями.

Нужный магазин лежал в столе.]],
			["Sound"] = "",
			["Answers"] = {
				{"Передёрнуть затвор", 9,},
				{"Нажать на спусковой крючок ещё раз", 8,},
			},
		},
		[8] = {
			["Line"] = [[Плохая идея. Однако, патронник действительно оказался пуст.]],
			["Sound"] = "",
			["Answers"] = {
				{"Передёрнуть затвор", 9,},
			},
		},
		[9] = {
			["Line"] = [[Движению затвора действительно мешал неподходящий магазин. Правда, затвор хоть и двигается, но с трудом. На одном магазине проблемы не закончились.]],
			["Sound"] = "",
			["Answers"] = {
				{"Разобрать пистолет", 10,},
			},
		},
		[10] = {
			["Line"] = [[Каждая деталь отходит друг от друга невыносимо долго. Проблема сразу бросалась в глаза, чуть ли не буквально - мастер перепачкал оружие во время работы везде где только можно.]],
			["Sound"] = "",
			["Answers"] = {
				{"Почистить детали", 12,},
				{"Присмотреться к состоянию деталей", 11,},
			},
		},
		[11] = {
			["Line"] = [[Мазут. Это всё, что заметно.]],
			["Sound"] = "",
			["Answers"] = {
				{"Почистить детали", 12,},
			},
		},
		[12] = {
			["Line"] = [[В борьбе с щёткой, тряпкой и химией, грязь проиграла. Однако, вы ещё не победили. Что дальше?]],
			["Sound"] = "",
			["Answers"] = {
				{"Собрать пистолет", 35,},
				{"Присмотреться к чистым деталям", 13,},
			},
		},
		[13] = {
			["Line"] = [[Детали у пистолета не лучшего качества. Впрочем, свою работу они выполняют. Или выполняли. Может, стоит обратить внимание на что-то конкретное? ]],
			["Sound"] = "",
			["Answers"] = {
				{"Собрать пистолет", 35,},
				{"Заглянуть в затвор", 16,},
				{"Заглянуть внутрь рукояти", 15,},
				{"Просмотреть пружинный механизм", 14,},
			},
		},
		[14] = {
			["Line"] = [[Пружину ничто не может испортить. Она заведена.]],
			["Sound"] = "",
			["Answers"] = {
				{"Собрать пистолет", 35,},
				{"Заглянуть в затвор", 16,},
				{"Заглянуть внутрь рукояти", 15,},
			},
		},
		[15] = {
			["Line"] = [[Приём магазина в рабочем состоянии. Главное не повторять проделок прошлого ломастера.]],
			["Sound"] = "",
			["Answers"] = {
				{"Собрать пистолет", 35,},
				{"Заглянуть в затвор", 16,},
				{"Просмотреть пружинный механизм", 14,},
			},
		},
		[16] = {
			["Line"] = [[Очевидно, в нелегальной деятельности очень ценятся неотслеживаемые стволы. Ведь мало кто умеет стирать серийные номера. Прошлые руки будто поскребли по нему отвёрткой или молотком, ещё и крайне грубо - следующий патрон обязательно застрянет.]],
			["Sound"] = "",
			["Answers"] = {
				{"Найти замену в столе", 19,},
				{"Поправить ровность ствола", 17,},
				{"Допилить серийный номер подручными средствами", 18,},
			},
		},
		[17] = {
			["Line"] = [[Обычно, оружие не хрупкое. Тут точно не обычный случай, из-за всего произошедшего. Лучше так не делать.]],
			["Sound"] = "",
			["Answers"] = {
				{"Найти замену в столе", 19,},
				{"Допилить серийный номер подручными средствами", 18,},
			},
		},
		[18] = {
			["Line"] = [[Победа. Ствол даже больше непригоден, чем до этого.]],
			["Sound"] = "",
			["Answers"] = {
				{"Найти замену в столе", 19,},
			},
		},
		[19] = {
			["Line"] = [[К счастью, в столе лежала точная копия ствола данной модели пистолета. За исключением всех неполадок.]],
			["Sound"] = "",
			["Answers"] = {
				{"Собрать пистолет", 20,},
			},
		},
		[20] = {
			["Line"] = [[Пистолет работает. Теперь - точно.]],
			["Sound"] = "",
			["Answers"] = {
				{"Положить пистолет на стол и отойти", {id = "MQS Skip to", data = {id = 28, quest_id = "season1_criminal_1"}},},
			},
		},
		[21] = {
			["Line"] = [[Каждая деталь отходит друг от друга невыносимо долго. Проблема сразу бросалась в глаза, чуть ли не буквально - мастер перепачкал оружие во время работы везде где только можно.]],
			["Sound"] = "",
			["Answers"] = {
				{"Почистить детали", 23,},
				{"Присмотреться к состоянию деталей", 22,},
			},
		},
		[22] = {
			["Line"] = [[Мазут. Это всё, что заметно.]],
			["Sound"] = "",
			["Answers"] = {
				{"Почистить детали", 23,},
			},
		},
		[23] = {
			["Line"] = [[В борьбе с щёткой, тряпкой и химией, грязь проиграла. Однако, вы ещё не победили. Что дальше?]],
			["Sound"] = "",
			["Answers"] = {
				{"Собрать пистолет", 39,},
				{"Присмотреться к чистым деталям", 24,},
			},
		},
		[24] = {
			["Line"] = [[Детали у пистолета не лучшего качества. Впрочем, свою работу они выполняют. Или выполняли. Может, стоит обратить внимание на что-то конкретное? ]],
			["Sound"] = "",
			["Answers"] = {
				{"Собрать пистолет", 39,},
				{"Заглянуть в затвор", 27,},
				{"Заглянуть внутрь рукояти", 26,},
				{"Просмотреть пружинный механизм", 25,},
			},
		},
		[25] = {
			["Line"] = [[Пружину ничто не может испортить. Она заведена.]],
			["Sound"] = "",
			["Answers"] = {
				{"Собрать пистолет", 39,},
				{"Заглянуть в затвор", 27,},
				{"Заглянуть внутрь рукояти", 26,},
			},
		},
		[26] = {
			["Line"] = [[Приём магазина в рабочем состоянии. Главное не повторять проделок прошлого ломастера.]],
			["Sound"] = "",
			["Answers"] = {
				{"Собрать пистолет", 39,},
				{"Заглянуть в затвор", 27,},
				{"Просмотреть пружинный механизм", 25,},
			},
		},
		[27] = {
			["Line"] = [[Очевидно, в нелегальной деятельности очень ценятся неотслеживаемые стволы. Ведь мало кто умеет стирать серийные номера. Прошлые руки будто поскребли по нему отвёрткой или молотком, ещё и крайне грубо - следующий патрон обязательно застрянет.]],
			["Sound"] = "",
			["Answers"] = {
				{"Найти замену в столе", 30,},
				{"Поправить ровность ствола", 28,},
				{"Допилить серийный номер подручными средствами", 29,},
			},
		},
		[28] = {
			["Line"] = [[Обычно, оружие не хрупкое. Тут точно не обычный случай, из-за всего произошедшего. Лучше так не делать.]],
			["Sound"] = "",
			["Answers"] = {
				{"Найти замену в столе", 30,},
				{"Допилить серийный номер подручными средствами", 29,},
			},
		},
		[29] = {
			["Line"] = [[Победа. Ствол даже больше непригоден, чем до этого.]],
			["Sound"] = "",
			["Answers"] = {
				{"Найти замену в столе", 30,},
			},
		},
		[30] = {
			["Line"] = [[К счастью, в столе лежала точная копия ствола данной модели пистолета. За исключением всех неполадок.]],
			["Sound"] = "",
			["Answers"] = {
				{"Собрать пистолет", 31,},
			},
		},
		[31] = {
			["Line"] = [[Пистолет собран. Пора проверить работоспособность.]],
			["Sound"] = "",
			["Answers"] = {
				{"Вставить магазин", 32,},
			},
		},
		[32] = {
			["Line"] = [[Магазин напрочь отказывается вставляться. Что теперь-то не так?]],
			["Sound"] = "",
			["Answers"] = {
				{"Присмотреться к магазину", 34,},
				{"Присмотреться к патронам", 33,},
			},
		},
		[33] = {
			["Line"] = [[Калибр 9мм, двухрядная зарядка. Ничего необычного.]],
			["Sound"] = "",
			["Answers"] = {
				{"Присмотреться к магазину", 34,},
			},
		},
		[34] = {
			["Line"] = [[Магазин совсем не подходит к этому виду пистолетов. И как только его умудрились засунуть внутрь до этого? Не удивительно, почему он вынимался с такими аномалиями.

Нужный магазин лежал в столе.]],
			["Sound"] = "",
			["Answers"] = {
				{"Проверить работоспособность пистолета", 20,},
			},
		},
		[35] = {
			["Line"] = [[Пистолет собран. Пора проверить работоспособность.]],
			["Sound"] = "",
			["Answers"] = {
				{"Вставить магазин", 36,},
			},
		},
		[36] = {
			["Line"] = [[Нужный магазин встал как надо. ]],
			["Sound"] = "",
			["Answers"] = {
				{"Передёрнуть затвор", 37,},
			},
		},
		[37] = {
			["Line"] = [[Родной калибр вошёл в патронник без всяких проблем.]],
			["Sound"] = "",
			["Answers"] = {
				{"Выстрелить в стену", 38,},
				{"Выстрелить себе в голову", "Shoot player",},
			},
		},
		[38] = {
			["Line"] = [[Оружие сразу заклинило после выстрела. Пуля вылетает, механизм застревает, пистолет не разжимает. Его нужно разобрать.]],
			["Sound"] = "",
			["Answers"] = {
				{"Разобрать пистолет", 13,},
			},
		},
		[39] = {
			["Line"] = [[Пистолет собран. Пора проверить работоспособность.]],
			["Sound"] = "",
			["Answers"] = {
				{"Вставить магазин", 40,},
			},
		},
		[40] = {
			["Line"] = [[Магазин напрочь отказывается вставляться. Что теперь-то не так?]],
			["Sound"] = "",
			["Answers"] = {
				{"Присмотреться к магазину", 42,},
				{"Присмотреться к патронам", 41,},
			},
		},
		[41] = {
			["Line"] = [[Калибр 9мм, двухрядная зарядка. Ничего необычного.]],
			["Sound"] = "",
			["Answers"] = {
				{"Присмотреться к магазину", 42,},
			},
		},
		[42] = {
			["Line"] = [[Магазин совсем не подходит к этому виду пистолетов. И как только его умудрились засунуть внутрь до этого? Не удивительно, почему он вынимался с такими аномалиями.

Нужный магазин лежал в столе.]],
			["Sound"] = "",
			["Answers"] = {
				{"Вставить магазин", 36,},
			},
		},
	}
}