--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/season_patients.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["season_patient1"] = {
	name = "Пациент 'Терминус'",
	model = "models/cityrp/pm/normal/female_05.mdl",
	namepos = 80,
	theme = "Retro",
	noinfo = true,
	scale = 1,
	questNPC = false,
	pos = {},
	submat = {
		[4] = "gbskins/outfit/top_204",
		[9] = "gbskins/outfit/pants_204",
		[10] = "gbskins/outfit/boots_24"
	},
	sequence = "lying_down",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Пациент в бессознательном состоянии. Что именно с ним произошло - задача для вашей разгадки.]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 2,},
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Внешне, признаков травм нет. Нужно копаться глубже.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Замерить удары сердца", 4,},
				{"Проверить реакцию на свет", 5,},
				{"Похлопать по щёкам", 6,},
			},
		},
		[3] = {
			["Line"] = [[Дыхание спокойное. Скорее даже, неприлично расслабленное.]],
			["Sound"] = "",
			["Answers"] = {
				{"Замерить удары сердца", 4,},
				{"Проверить реакцию на свет", 5,},
				{"Похлопать по щёкам", 6,},
				{"Сделать выводы", 7,},
			},
		},
		[4] = {
			["Line"] = [[Сердце сильно замедлено. Однако, оно бьётся.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Проверить реакцию на свет", 5,},
				{"Похлопать по щёкам", 6,},
				{"Сделать выводы", 7,},
			},
		},
		[5] = {
			["Line"] = [[Зрачки совершенно не реагируют на свет.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Замерить удары сердца", 4,},
				{"Похлопать по щёкам", 6,},
				{"Сделать выводы", 7,},
			},
		},
		[6] = {
			["Line"] = [[Внешние воздействия не вызывают никакой реакции. Хоть бензопилой режь.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Замерить удары сердца", 4,},
				{"Проверить реакцию на свет", 5,},
				{"Сделать выводы", 7,},
			},
		},
		[7] = {
			["Line"] = [[Человек точно живой. Надолго ли - совсем другая история. На что больше похоже состояние пациента 'Терминус'?]],
			["Sound"] = "",
			["Answers"] = {
				{"Очень крепкий сон", 8,},
				{"Передоз", 8,},
				{"Кома", 8,},
				{"Клиническая смерть", 8,},
				{"Отравление", 8,},
			},
		},
		[8] = {
			["Line"] = [[Может быть. Нужно запомнить и перейти к следующему человеку.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
	}
}

MCS.Spawns["season_patient2"] = {
	name = "Пациент 'Олидус'",
	model = "models/cityrp/pm/normal/male_03.mdl",
	namepos = 80,
	theme = "Retro",
	scale = 1,
	noinfo = true,
	questNPC = false,
	pos = {},
	sequence = "lying_down",
	uselimit = false,
	skin = 1,
	bgr = {},
	submat = {
		[4] = "gbskins/outfit/top_204",
		[8] = "gbskins/outfit/pants_204",
		[9] = "gbskins/outfit/boots_24"
	},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Пациент в бессознательном состоянии, от него заметно неприятно пахнет. Что именно с ним произошло - задача для вашей разгадки.]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 2,},
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[На руках странные гематомы со следами от шприцов. Кажется, перед вами наркоман.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Замерить удары сердца", 4,},
				{"Проверить реакцию на свет", 5,},
				{"Похлопать по щёкам", 6,},
			},
		},
		[3] = {
			["Line"] = [[Дыхание очень нервное. Не сознательное.]],
			["Sound"] = "",
			["Answers"] = {
				{"Замерить удары сердца", 4,},
				{"Проверить реакцию на свет", 5,},
				{"Похлопать по щёкам", 6,},
				{"Сделать выводы", 7,},
			},
		},
		[4] = {
			["Line"] = [[Сердце бьётся в хаотичном ритме. То слишком быстро, то почти без ударов.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Проверить реакцию на свет", 5,},
				{"Похлопать по щёкам", 6,},
				{"Сделать выводы", 7,},
			},
		},
		[5] = {
			["Line"] = [[Зрачки совершенно не реагируют на свет. Они крайне сужены.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Замерить удары сердца", 4,},
				{"Похлопать по щёкам", 6,},
				{"Сделать выводы", 7,},
			},
		},
		[6] = {
			["Line"] = [[Любые касания тела вызывают кратковременные судороги. Хлопки могут закончиться фатально.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Замерить удары сердца", 4,},
				{"Проверить реакцию на свет", 5,},
				{"Сделать выводы", 7,},
			},
		},
		[7] = {
			["Line"] = [[Как бы то ни звучало - состояние мужчины пока что стабильно. Пока что. На что больше похоже состояние пациента 'Олидус'?]],
			["Sound"] = "",
			["Answers"] = {
				{"Очень крепкий сон", 8,},
				{"Передоз", 8,},
				{"Кома", 8,},
				{"Клиническая смерть", 8,},
				{"Отравление", 8,},
			},
		},
		[8] = {
			["Line"] = [[Может быть. Нужно запомнить и перейти к следующему человеку.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
	}
}

MCS.Spawns["season_patient3"] = {
	name = "Пациент 'Гиббус'",
	model = "models/cityrp/pm/normal/male_02.mdl",
	namepos = 80,
	theme = "Retro",
	noinfo = true,
	scale = 1,
	questNPC = false,
	pos = {},
	submat = {
		[4] = "gbskins/outfit/top_204",
		[8] = "gbskins/outfit/pants_204",
		[9] = "gbskins/outfit/boots_24"
	},
	sequence = "lying_down",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Пациент в бессознательном состоянии. Что именно с ним произошло - задача для вашей разгадки.]],
			["Sound"] = "",
			["Answers"] = {
				{"Осмотреть пациента", 2,},
				{"Отойти", "close",},
			},
		},
		[2] = {
			["Line"] = [[Внешне, признаков травм нет. Нужно копаться глубже.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Замерить удары сердца", 4,},
				{"Проверить реакцию на свет", 5,},
				{"Похлопать по щёкам", 6,},
			},
		},
		[3] = {
			["Line"] = [[Дыхание точно есть, оно затруднённое. Пациент храпит.]],
			["Sound"] = "",
			["Answers"] = {
				{"Замерить удары сердца", 4,},
				{"Проверить реакцию на свет", 5,},
				{"Похлопать по щёкам", 6,},
				{"Сделать выводы", 7,},
			},
		},
		[4] = {
			["Line"] = [[Сердце бьётся расслабленно. Привычно для человека не в сознании.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Проверить реакцию на свет", 5,},
				{"Похлопать по щёкам", 6,},
				{"Сделать выводы", 7,},
			},
		},
		[5] = {
			["Line"] = [[Мужчина отворачивает голову в противоположную сторону, как ни в чём ни бывало.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Замерить удары сердца", 4,},
				{"Похлопать по щёкам", 6,},
				{"Сделать выводы", 7,},
			},
		},
		[6] = {
			["Line"] = [[Пациент ворчит и отмахивается.]],
			["Sound"] = "",
			["Answers"] = {
				{"Прислушаться к дыханию", 3,},
				{"Замерить удары сердца", 4,},
				{"Проверить реакцию на свет", 5,},
				{"Сделать выводы", 7,},
			},
		},
		[7] = {
			["Line"] = [[Человек без всяких сомнений жив. Скорее даже, здоров. На что больше похоже состояние пациента 'Гиббус'?]],
			["Sound"] = "",
			["Answers"] = {
				{"Очень крепкий сон", 8,},
				{"Передоз", 8,},
				{"Кома", 8,},
				{"Клиническая смерть", 8,},
				{"Отравление", 8,},
			},
		},
		[8] = {
			["Line"] = [[Может быть. Нужно запомнить и перейти к следующему человеку.]],
			["Sound"] = "",
			["Answers"] = {
				{"Отойти", "close",},
			},
		},
	}
}