--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/season_elliot.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["season_elliot"] = {
	name = "Эллиот",
	model = "models/cityrp/pm/normal/male_02.mdl",
	submat = {
		[9] = "gbskins/outfit/boots_2",
		[8] = "gbskins/outfit/pants_3",
		[4] = "gbskins/outfit/top_3",
		[0] = "models/gmodbest/citizens/facemaps/ted_facemap5"
	},
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "pose_standing_02",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Беги давай отсюда!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/1.mp3",
			["Answers"] = {
				{"...", "close",},
			},
		},
		[2] = {
			["Line"] = [[Ну чё, суслик?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/2.mp3",
			["Answers"] = {
				{"...", 3,},
				{"Кто ты? Что тебе надо?", 4,},
				{"Сам ты суслик!", 5,},
			},
		},
		[3] = {
			["Line"] = [[Чё молчишь?!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/3.mp3",
			["Answers"] = {
				{"...", "Damage player",},
				{"Кто ты? Что тебе надо?", 4,},
				{"Сам ты суслик!", 5,},
			},
		},
		[4] = {
			["Line"] = [[Я твой самый худший кошмар. Я могу прямо сейчас устроить запланированное тобой; я уже это устроил! Могу сто раз повторить с каждым из вас! ..Чё плывёшь? Не отводи сука взгляда! В глаза смотри!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/4.mp3",
			["Answers"] = {
				{"Я убью тебя.", 6,},
				{"За что?", 7,},
				{"Что ты хочешь?", 7,},
			},
		},
		[5] = {
			["Line"] = [[Я нихуя не суслик, я уже перебродил в самый сука горький человеческий спирт. ..По тебе бочка погребенная плачет, суслик!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/5.mp3",
			["Answers"] = {
				{"Кто ты вообще такой?", 4,},
			},
		},
		[6] = {
			["Line"] = [[Ну же, скорее! Убей меня! Убей, чтоб я в аду всех вас ещё раз перехуярил!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/6.mp3",
			["Answers"] = {
				{"Чего ты хочешь?", 7,},
				{"Что мы тебе сделали?", 7,},
			},
		},
		[7] = {
			["Line"] = [[Вы сука за моей спиной на меня же облаву гоните, а терь смеете не понимать хули я такой злой?!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/7.mp3",
			["Answers"] = {
				{"Какую облаву? Мужик, мы же мирно договорились!", 8,},
				{"Мы не хотели собирались никого обманывать! Мы привезли товар как и договаривались!", 8,},
				{"Это бизнес!", 8,},
			},
		},
		[8] = {
			["Line"] = [[Вы все предатели, продажные сволочи! Вы за моей спиной сука промышляете! Я вам не давал права без моего ведома даже моргать - а тут такая наглость! Договоры на стороне, сука!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/8.mp3",
			["Answers"] = {
				{"Кто-ж знал, что так случится?", 9,},
				{"Может у нас с тобой получится договориться?", 9,},
				{"Ты самый главный той шайки?", 9,},
			},
		},
		[9] = {
			["Line"] = [[Закрой рот и слушай сюда. Ты и любые твои подельники теперь работаете на меня. Отчитываетесь напрямую мне, приказы получаете от меня, заказы - только от меня! Никаких препятствий между, никаких сторонних дел - всё напрямую! От меня, через меня, для меня!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/9.mp3",
			["Answers"] = {
				{"Почему?", 10,},
				{"В смысле? Разве мы до этого не работали?", 11,},
				{"Хорошо.", 12,},
			},
		},
		[10] = {
			["Line"] = [[Потому что я так сказал. Сначала ты работаешь на деньги - а потом деньги работают на тебя. Я своё отработал - теперь ты работаешь на меня! Ты - деньги! Вперёд!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/10.mp3",
			["Answers"] = {
				{"Хорошо.", 12,},
				{"В смысле? Разве мы до этого не работали?", 11,},
			},
		},
		[11] = {
			["Line"] = [[Те блять уши пулями прочистить? Ты работаешь на меня! Ты посвящаешь свою жизнь мне! Точка!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/11.mp3",
			["Answers"] = {
				{"Почему?", 10,},
				{"Хорошо.", 12,},
			},
		},
		[12] = {
			["Line"] = [[Следующие две партии ты делаешь без оплаты. Это тебе сука урок за наёб. Даже не думай думать о чём-то кроме удовлетворения меня, иначе я закажу твою голову на платиновом блюдечке с соусом из боли. Я знаю где ты живёшь. Я найду тебя в любом уголке этого города.

Я Эллиот, мать его, Дайнер! Я пожру твою волю!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/12.mp3",
			["Answers"] = {
				{"Мы не обманывали! Это нас обманули!", 13,},
				{"Ладно.", 14,},
				{"Тогда пойду отрабатывать.", 15,},
				{"А на что мне жить в это время?", 13,},
			},
		},
		[13] = {
			["Line"] = [[Меня не ебёт! Надо было думать и идти сразу ко мне! ..Беги работать, беги отсюда!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/13.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Бегу!", "MQS Continue quest",},
				{"Ты пожалеешь об этом.", "MQS Continue quest",},
			},
		},
		[14] = {
			["Line"] = [[Ты мне одолжений не делай, у тебя и так твоя голова в долгу у меня! Беги работать! Беги, пока лебединая песня играет!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/14.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Бегу!", "MQS Continue quest",},
				{"Ты пожалеешь об этом.", "MQS Continue quest",},
			},
		},
		[15] = {
			["Line"] = [[Куда ты там пойдёшь?! Ты сейчас как фрисби полетишь пахать! Порхай отсюда! Беги, пока я не передумал только держать на прицеле!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_elliot/15.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Бегу!", "MQS Continue quest",},
				{"Ты пожалеешь об этом.", "MQS Continue quest",},
			},
		},
	}
}