--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/season_staff.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

-- Вне диалога, этот персонаж должен произнести фразу ниже. Нужна озвучка:
-- 
-- ..На этом мы подводим экскурсию к завершению. Спасибо всем пришедшим посмотреть на работу нашей частной больницы!
MCS.Spawns["season_staff"] = {
	name = "Джейсон Эйр",
	desc = "Заместитель главного врача",
	model = "models/cityrp/pm/normal/male_08.mdl",
	submat = {
		[9] = "gbskins/outfit/boots_26",
		[8] = "gbskins/outfit/pants_745",
		[4] = "gbskins/outfit/top_745",
		[0] = "models/gmodbest/citizens/facemaps/vance_facemap4"
	},
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "lineidle02",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {},
	dialogs = {
		[1] = {
			["Line"] = [[Простите, вы что-то хотели?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/1.mp3",
			["Answers"] = {
				{"Нет, ничего.", "close",},
			},
		},
		[2] = {
			["Line"] = [[А вы, молодой человек, тоже пришли посмотреть да послушать?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/2.mp3",
			["Answers"] = {
				{"Да.", 3,},
				{"И да, и нет; моя основная цель - поступить в интернатуру.", 5,},
				{"Нет. Я хочу у вас работать.", 5,},
			},
		},
		[3] = {
			["Line"] = [[К сожалению, вы немного опоздали. К счастью, мы ещё не закончили! Сейчас мы переходим ко второй части нашего дня - к проверке знаний наших будущих врачей. Да, речь о некоторых из вас, кто пришёл сюда ради работы. Не будем тянуть время.

Вы ведь тоже пришли ради места в больнице? Рабочего, разумеется.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/3.mp3",
			["Answers"] = {
				{"Да.", 4,},
				{"Раз уж на то пошло, то да.", 4,},
				{"Посмотрим. Надо сначала увидеть, как у вас всё устроено.", 4,},
			},
		},
		[4] = {
			["Line"] = [[В таком случае, всем желающим прошу пройти за мной на самый верх.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/4.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[5] = {
			["Line"] = [[Вы как раз вовремя! Прямо сейчас мы переходим ко второй части нашего дня - к проверке знаний наших будущих врачей. Да, речь о некоторых из вас, кто пришёл сюда ради работы - как этот молодой человек. Не будем тянуть время - прошу всем желающим пройти за мной на самый верх.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/5.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
			},
		},
		[6] = {
			["Line"] = [[..И так, вас осталось всего трое. Удивлены?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/6.mp3",
			["Answers"] = {
				{"Да.", 7,},
				{"Нисколько.", 8,},
				{"Логично, что от нужды реально шевелить мозгами все разойдутся.", 9,},
			},
		},
		[7] = {
			["Line"] = [[На самом деле, всё очень просто. Это обычная психология: когда есть более лёгкие, пусть и не окупаемые альтернативы, люди склонны тянуться к ним. Нужда по-настоящему работать отпугивает современного человека, благодаря якобы возможности зарабатывать сидя на одном месте.

Им правда в будущем потребуются врачи из-за такого образа жизни, однако это уже совсем другая история. По крайней мере, так думают будущие жертвы такой жизни..]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/7.mp3",
			["Answers"] = {
				{"Что дальше?", 10,},
			},
		},
		[8] = {
			["Line"] = [[Я так понимаю, вы уже столкнулись с похожим опытом, не так ли? Обилие ложных возможностей притягивает нежелающих по-настоящему трудиться. Реальная работа отпугивает современного человека благодаря якобы возможности зарабатывать сидя на одном месте.

Им правда в будущем потребуются врачи из-за такого образа жизни, однако это уже совсем другая история. По крайней мере, так думают будущие жертвы такой жизни..]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/8.mp3",
			["Answers"] = {
				{"Что дальше?", 10,},
			},
		},
		[9] = {
			["Line"] = [[Замечательная наблюдательность! Надеюсь, у нас будет шанс сработаться ради великого дела.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/9.mp3",
			["Answers"] = {
				{"Взаимно. Что дальше?", 10,},
				{"Что у нас дальше по плану?", 10,},
			},
		},
		[10] = {
			["Line"] = [[Пришло время для финального теста. В этой и в соседней лаборатории лежат три тела. Все трое в бессознательном состоянии. Вам необходимо по внешним симптомам определить причину отсутствия сознания. Или само состояние, если то невозможно.
			
В целом - надо рассказать, что с ними не так.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/10.mp3",
			["Answers"] = {
				{"Легко.", 11,},
				{"Попробуем.", 13,},
				{"Это возможно?", 12,},
			},
		},
		[11] = {
			["Line"] = [[Мне нравится ваш энтузиазм! Время пошло.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/11.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
			},
		},
		[12] = {
			["Line"] = [[В 90% случаев, пациенты не помогают в установке правильного диагноза. Примерно в половине из этих случаев они и вовсе мешают. Вам необходимо научиться доверять своим знаниям и внешним признакам.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/12.mp3",
			["Answers"] = {
				{"И вправду.", 13,},
				{"Знания нужно ещё заработать..", 13,},
			},
		},
		[13] = {
			["Line"] = [[Ваше время пошло.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/13.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
			},
		},
		[14] = {
			["Line"] = [[Да? Вы готовы?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/14.mp3",
			["Answers"] = {
				{"Кажется, да.", 16,},
				{"Это слишком сложно. Я пас.", 15,},
				{"Ещё нет. Мне нужно собрать мысли.", "close",},
			},
		},
		[15] = {
			["Line"] = [[В таком случае, удачи в ваших начинаниях!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/15.mp3",
			["Answers"] = {
				{
					"...", {
						id = "MQS Skip to",
						data = {
							id = 13,
							quest_id = "season1_civilian_1"
						}
					},
				},
				{
					"Спасибо.", {
						id = "MQS Skip to",
						data = {
							id = 13,
							quest_id = "season1_civilian_1"
						}
					},
				},
				{
					"Почему это всё так сложно..?", {
						id = "MQS Skip to",
						data = {
							id = 13,
							quest_id = "season1_civilian_1"
						}
					},
				},
			},
		},
		[16] = {
			["Line"] = [[Тогда начнём с простого: что вы можете сказать про пациента 'Терминус'?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/16.mp3",
			["Answers"] = {
				{"Пациент.. спит. Очень крепко спит.", 22,},
				{"Пациент без сознания из-за передозировки.", 22,},
				{"Пациент в коме.", 17,},
				{"Клиническая смерть.", 22,},
				{"Пациент отравился.", 22,},
			},
		},
		[17] = {
			["Line"] = [[Так.. хорошо. Что скажете про пациента 'Олидус'?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/17.mp3",
			["Answers"] = {
				{"Пациент.. спит. Очень крепко спит.", 22,},
				{"Пациент без сознания из-за передозировки.", 18,},
				{"Пациент в коме.", 22,},
				{"Клиническая смерть.", 22,},
				{"Пациент отравился.", 22,},
			},
		},
		[18] = {
			["Line"] = [[Верно. Такой случай пропустить равносильно потере карьеры. Что скажете про пациента 'Гиббус'?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/18.mp3",
			["Answers"] = {
				{"Пациент.. спит. Очень крепко спит.", 19,},
				{"Пациент без сознания из-за передозировки.", 22,},
				{"Пациент в коме.", 22,},
				{"Клиническая смерть.", 22,},
				{"Пациент отравился.", 22,},
			},
		},
		[19] = {
			["Line"] = [[Знаете, далеко не все могут отличить обычный ушиб от карциномы. Вы абсолютно верно продиагностировали всех пациентов! Мы приглашаем вас начать рабочее обучение в Southside Medical. Как скоро вы сможете к нему приступить?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/19.mp3",
			["Answers"] = {
				{"Хоть сейчас.", 20,},
				{"В ближайшее время.", 20,},
			},
		},
		[20] = {
			["Line"] = [[Что-ж.. думаю, вы понимаете, что наилучшее обучение достигается практикой - прямо как сейчас. На это нужно время, нам необходимо подготовиться. Как насчёт в любой день, начиная с завтрашнего?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/20.mp3",
			["Answers"] = {
				{"Конечно.", 21,},
				{"Разумно. Да.", 21,},
			},
		},
		[21] = {
			["Line"] = [[Замечательно! Пожалуйста, оставьте свои контакты. Мы вышлем форму по вашему адресу.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/21.mp3",
			["Answers"] = {
				{"Вот моя визитка. До свидания.", "MQS Continue quest",},
			},
		},
		[22] = {
			["Line"] = [[Это.. точно не правильно. Простите, вы нам не подходите. Удачи в ваших начинаниях!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/22.mp3",
			["Answers"] = {
				{
					"Ладно.", {
						id = "MQS Skip to",
						data = {
							id = 13,
							quest_id = "season1_civilian_1"
						}
					},
				},
				{
					"Жалко.", {
						id = "MQS Skip to",
						data = {
							id = 13,
							quest_id = "season1_civilian_1"
						}
					},
				},
				{
					"Вы об этом пожалеете.", {
						id = "MQS Skip to",
						data = {
							id = 13,
							quest_id = "season1_civilian_1"
						}
					},
				},
			},
		},
		[23] = {
			["Line"] = [[А, вот и вы! Готовы к необычному тесту?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/23.mp3",
			["Answers"] = {
				{"Всегда.", 24,},
				{"Конечно.", 24,},
				{"Что за тест?", 25,},
				{"Одну секундочку..", "close",},
			},
		},
		[24] = {
			["Line"] = [[Отлично! Ваш пациент - мистер Луиз. Фредди Луиз. Вам нужно поговорить с ним и понять, что с пациентом не так.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/24.mp3",
			["Answers"] = {
				{"Легко.", "MQS Continue quest",},
				{"Хорошо.", "MQS Continue quest",},
				{"В чём подвох?", 26,},
			},
		},
		[25] = {
			["Line"] = [[Вам необходимо опросить пациента и поставить диагноз на основе его слов. Пациента зовут Фредди Луиз.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/25.mp3",
			["Answers"] = {
				{"Легко.", "MQS Continue quest",},
				{"Хорошо.", "MQS Continue quest",},
				{"В чём подвох?", 26,},
			},
		},
		[26] = {
			["Line"] = [[Мистер Луиз жалуется на боли по всему телу. Болеутоляющие средства не помогают.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/26.mp3",
			["Answers"] = {
				{"О как. Справимся.", "MQS Continue quest",},
				{"Отличный урок выйдет.", "MQS Continue quest",},
				{"Кажется, я уже знаю, что с ним..", "MQS Continue quest",},
			},
		},
		[27] = {
			["Line"] = [[Вижу, вы уже закончили. Какой вывод вы готовы сделать из беседы?]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/27.mp3",
			["Answers"] = {
				{"Психосоматика. Его что-то беспокоит - оттого и 'медицински-необъяснимые' боли.", 28,},
				{"Синдром пропавшего пениса.", 29,},
				{"Гипохондрия.", 32,},
				{"Парадокс траты драгоценного времени медицинского состава. Мюнхгаузен.", 30,},
				{"Это не психология. Его всё-таки мучает что-то физическое.", 31,},
			},
		},
		[28] = {
			["Line"] = [[Интересный ответ - и отчасти он правильный. Здесь действительно замешана психология.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/28.mp3",
			["Answers"] = {
				{"Так что же это?", 36,},
			},
		},
		[29] = {
			["Line"] = [[Достаточно.. экзотическое название для Синдрома Коро. Однако, это не то. Всё ещё психологическое, но не то.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/29.mp3",
			["Answers"] = {
				{"Так что же это?", 36,},
			},
		},
		[30] = {
			["Line"] = [[С вами бы точно согласились ваши коллеги. Однако, пациент действительно болен.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/30.mp3",
			["Answers"] = {
				{"Тогда что это?", 36,},
			},
		},
		[31] = {
			["Line"] = [[Тут вы не правы. Психологические заболевания часто проявляются физически. Разум неотделим от нашего тела ни на минуту - даже в бессознательном состоянии.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/31.mp3",
			["Answers"] = {
				{"Тогда что это?", 36,},
			},
		},
		[32] = {
			["Line"] = [[Вы правы!]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/32.mp3",
			["Answers"] = {
				{"..Да ладно?", 33,},
			},
		},
		[33] = {
			["Line"] = [[Гипохондрия проявляет себя всегда по-разному. Где-то человек слишком сильно обращает внимание на своё здоровье - и подначивает организм повысить чувствительность к окружающему миру, а где-то.. человек в самом деле заболевает симптомами. Без последствий реальному здоровью.

Распознать это заболевание достаточно проблематично. Вы успешно справились с задачей.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/33.mp3",
			["Answers"] = {
				{"Спасибо за возможность.", 34,},
				{"Что дальше?", 35,},
			},
		},
		[34] = {
			["Line"] = [[Вам спасибо. Продолжайте работать как работали. Время от времени, мы будем устраивать подобные проверки, где каждый из нас сможет чему-то да научиться.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/34.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Скорее бы зарплата..", "MQS Continue quest",},
			},
		},
		[35] = {
			["Line"] = [[Дальше - работа. Продолжайте в том же духе. Время от времени, мы будем устраивать подобные проверки, где каждый из нас сможет чему-то да научиться.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/35.mp3",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Скорее бы зарплата..", "MQS Continue quest",},
			},
		},
		[36] = {
			["Line"] = [[Гипохондрия проявляет себя всегда по-разному. Где-то человек слишком сильно обращает внимание на своё здоровье - и подначивает организм повысить чувствительность к окружающему миру, а где-то.. человек в самом деле заболевает симптомами. Без последствий реальному здоровью.

Распознать это заболевание достаточно проблематично. Пусть это будет небольшим, но очень важным уроком в вашей будущей карьере.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/36.mp3",
			["Answers"] = {
				{"Спасибо за урок.", 34,},
				{"Что дальше?", 35,},
			},
		},
		[37] = {
			["Line"] = [[Полагаю, у тебя много вопросов.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/37.mp3",
			["Answers"] = {
				{"Очень.", 38,},
				{"Это коррупция!", 42,},
				{"Я буду жаловаться.", 43,},
				{"У всего есть своя цена. Может быть, мы сможем договориться.", 44,},
			},
		},
		[38] = {
			["Line"] = [[К сожалению, я не смогу ответить на них все. Пришёл приказ с самого верха - выписать человека. Мы не имеем права отказаться.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/38.mp3",
			["Answers"] = {
				{"..Это урок такой?", 39,},
				{"Человек болен. Это убийство.", 39,},
				{"Это не правильно.", 39,},
			},
		},
		[39] = {
			["Line"] = [[..Иногда, нужно делать непростительные вещи. Цитата, из одной умной книги. ..Мы работаем немного по перефразированному принципу: 'иногда нужно слушаться, а не только слушать'. Это мой последний урок в этом обучении.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/39.mp3",
			["Answers"] = {
				{"Мне не нужны такие уроки.", 40,},
				{"Лицемерие.", 40,},
				{"...", 46,},
			},
		},
		[40] = {
			["Line"] = [[У нас нет выбора. У тебя же он есть - частичный. Ты можешь уйти, можешь остаться - но тебе нужно поставить подпись 'за' от своего имени в любом случае. Если ты всё-таки останешься, то мы обязательно устроим тебе повышение. Мы ценим верных сотрудников.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/40.mp3",
			["Answers"] = {
				{"Это плохо закончится..", 41,},
				{"Верных не медицине, уж точно.", 41,},
				{"Я не буду этого делать.", 47,},
			},
		},
		[41] = {
			["Line"] = [[Мне жаль.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/41.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Мне тоже.", "MQS Continue quest",},
				{"Оставь формальности. Эта жизнь на твоей совести.", "MQS Continue quest",},
			},
		},
		[42] = {
			["Line"] = [[Это Америка. Нашему медцентру необходимо финансирование. Мы не имеем права отказываться от приказов с самого верха. Нам нужно выписать человека.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/42.mp3",
			["Answers"] = {
				{"..Это урок такой?", 39,},
				{"Человек болен. Это убийство.", 39,},
				{"Это не правильно.", 39,},
			},
		},
		[43] = {
			["Line"] = [[Бесполезно. Приказы с самого верха не аннулировать даже публичной оглаской. Некоторые уже пытались, поверь. У нас нет выбора - нужно выписать человека.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/43.mp3",
			["Answers"] = {
				{"..Это урок такой?", 39,},
				{"Человек болен. Это убийство.", 39,},
				{"Это не правильно.", 39,},
			},
		},
		[44] = {
			["Line"] = [[Я рад, что мы друг друга понимаем. Увы, иногда нужно делать непростительные вещи.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/44.mp3",
			["Answers"] = {
				{"Оставь детали при себе. Это всё ещё неправильно.", 45,},
				{"Увы.", 45,},
			},
		},
		[45] = {
			["Line"] = [[..Это цитата из одной умной книги. Давай поступим как умные люди, и перефразируем принцип под наши реалии: 'иногда нужно слушаться, а не только слушать'.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/45.mp3",
			["Answers"] = {
				{"Хватит уже уроков.", 40,},
				{"Лицемерие.", 40,},
				{"...", 46,},
				{"Разумно.", 46,},
			},
		},
		[46] = {
			["Line"] = [[Поставь подпись 'за' от своего имени. Дальше - можешь делать что хочешь. Помни: мы ценим верных сотрудников - обязательно устроим тебе повышение, если останешься.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/46.mp3",
			["Answers"] = {
				{"Это плохо закончится..", 41,},
				{"Верных не медицине, уж точно.", 41,},
				{"Я не буду этого делать.", 47,},
			},
		},
		[47] = {
			["Line"] = [[Придётся.]],
			["Sound"] = "https://macnco.one/cityrp/seasonsound/season_staff/47.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Ладно.", "MQS Continue quest",},
				{"Нет.", 47,},
			},
		},
	}
}