--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/shopkeep_jewelry_quest.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["shopkeep_jewelry_quest"] = {
	name = "Продавец в ювелирном магазине",
	model = "models/cityrp/pm/suit/female_05.mdl",
	submat = {
		[4] = "models/gmodbest/suit/female/femsuit12",
		[5] = "models/gmodbest/suit/female/femsuit12",
		[6] = "models/gmodbest/suit/female/femsuit12",
	},
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {},
	sequence = "lineidle01",
	uselimit = false,
	skin = 1,
	bgr = {},
	dialogs = {
		[1] = {
			["Line"] = [[Чего вы ко мне пристали? Я требую адвоката! Суда! Покоя! Уйдите!]],
			["Sound"] = "https://macnco.one/cityrp/npcsound/shopkeep_jewelry_quest/1.mp3",
			["Answers"] = {
				{"...", "close",},
			},
		},
		[2] = {
			["Line"] = [[..Хватит на меня орать! И так непонятливо смотреть! У меня был обед, и эти простолюдины вломились и всё обнесли! И что, что я сразу поняла, кто грабитель? Руки в еде - как мне на тревожную кнопку нажать? Угнетатели! Все вы заодно!]],
			["Sound"] = "https://macnco.one/cityrp/npcsound/shopkeep_jewelry_quest/2.mp3",
			["Answers"] = {
				{"Что у вас случилось?", 3,},
				{"Не груби, иначе мы так и будем обмениваться любезностями и ничего не найдётся.", 5,},
				{"Замолчи и слушай сюда: или ты сейчас же, нормальным тоном, объясняешь ситуацию, или мы завалим тебя бумажной работой до конца твоих дней.", 6,},
			},
		},
		[3] = {
			["Line"] = [[И ты туда же! Тупые человечишки! Я не попугай повторять по пятьсот раз одно и то же! Все вы грабители - они ценностей, а вы времени! Из-за вашего бездействия сейчас уже все мусорки обнесут!]],
			["Sound"] = "https://macnco.one/cityrp/npcsound/shopkeep_jewelry_quest/3.mp3",
			["Answers"] = {
				{"Мусорки?", 4,},
			},
		},
		[4] = {
			["Line"] = [[Они кричали про какие-то мусорки. Чтоб бомжи с пистолетами пускали свои грязные руки и вонь в это прекрасное заведение? Да как вы смеете вообще такое допускать! Да я, да мы, да больше никогда..!]],
			["Sound"] = "https://macnco.one/cityrp/npcsound/shopkeep_jewelry_quest/4.mp3",
			["Answers"] = {
				{"...", "MQS Continue quest",},
				{"Спасибо за содействие.", "MQS Continue quest",},
				{"А теперь заткнись и не мешай работать.", "MQS Continue quest",},
			},
		},
		[5] = {
			["Line"] = [[И ты туда же! Я что, должна сдерживать свои чувства и копить дискомфорт в себе? Я не психолог и не подушка, чтобы не кричать когда я хочу кричать! Я буду слушать только того, кто говорит что я хочу услышать! Все вы грабители - они ценностей, а вы энергии! Вампиры чёртовы! Из-за вашего бездействия сейчас уже все мусорки обнесут!]],
			["Sound"] = "https://macnco.one/cityrp/npcsound/shopkeep_jewelry_quest/5.mp3",
			["Answers"] = {
				{"Мусорки?", 4,},
			},
		},
		[6] = {
			["Line"] = [[Да как ты смеешь повышать на меня свой никчёмный тон?! Я школу закончила полгода назад и ты не имеешь права кричать на меня, как директор или завуч! Ты кто такой? У тебя нет прав! Ты слуга народа! Всего лишь полицейский! Угнетатель! Я буду крича-а-ать!

..Из-за тебя у меня эмоциональный сбой и нервное неравновесие! Теперь мне придётся потребить больше калорий из-за стресса, иначе у меня повредится фигура! Все вы грабители - они ценностей, а вы красоты! Из-за вашего бездействия сейчас уже все мусорки обнесут!]],
			["Sound"] = "https://macnco.one/cityrp/npcsound/shopkeep_jewelry_quest/6.mp3",
			["Answers"] = {
				{"Мусорки?", 4,},
			},
		},
	}
}