--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_simple_npcs/lua/mcs_npcs/npcs/storychars.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MCS.Spawns["chapter2_slim"] = {
	name = "Слим Шейди",
	model = "models/cityrp/pm/normal/male_06.mdl",
	namepos = 80,
	theme = "Default",
	scale = 1,
	questNPC = false,
	pos = {
	},
	sequence = "lineidle04",
	uselimit = false,
	skin = 1,
	bgr = {},
	ClModels = {
	},
	dialogs = {
		[1] = {
			["Line"] = [[Чё надо?]],
			["Sound"] = "",
			["Answers"] = {
				{"Ничего.", "close",},
			},
		},
		[2] = {
			["Line"] = [[Ты как?]],
			["Sound"] = "",
			["Answers"] = {
				{"А ты как думаешь?", 3,},
				{"Больно.", 3,},
				{"Бывало и похуже.", 3,},
			},
		},
		[3] = {
			["Line"] = [[Хули, монтировка - не шутка. А тута ещё и Бифер.]],
			["Sound"] = "",
			["Answers"] = {
				{"Что вообще произошло?", 5,},
				{"Я убью его.", 4,},
			},
		},
		[4] = {
			["Line"] = [[Не надо, он уже закончился.]],
			["Sound"] = "",
			["Answers"] = {
				{"Что вообще произошло?", 5,},
			},
		},
		[5] = {
			["Line"] = [[Мы произошли, хули. Сё из-за нас.]],
			["Sound"] = "",
			["Answers"] = {
				{"Я не понимаю.", 6,},
				{"Я про общую картину.", 6,},
			},
		},
		[6] = {
			["Line"] = [[Давай тогда так: те Дезз объяснял структурность нашей.. нас, короче?]],
			["Sound"] = "",
			["Answers"] = {
				{"Нет.", 7,},
				{"Не совсем.", 7,},
				{"Он говорил слово 'картель'.", 8,},
			},
		},
		[7] = {
			["Line"] = [[В общем, нас много. Реально много. Раньше мы не только в Бруклине работали, но это уже другая история. Главная суть в общности. А как спрятать целое общество?]],
			["Sound"] = "",
			["Answers"] = {
				{"Нужно вести себя тихо.", 9,},
			},
		},
		[8] = {
			["Line"] = [[Оно всё ещё не правильное. Ассоциация? С мексами. Определение? Сговор или союз нескольких групп. С таким же успехом мы могли назваться синдикатом. Но у нас нет названия спецом шоб никто не смог нас понять. Пока призрака кличут призраком - его видят. А нас - нет.

Если-б не наше гибкое состояние - нас бы- ..В газете как-то писали про резню в Квинс. Это сё шо я скажу на данный момент.]],
			["Sound"] = "",
			["Answers"] = {
				{"Нужно вести себя тихо.", 13,},
			},
		},
		[9] = {
			["Line"] = [[Что для тебя значит 'без свидетелей'?]],
			["Sound"] = "",
			["Answers"] = {
				{"Не оставлять никого в живых.", 10,},
				{"Заставлять закрывать глаза на преступления.", 10,},
				{"Чтобы тебя никто не опознал после преступления.", 10,},
			},
		},
		[10] = {
			["Line"] = [[Нет, не-ет.. Правильный ответ - работать изначально тихо, шоб даж потенциальных не появилось. Свидетели не должны знать что они что-то заметили.]],
			["Sound"] = "",
			["Answers"] = {
				{"А как же биферы с худерами? Как же бомба?", 11,},
			},
		},
		[11] = {
			["Line"] = [[Когда пытаешься чё-то спрятать - проще это сделать на самом видном месте. У полиции нет таких слов шоб описать нашу организацию. А как без слов догадаться до идеи простому смертному?]],
			["Sound"] = "",
			["Answers"] = {
				{"Есть слово 'картель'.", 12,},
			},
		},
		[12] = {
			["Line"] = [[Оно всё ещё не правильное. Ассоциация? С мексами. Определение? Сговор или союз нескольких групп. С таким же успехом мы могли назваться синдикатом. Но у нас нет названия спецом шоб никто не смог нас понять. Пока призрака кличут призраком - его видят. А нас - нет.

Если-б не наше гибкое состояние - нас бы- ..В газете как-то писали про резню в Квинс. Это сё шо я скажу на данный момент.]],
			["Sound"] = "",
			["Answers"] = {
				{"Как спрятать целое общество на виду у всех?", 16,},
			},
		},
		[13] = {
			["Line"] = [[Что для тебя значит 'без свидетелей'?]],
			["Sound"] = "",
			["Answers"] = {
				{"Не оставлять никого в живых.", 14,},
				{"Заставлять закрывать глаза на преступления.", 14,},
				{"Чтобы тебя никто не опознал после преступления.", 14,},
			},
		},
		[14] = {
			["Line"] = [[Нет, не-ет.. Правильный ответ - работать изначально тихо, шоб даж потенциальных не появилось. Свидетели не должны знать что они что-то заметили.]],
			["Sound"] = "",
			["Answers"] = {
				{"А как же биферы с худерами? Как же бомба?", 15,},
			},
		},
		[15] = {
			["Line"] = [[Когда пытаешься чё-то спрятать - проще это сделать на самом видном месте. У полиции нет таких слов шоб описать нашу организацию. А как без слов догадаться до идеи простому смертному?]],
			["Sound"] = "",
			["Answers"] = {
				{"Как спрятать целое общество на виду у всех?", 16,},
			},
		},
		[16] = {
			["Line"] = [[Хороший вопрос. Рано или поздно вскроется. В смысле я уже сидел - каждого в нашем деле рано или поздно повяжут. Лучше позже - и на меньший срок. Опять же - нужно не давать никаких улик и поводов. С подвохом ситуация, короче.

Вэйн как-то сказанул: в шахматах понятие такое есть - 'цукцванг'. Это когда все доступные те ходы - плохие. У нас нет выбора кроме как привлечь внимание. В смысле у копов и так есть понимание о большом криминале - его надо оставить как есть.

Если не дать ребятам постреляться - копы догадаются что их кто-то примирил. А значит за ними кто-то стоит - мы, то бишь. А так, у них останется мысль только о сговоре двух мелких шаек. Местных, бруклинских. Необходимое зло, во.]],
			["Sound"] = "",
			["Answers"] = {
				{"Окей..", 17,},
				{"А как же порядок? Как контролировать ситуацию?", 17,},
			},
		},
		[17] = {
			["Line"] = [[У организаций есть структура. У картелей есть структура. У банд есть структура. У нас же есть общество. Разношёрстное общество, состоящее из разных общин. Кто-то действует грязно, кто-т на виду. Все в сговоре - от одиночек до компаний. Де юре тоже.

Порядок ставится авторитетом, согласием - не реальными рангами. Типа, у нас есть предпочитаемые роли - а так мы занимаемся всем подряд. Кто ближе к Деззу - у того больше обязанностей. От этого больше шестёрок, больше власти, и так далее.

На мне ща висит другая часть Бруклина. Надо - убиваю, надо - ограбляю. Естесно даю задания и даю понять коллегам чё как ваще происходит. У других это называется 'отчёт', если чё. А мы информируем. Эт другое.]],
			["Sound"] = "",
			["Answers"] = {
				{"Я всё ещё ничего не понимаю.", 18,},
				{"Теперь до меня дошло.", 22,},
			},
		},
		[18] = {
			["Line"] = [[Блять, как те ещё это в голову вдолбить? Мне Дезза просить?]],
			["Sound"] = "",
			["Answers"] = {
				{"Все говорят одно - а делают другое.", 19,},
				{"Всё идёт по пизде, а никак не тихо!", 19,},
				{"Странная какая-то философия. Как ни называй - всё ещё под определения существующие попадают.", 20,},
			},
		},
		[19] = {
			["Line"] = [[Добро пожаловать, хули. Первый раз?]],
			["Sound"] = "",
			["Answers"] = {
				{"Я лучше пойду.", 21,},
			},
		},
		[20] = {
			["Line"] = [[Вот пока ты так считаешь - нихуя и не узнаешь. Схема работает, не первый год - и никто блять не догадывался пока ёбаные шведы под- ..Тьфу нахуй!]],
			["Sound"] = "",
			["Answers"] = {
				{"Какие шведы? Кто бомбу придумал?", 21,},
				{"После столького криминала - и не догадываться?", 21,},
				{"Ну-ну.", 21,},
			},
		},
		[21] = {
			["Line"] = [[Слушай, я те дал ответы на вопросы. Я объяснил как мог. Дальше от нас зависит наша собсная сохранность. Как ситуация утихнет - Сутенёр-по-Имени-Прилизанный скажет чё дальше. Он локально заправляет.]],
			["Sound"] = "",
			["Answers"] = {
				{"Почему ты мне всё это говоришь?", 23,},
				{"Хорошо.", "MQS Continue quest",},
				{"Надеюсь, он чувствует себя заправщиком на все сто.", "MQS Continue quest",},
			},
		},
		[22] = {
			["Line"] = [[Я тож сначала думал - бред какой-то. В итоге чё? Мы живы. Кто мож сел, кто попал под расстрел - зато каждый избежал беспредел от легавых. Надо продолжать в том же духе, короче.]],
			["Sound"] = "",
			["Answers"] = {
				{"Все говорят одно - а получается по-другому.", 19,},
				{"Всё идёт по пизде - какой в том же духе?", 19,},
				{"Странная какая-то философия. Как ни называй - всё ещё под определения существующие попадают.", 20,},
			},
		},
		[23] = {
			["Line"] = [[Мы все слишком глубоко в дерьме шоб сдавать друг друга. Все нелегалы - лгуны-профессионалы. Не все из нас достаточно умные для правды.]],
			["Sound"] = "",
			["Answers"] = {
				{"Хорошо.", "MQS Continue quest",},
				{"Надеюсь, сутенёр чувствует себя заправщиком на все сто.", "MQS Continue quest",},
			},
		},
	}
}