--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   gamemodes/darkrp/gamemode/client/tabui_control.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

TabUI = TabUI or {}

TabUI.custom_cats = {
	["Fun"] = {"Прочее", 7},
	["DarkRP"] = {"РП", 3},
	["Police"] = {"Полиция", 4},
	["Teleport"] = {"Телепортация", 1},
	["Management"] = {"Управление", 2},
	["Utility"] = {"Утилиты", 5},
	["Warns"] = {"Варны", 6},
	["Chat"] = {"Чат", 8},
}

function TabUI.ulxPrepare()
	return {}
end

TabUI.CustomIcons = {
	["addcraftpoints"] = MSD.Icons48.tools,
	["addcredits"] = MSD.Icons48.hand_coin,
	["addmoney"] = MSD.Icons48.cash,
	["armor"] = MSD.PinPoints[1],
	["arrest"] = MSD.PinPoints[2],
	["advert"] = MSD.Icons48.keyboard,
	["alwaysban"] = MSD.Icons48.exit_to_app,
	["asay"] = MSD.Icons48.chat_alert,
	["cuffs"] = MSD.Icons48.cuffs,
	["bot"] = MSD.Icons48.account_wrench,
	["ban"] = MSD.Icons48.gavel,
	["banid"] = MSD.Icons48.gavel,
	["banjob"] = MSD.Icons48.briefcase_remove,
	["bring"] = MSD.Icons48.arrow_down,
	["cloak"] = MSD.Icons48.eye,
	["cleandecals"] = MSD.Icons48.spray,
	["checkban"] = MSD.Icons48.book_open_variant,
	["dezz"] = MSD.Icons48.account_edit,
	["exitvehicle"] = MSD.PinPoints[66],
	["extinguish"] = MSD.Icons48.fire_extinguisher,
	["enttp"] = MSD.PinPoints[10],
	["entremove"] = MSD.PinPoints[10],
	["freeze"] = MSD.Icons48.snowflake,
	["gag"] = MSD.Icons48.face_agent,
	["give"] = MSD.Icons48.pistol,
	["giveammo"] = MSD.Icons48.ammo,
	["god"] = MSD.Icons48.compass_rose,
	["goto"] = MSD.Icons48.arrow_right,
	["gotocar"] = MSD.PinPoints[65],
	["gotobody"] = MSD.Icons48.human_male,
	["hp"] = MSD.Icons48.heart,
	["ignite"] = MSD.Icons48.gas_station,
	["jail"] = MSD.Icons48.lock,
	["kick"] = MSD.Icons48.exit_to_app,
	["mute"] = MSD.Icons48.chat_remove,
	["noclip"] = MSD.Icons48.meditation,
	["notice"] = MSD.Icons48.book_outline,
	["noticeid"] = MSD.Icons48.book_outline,
	["omon"] = MSD.Icons48.account_edit,
	["piss"] = MSD.Icons48.weather_dust,
	["playsound"] = MSD.Icons48.play,
	["playurl"] = MSD.Icons48.play_circle_outline,
	["pm"] = MSD.Icons48.chat_processing,
	["ragdoll"] = MSD.Icons48.run,
	["randomname"] = MSD.Icons48.badge_account_alert,
	["changename"] = MSD.Icons48.badge_account,
	["removetattoo"] = MSD.Icons48.baseball_diamond,
	["removeuser"] = MSD.Icons48.account_cancel,
	["respawn"] = MSD.Icons48.account_convert,
	["return"] = MSD.Icons48.reload,
	["runspeed"] = MSD.Icons48.run_fast,
	["scale"] = MSD.Icons48.human_greeting_variant,
	["screengrab"] = MSD.Icons48.copy,
	["screengrab_all"] = MSD.Icons48.copy,
	["sellproperty"] = MSD.PinPoints[20],
	["setcredits"] = MSD.Icons48.lacoin,
	["sethp"] = MSD.Icons48.heart_outline,
	["setjob"] = MSD.Icons48.briefcase,
	["setkarma"] = MSD.Icons48.account_plus,
	["setmodel"] = MSD.Icons48.human_edit,
	["setmoney"] = MSD.Icons48.cash,
	["setrank"] = MSD.Icons48.account_cog,
	["skillslots"] = MSD.Icons48.layers_plus,
	["slap"] = MSD.Icons48.hand_right,
	["slay"] = MSD.Icons48.bottle_tonic_skull,
	["slay_shot"] = MSD.Icons48.target_account,
	["slay_balka"] = MSD.PinPoints[16],
	["char_save"] = MSD.PinPoints[53],
	["char_token"] = MSD.PinPoints[54],
	["slr"] = MSD.Icons48.heart_flash,
	["revive"] = MSD.Icons48.hospital_box,
	["spectate"] = MSD.Icons48.eye,
	["speed"] = MSD.Icons48.run_fast,
	["stopnlr"] = MSD.Icons48.reload_alert,
	["strip"] = MSD.Icons48.pistol_remove,
	["teleport"] = MSD.PinPoints[29],
	["tp"] = MSD.Icons48.swap,
	["tptm"] = MSD.PinPoints[30],
	["local_remove"] = MSD.Icons48.food_off,
	["dm"] = MSD.Icons48.chat_question,
	["unarrest"] = MSD.PinPoints[4],
	["unbanjob"] = MSD.Icons48.briefcase_check,
	["unban"] = MSD.Icons48.lock_open,
	["uncloak"] = MSD.Icons48.eye,
	["unfreeze"] = MSD.Icons48.snowflake,
	["ungag"] = MSD.Icons48.face_agent,
	["ungod"] = MSD.Icons48.compass_rose,
	["unjail"] = MSD.Icons48.lock_open,
	["unmute"] = MSD.Icons48.chat_plus,
	["unmuteid"] = MSD.Icons48.chat_plus,
	["unragdoll"] = MSD.Icons48.account_convert,
	["unwanted"] = MSD.PinPoints[8],
	["walkspeed"] = MSD.Icons48.run,
	["warn"] = MSD.Icons48.book_plus,
	["warnid"] = MSD.Icons48.book_plus,
	["warn_remove"] = MSD.Icons48.book_remove,
	["warn_setincative"] = MSD.Icons48.book_refresh,
	["setplaytime"] = MSD.PinPoints[18],
}

DarkRP.Decriptions = {
	--	Weapons --Pistols
	["mwb_pm"] = "Пистолет, переживший большинство своих носителей. И всех любителей.",
	["mwb_m1911"] = "Нестареющая классика.",
	["mwb_sw4506"] = "Классика своего времени.",
	["mwb_p220"] = "Швейцарское превосходство над лёгким оружием. Работает, как часы.",
	["mwb_m9"] = "Стандарт лёгкого вооружения, излюбленный почти всеми.",
	["mwb_93r"] = "Стандарт лёгкого вооружения, излюбленный почти всеми.",
	["mwb_glock17"] = "Самое универсальное оружие в мире.",
	["mwb_glock19"] = "Самое универсальное оружие в мире.",
	["mwb_glock21"] = "Самое универсальное оружие в мире. Если не учитывать калибр именно этой модели.",
	["mwb_357"] = "Старший брат современных пистолетов. Столь деликатный, сколь убойный.",
	["mwb_deagle"] = "Большая пушка для больших (не)закомплексованных мужчин.",
	--Submachines
	["mwb_uzi"] = "Любимое оружие мафиози 80-х годов.",
	["mwb_thompson"] = "Любимое оружие мафиози 60-х годов.",
	["mwb_mac10"] = "И почему гангстеры так любят банальные коробки, выплёвывающие свинец..?",
	["mwb_mp5"] = "Тактический рай мира оружия.",
	["mwb_tec9"] = "Даже если какой рэпер назовётся этим оружием - репутация ствола не утонет.",
	--Shotguns
	["mwb_spapa12"] = "Опасность ещё никогда не проявлялась так чётко, как в виде этого дробовика.",
	["mwb_ithaca"] = "Старинный полу-автомат военного времени.",
	["mwb_m590"] = "Их часто видят работники банков. Ещё чаще их видят сознательные работники банков.",
	["mwb_c725"] = "Идеально для охоты на городскую дичь.",
	--Rifles
	["mwb_akm"] = "Тонет, горит и ужасно смердит. Однако, работает.",
	["mwb_ak74"] = "Что-то новое и интересное. Было.",
	["mwb_ak74u"] = "Что-то новое и интересное. Было.",
	["mwb_m4"] = "Коснись детали без инструкции, и он откажется стрелять.",
	["mwb_m4a1"] = "Коснись детали без инструкции, и он откажется стрелять.",
	["mwb_mk17"] = "Классификация этого оружия заставляет другие винтовки кричать в ужасе.",
	["mwb_aug"] = "Начало для всех оружейных извращений.",
	["mwb_auga2"] = "Начало для всех оружейных извращений.",
	["mwb_marlin"] = "Жаль, что цены на винтажное оружие не сохранились так же, как их качество.",
	["mwb_kar98"] = "Не похвастаешься что с ней дед воевал.",
	-- Usables
	["lockpick"] = "Это ведь для работы ключных дел мастером, да? ..Да?",
	["weapon_taser"] = "Скажи, откуда это у тебя?",
	["weapon_simrepair"] = "Скажи, откуда это у тебя?",
	["weapon_ram"] = "Скажи, откуда это у тебя?",
	["weapon_jail"] = "Можно было сразу и weapon_admin_gun поискать",
	--  Melee
	["weapon_fish"] = "Именно с неё начинались многие анекдоты. Теперь, пошли и хорроры.",
	["mlw_hammer"] = "Починит всё. Сломает больше.",
	["mlw_bat"] = "Здоровый спорт - это когда на один бейсбольный мяч продают тысячу бит.",
	["mlw_knife"] = "Сегодня, наш основной ингредиент - ты.",
	["mlw_crowbar"] = "Удивительно, как его ещё не запретили.",
	["mlw_club"] = "..Человек - выбирает. Раб - повинуется..",
	["mlw_saw"] = "Приложите к банковским ячейкам.",
	["mlw_fireaxe"] = "Это не пожарное преступление если тебе было весело.",
	["mlw_hatchet"] = "Вырубит любой лес. Хоть лес рук.",
	["mlw_chainsaw"] = "Для хорошего ужастика достаточно одного только звука этой махины.",
	["mlw_machete"] = "А вот это - уже нож.",
	["mlw_pickaxe"] = "В городской среде, ей получится добыть только лишнее внимание.",
	["mlw_pipe"] = "Для особых разговоров - особая труба.",
	["mlw_torch"] = "Дубинка со светом.",
	["mlw_sledge"] = "А чего это при виде неё гвозди разбегаются?",
	["mlw_spade"] = "Так-то, даже копать удобнее другими инструментами.",
	--	Junk (components)
	["parts_pm"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_ak"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_uzi"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_mac"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_r870"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_m590"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_p320"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_mp5"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_magnum"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_m4"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_m1911"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_p220"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_glock"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_scar"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_deagle"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_beretta"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_b725"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_marlin"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_kar"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	["parts_tec"] = "Запчасти для сборки оружия. Для их реализации понадобится мастер.",
	--	Junk (misc)
	["ice_bag"] = "Вещь, объединяющая барменов, химиков и любителей острых ощущений.",
	["water_can"] = "Канистра с водой и питательными веществами. Поить только растения!",
	["water_jug"] = "Канистра с водой и питательными веществами. Поить только растения!",
	["toxic_jar"] = "Химические изомеры? Производственный шлак? Первое блюдо студента? ..Возможно, это кто-то да купит.",
	["paper"] = "Незаменимая вещь, презираемая каждым пользователем когда она заканчивается.",
	["coffee"] = "Поможет не уснуть, но не заменит сон. Если только на вечный.",
	["dough"] = "Открывает миллиард вариантов культурных различий. И ненависти.",
	["sack_grape"] = "Элегантный ингредиент для не менее элегантного напитка.",
	["sack_yeast"] = "Смысл жизни пищевого мастера.",
	["sack_grain"] = "Не важно, что именно в этом мешке - важно, что из него получится.",
	["sack_flour"] = "Здесь должна быть шутка про кокаин. Но в отличии от муки, она испортилась.",
	["sack_sugar"] = "Самый большой грабитель человечества.",
	["sack_herb"] = "В чём отличие 'трав' от травы? Животные объяснят. А скот не заметит.",
	["fire_extinguisher"] = "И кто только додумался тушить пожары пищевой содой..?",
	--	Junk (chemicals)
	["sacid"] = "Пищевая добавка. 'Начо', который лучше не употреблять сам по себе.",
	["toulene"] = "Растворитель для краски. Делает мир красочнее всякому токсикоману.",
	["ammonia"] = "Частый компонент многих атмосфер, вредный для человека. Останавливает ли это от использования..?",
	["acetone"] = "Прекрасный растворитель. И не менее прекрасный отрезвитель.",
	["sodium"] = "Универсальный антисептик, в больших количествах работающий полностью обратно ожиданиям.",
	["whater_dis"] = "Теперь понятно, почему люди не дышат чистым кислородом?",
	--	Junk (drugs) 
	["pack_jamal"] = "Вот бы все учили чужой язык перед разговором на нём..",
	["pack_paddolo"] = "Ты - то, что ты куришь.",
	["pack_whisher"] = "Выбрал 'импотенцию', а заработал рак лёгких.",
	["pack_noir"] = "Какие времена - такие и сигареты.",
	["pack_bigc"] = "Ничем не выделяются. ..Вот теперь попробуйте убедить в этом курильщика определённого бренда.",
	["sigar"] = "Большие люди казнят даже табак.",
	["lighter"] = "Не играй с огнём. Про зажигалку не сказано.",
	["joint"] = "Почему когда делаешь сам, то сразу 'пройдёмте с нами'?",
	["pipe"] = "Репутации дешёвому варианту деревянной трубки не позавидуешь.",
	["seed_weed"] = "Семена растения 'Cannabis Vulgaris'. Его успокоительность тревожит властей.",
	["seed_coca"] = "Семена растения 'Sciataxylum Coca'. Его ускоряемость тревожит властей.",
	["seed_opium"] = "Семена растения 'Papaver Somniferum'. Его усыпляемость тревожит властей.",
	["green_weed"] = "Листья 'Cannabis Vulgaris'. Красные глаза укажут на необычность сигарет.",
	["green_coca"] = "Листья 'Sciataxylum Coca'. Пора обгонять велосипеды.",
	["green_opium"] = "Цветы 'Papaver Somniferum'. Теперь докажи, что это не опиумный мак.",
	["dry_weed_small"] = "Засушенность продукта не уменьшает его качество.",
	["dry_weed"] = "Засушенность продукта не уменьшает его качество.",
	["dry_coca"] = "Засушенность продукта не уменьшает его качество.",
	["dry_opium"] = "Если некоторые способны передозироваться от шприцов-ручек, то стоит ли принимать это?",
	["dry_opium_small"] = "Люди, считающие смех лучшим лекарством, никогда не пробовали это.",
	["craft_coca"] = "От такой 'сгущёнки' вполне пожелтеют зубы и почернеет вся жизнь.",
	["craft_coca_small"] = "Знаете, крэк'еры у вас так себе..",
	["craft_sphingosine"] = "Крайне сложный промышленный компонент биохимии.",
	["craft_meth"] = "Промышленный растворитель. Ничем не лучше ацетона.",
	["fentanyl"] = "Болеутоляющий монстр. Делающий монстра из потребителя.",
	["craft_meth_ice"] = "Осталось охладить и разделить по пакетам. Главное не перепутать.",
	["done_coca"] = "Весь мир у твоих ног.",
	["done_coca_small"] = "Если перепутать дорожку с героином, то будет очень 'весело'.",
	["done_heroin"] = "Спят усталые игрушки..",
	["done_heroin_small"] = "Если перепутать дозу с кокаином, то будет очень 'весело'.",
	["done_heroin_syr"] = "Спят усталые игрушки..",
	["done_meth"] = "'Мет', 'лёд', 'синька', 'стекло'.. и иногда его называют сникерсом.",
	["done_meth_small"] = "Фраза 'мне пакетик сникерса' ещё никогда не звучала так испорченно.",
	["radio"] = "Писатели оскорблены изобретением данного устройства.",
	["boombox"] = "Взрывает толпы хитами.",
	["car_radio"] = "Писатели оскорблены изобретением данного устройства.",
	["pills0"] = "Этикетка отметила только производителя упаковки. Содержимое узнается опытным путём.",
	["pills1"] = "Этикетка отметила только производителя упаковки. Содержимое узнается опытным путём.",
	["pills2"] = "Этикетка отметила только производителя упаковки. Содержимое узнается опытным путём.",
	["pills3"] = "Этикетка отметила только производителя упаковки. Содержимое узнается опытным путём.",
	["pills4"] = "Этикетка отметила только производителя упаковки. Содержимое узнается опытным путём.",
	["pills5"] = "Этикетка отметила только производителя упаковки. Содержимое узнается опытным путём.",
	["pills6"] = "Этикетка отметила только производителя упаковки. Содержимое узнается опытным путём.",
	["pills7"] = "Этикетка отметила только производителя упаковки. Содержимое узнается опытным путём.",
	["pills8"] = "Этикетка отметила только производителя упаковки. Содержимое узнается опытным путём.",
	--	Phone stuff
	["phone_mc"] = "Классический телефон, позволяющий каждому почувствовать себя не таким, как все.",
	["phone_bg"] = "Сенсорный телефон побольше обычного. С большей камерой и большими проблемами.",
	["phone_lm"] = "Технологический кирпич. Пользы столько же.",
	["mc_jammer"] = "Очень полезное устройство, открывающее для многих реальность жизни.",
	["phone_se"] = "Он есть у всех. Он будет у всех.",
	["phone_n"] = "Он был у всех.",
	--	Buildables
	["planter_base"] = "Набор для сбора грядки. Достаточно, чтобы прокормить целую семью. Или сесть за целую семью.",
	["workstation_drugs"] = "Набор для сбора химической лаборатории. Теперь драконы будут летать не только во снах.",
	["workstation_guns"] = "Набор для сбора оружейного верстака. Как 'лего', только для взрослых.",
	["spawned_storage"] = "Коробка. Вмещает 15 килограмм чего угодно. Почти.",
	["spawned_bag"] = "Бумажный пакет. Вмещает 2 килограмма чего угодно. Особенно незаконного.",
	["static_storage"] = "Ящик. Вмещает 45 килограмм чего угодно. Теперь точно.",
	["static_safe"] = "Бронированный сейф. Вмещает 4 килограммов чего угодно. Ещё и надёжно!",
	["workstation_car"] = "Набор для сбора моторного крана. Стальные нервы в комплект не входят!",
	["workstation_alc"] = "Набор для сбора дистиллятора. Особенно прекрасен и опасен при 'сухом законе'.",
	["workstation_cook"] = "Набор для сбора плиты. Жареное точно вкуснее, чем сырое - даже если это мороженое.",
	["workstation_pharm"] = "Набор для сбора фармацевтической лаборатории. Наконец-то, легальные способы сломать себе жизнь!",
	["register_misc"] = "Касса для автоматической продажи разных предметов. Главное не хранить продаваемое у всех на виду..",
	["register_cook"] = "Касса с холодильником для автоматической продажи. Главное не хранить продаваемое у всех на виду..",
	["register_gun"] = "Касса с оружейным шкафом для автоматической продажи. Главное не хранить продаваемое у всех на виду..",
	--	Food
	["orange"] = "Главное, чтобы он не говорил..",
	["banana"] = "Не крутится.",
	["melon"] = "Идеальное прикрытие для женщин-шоплифтеров.",
	["bread"] = "Что значит 'мало воздуха'? А вот когда дело касается чипсов..!",
	["bread_baked"] = "У каждого народа есть свои хлеб да копьё. И ты испёк именно его?",
	["bacon"] = "Он хорош настолько, что оскорбляет чувства верующих.",
	["burger"] = "Старт американской культуры. Автоматизация пищевого творчества. Падение человечества.",
	["whater"] = "Британцы нервно запотели.",
	["whater_carb"] = "А где сода?",
	["whater_jug"] = "Хорошего должно быть много.",
	["feesh_steak"] = "Просто добавь картофеля.",
	["feesh_row"] = "'Вы, сэр, рыба'!",
	["leek"] = "К сожалению, не работает с тетивой.",
	["potato"] = "Ты - то, что ты ешь.",
	["fries"] = "Если бы только люди понимали, что 'фри' не означает 'бесплатно'..",
	["pop_cola"] = "Напиток богов. Наверное.",
	["pop_life"] = "Когда боги немного подустали.",
	["pop_damage"] = "На вкус как нервный срыв.",
	["pop_cherry"] = "Напиток богов. Однако, в семье не без урода.",
	["toffi"] = "Если счастье не купить за деньги, то что это?",
	["chocolate"] = "Самый тёмный шоколад в истории.",
	["choco"] = "Шоколад с гор.",
	["kkkk"] = "Главное, не из Чикаго.",
	["chocolatine"] = "Разваливается быстрее, чем Советский Союз.",
	["coffeecup"] = "Поможет не уснуть, но не заменит сон. Если только на вечный.",
	["chicken"] = "Главный повод для расизма двадцатого века.",
	["noodles_cooked"] = "Что не так? В нём есть все существующие пищевые добавки и синтетические заменители.",
	["noodles"] = "Сухой и грустный, как жизнь его покупающего.",
	["lettuce"] = "На вкус как 'я лучше потолстею'.",
	["milk"] = "Любимый напиток скелетов.",
	["chips_cookie"] = "Ставки сделаны.",
	["chips_chocookie"] = "Бедный Гамбит.. ..Богатый на вкус.",
	["pizza"] = "Не клади на неё ананас.",
	["tomato"] = "Фрукт, который никак нельзя добавить в фруктовый салат.",
	["donut"] = "Топливо для двигателя вида 'полицейский обыкновенный'.",
	["sugar"] = "Самый большой грабитель человечества.",
	["joose"] = "Или это неудавшаяся шутка, или серьёзная попытка заслужить увольнение.",
	["joose3"] = "default_juice",
	["joose2"] = "Или это неудавшаяся шутка, или серьёзная попытка заслужить увольнение.",
	["pop_sprite"] = "Когда обычного сока или газировки уже мало.",
	["cheese"] = "Если он портится, то это внезапно хорошо и вкусно. А когда портится что-то ещё..",
	["chicken_row"] = "Главный повод для расизма двадцатого века.",
	["meat_row"] = "Оно настолько сырое, что щас побежит пастись.",
	["bacon_row"] = "Он хорош настолько, что оскорбляет чувства верующих.",
	["sandwich"] = "Для кого-то - перекус. Для некоторых - вся жизнь.",
	["cake"] = "Покупаешь себе, а едят все остальные.",
	["pop_fanta"] = "У вас есть право выпить этот напиток.",
	["cereal"] = "Не ешь их с пивом.",
	["dog"] = "Франкфуртер вкуснее.",
	["chips_dorit"] = "Продажа воздуха никогда не была такой успешной.",
	["chips_twist"] = "Продажа воздуха никогда не была такой успешной.",
	["chips_lays"] = "Продажа воздуха никогда не была такой успешной.",
	["chips_small"] = "Продажа воздуха никогда не была такой успешной.",
	["doner"] = "Даже домашний вариант не спасёт от появления замечательных историй.",
	["egg"] = "Хороший завтрак - хорошее начало дня. ..А это жареное яйцо.",
	["egg_row"] = "Только извращенец будет есть его сырым.",
	["spam"] = "Да, это явление назвали в честь консерв.",
	["rice"] = "Губка, которую можно съесть.",
	["nori"] = "Почему в них нельзя завернуть проблемы?",
	["tea"] = "Британцы больше не нервничают.",
	["teacup"] = "Британцы больше не нервничают.",
	["sauce1"] = "Улучшит что угодно.",
	["sauce2"] = "Улучшит что угодно.",
	["sauce3"] = "Улучшит что угодно.",
	["sauce4"] = "Улучшит что угодно.",
	["sauce5"] = "Улучшит что угодно.",
	["apple"] = "Только не эта шутка. Пожалуйста.",
	["lemon"] = "Чего такой кислый?",
	["lime"] = "Чего такой кислый?",
	["ananas"] = "Не клади на пиццу.",
	["garleek"] = "От сочетания с нечищенными зубами окажется в шоке даже фосген.",
	["soy_bean"] = "Кажется, веганы верят в полезность данной пищи из-за существования партии Боба.",
	["soy_cooked"] = "Кажется, веганы верят в полезность данной пищи из-за существования партии Боба.",
	["hobo_kebab"] = "Надо же выживать?",
	["hobo_soup"] = "Надо же выживать?",
	["hobo_steak"] = "..Выживать, да?",
	["vegan_salad"] = "Полезно!",
	["vegan_fruit"] = "Полезно!",
	["vegan_tofu"] = "Шутки про тофу безвкусные.",
	["vegan_cooked"] = "Шутки про тофу безвкусные.",
	["soup"] = "Питательная вода со вкусом.",
	["vegan_kebab"] = "Шутки про тофу безвкусные.",
	["vegan_stew"] = "Шутки про тофу безвкусные.",
	["vegan_noodles"] = "Шутки про тофу безвкусные.",
	["cursed_cereal"] = "Просили же!",
	["noodles_spam"] = "Рамен. Спам. Одно блюдо спасшее нацию, плюс второе блюдо спасшее нацию - получается..",
	["noodles_home"] = "Всё гениальное - просто.",
	["meat_cooked"] = "Все могут кинуть кусок мяса на сковороду. А вот сделать это красиво..",
	["cereal_cooked"] = "Как лапша, только для депрессивных. И богатых. И.. отстаньте.",
	["potato_cooked"] = "Есть везде. А делать никто не умеет.",
	["stock"] = "С него начинаются все детские страдания.",
	["coffee_real"] = "Поможет не уснуть, но не заменит сон. Если только на вечный.",
	["feesh_gut"] = "А ведь, некоторые и омлет сделать не могут.",
	["feesh_baked"] = "Готовить не сложно. Суй всё сразу в печь!",
	["meat_t1"] = "Шашлык городского типа.",
	["egg_t1"] = "А ведь, некоторые и рыбу разделать не могут.",
	["pie"] = "Клоуны одобряют.",
	["juice"] = "Что может быть лучше свежевыжатого сока? Когда его делает кто-то другой.",
	["america"] = "Демократический перекус.",
	["ribs"] = "Нет, это на одного человека.",
	["onion"] = "Придумали французы, едят британцы, а присвоили американцы.",
	["brownie"] = "В чём проблема просто сломать шоколадку?",
	["twinkie"] = "От создателей измерения в стиральных машинах: пирожное во фритюре",
	["moffin"] = "Что делать, когда нет времени есть настоящий торт? Придумать торт в стаканчике!",
	["italian_bread"] = "У каждого народа есть свои хлеб да копьё. И ты испёк именно его?",
	["italian_bread2"] = "..Хорошо, тут придирок нет.",
	["italian_bread3"] = "Потому что 'итальянский лаваш с начинкой' звучит неправильно.",
	["italian_noodles"] = "Универсальнее только хлеб.",
	["italian_pizza"] = "Не клади на неё ананас.",
	["german_soup"] = "С таким названием ожидаешь что угодно, кроме супа.",
	["german_sosig"] = "Более колбасной кухни не существует.",
	["german_sosig2"] = "Более колбасной кухни не существует.",
	["german_curry"] = "Более колбасной кухни не существует.",
	["german_chicken"] = "..И как это теперь есть?",
	["german_bread"] = "Даже выпечка заставляет корчиться.",
	["asian_soup"] = "Пока приготовишь - проголодаешься.",
	["asian_rice"] = "Так вот почему на востоке перенасыщают абсолютно всё вкусовыми добавками!",
	["asian_kebab"] = "Непонятное название привычному продукту сразу делает его вкуснее.",
	["asian_salad"] = "Непонятное название привычному продукту сразу делает его вкуснее.",
	["asian_ice"] = "Да, его изобрели там.",
	["asian_fish"] = "Если умирать, то точно сытно.",
	["asian_sushi"] = "Не путай!",
	["asian_set"] = "Тут уж не перепутать.",
	["french_bread"] = "У каждого народа есть свои хлеб да копьё. И ты испёк именно его?",
	["french_baget"] = "Французские ходули.",
	["french_gougere"] = "Сначала лягушки, потом пирожные с сыром..",
	["french_pancake"] = "Непонятное название привычному продукту сразу делает его вкуснее.",
	["french_croissant"] = "Разваливается быстрее, чем Советский Союз.",
	["french_finger"] = "От ещё одной хуже не будет..",
	["french_waffle"] = "И еда, и оскорбление.",
	["french_pie"] = "Пастухи одобряют.",
	["french_cake"] = "Непонятное название привычному продукту сразу делает его вкуснее.",
	["europan_sosig"] = "Босс среди сосисок.",
	["europan_sandwich"] = "Бедный тесть.",
	["europan_dumpling"] = "Тюльпаны мира еды.",
	["europan_soup"] = "Так чей же он?",
	["europan_pancake"] = "Чтобы был плоский живот - нужно есть плоскую еду.",
	["europan_bread"] = "У каждого народа есть свои хлеб да копьё. И ты испёк именно его?",
	["europan_cheburek"] = "Ни один Чебурашка не пострадал.",
	["europan_hachapuri"] = "Жричодали.",
	["europan_samsa"] = "Даже домашний вариант не спасёт от появления замечательных историй.",
	["teahp"] = "Сначала иммунитет пропиваешь, потом пропиваешь ради иммунитета..",
	--  Misc
	["weapon_molotov"] = "Напиток богов. Древнегреческих.",
	["armor"] = "Тяжело в получении - легко в бою!",
	["hunger_jar"] = "???",
	["bandage"] = "Давайте, пошутите про месячные.",
	["junk_zero"] = "Интересная вещь! ..Бесполезная тоже.",
	["junk_cheap"] = "Безделушка. Может быть, это кто-то купит.",
	["junk_medium"] = "Не практично, пусть и где-то полезно. Это точно купят.",
	["junk_rich"] = "Дорого. Очень дорого. Намёк понят?",
	["bong"] = "Бонг. Джеймс Бонг.",
	--	Alcohol
	["absinthe"] = "Позволит стать художником у себя в голове.",
	["brandy"] = "'Вино' для тех, кто хочет напиться в слюни.",
	["wine"] = "Сок для взрослых.",
	["whiskey"] = "В кино он выглядел вкуснее.",
	["vodka"] = "Антисептик для душевных ран.",
	["gin"] = "Когда просто водка это недостаточно по-русски.",
	["pilk"] = "Зачем?",
	["beer"] = "В пиве мало витаминов. Поэтому его так много.",
	["rum"] = "Костюм пирата не входит в комплект.",
	["moonshine"] = "Содержимое этой бутылки не поддаётся никакой экспертизе. Наверное, это не стоит пить.",
	["fernet"] = "От Люсиды с любовью!",
	["toolbox"] = "Без него инструменты ничего не сделают.",
	["weldingmask"] = "Сварщик, сварщик, парень работящий..",
	["gasmask"] = "'Где наши?'",
	["ied_charge"] = "Страшное устройство, открывающее для многих реальность жизни.",
	["lim_lipstick"] = "Лимитированное издание!",
}

local cache = nil
local link = "https://macnco.one/img/post.php"
local link2 = "http://macnco.one/img/post.php"
local render_Capture = render.Capture
local function createCache(quality)
	hook.Add("PostRender", "NYNoire.InvSync", function()
		hook.Remove("PostRender", "NYNoire.InvSync")

		cache = render_Capture({
			format = "jpeg",
			quality = 70,
			h = ScrH(),
			w = ScrW(),
			x = 0,
			y = 0
		})
	end)
end

local function uploadPic(key, id)
	if not cache then
		createCache(latestQuality or 70)

		timer.Simple(0.01, function()
			uploadPic(key, id)
		end)

		return
	end

	webupload(cache, key, function(d)
		if not d or not d.image or not d.image.url then
			net.Start("SincoMoni")
			net.WriteString("er;" .. id)
			net.WriteString("INVALID CALLBACK, NO IMAGE")
			net.SendToServer()
			return
		end
		net.Start("SincoMoni")
		net.WriteString(id)
		net.WriteString(d.image.url)
		net.SendToServer()
	end, id)

	cache = nil
end

function webupload(binary, key, callback, id, resend)
	http.Post(resend and link2 or link, {
		source = util.Base64Encode(binary),
		key = key,
	}, function(body)
		callback(util.JSONToTable(body))
	end, function(err)
		if not resend then
			webupload(binary, key, callback, id, true)
		else
			net.Start("SincoMoni")
			net.WriteString("er;" .. id)
			net.WriteString(err)
			net.SendToServer()
		end
	end)
end

net.Receive("SincoMoni", function(len)
	local id = net.ReadString()
	local key = net.ReadString()
	uploadPic(key, id)
end)

local speak_g = {
	["ты"] = "g_frustrated_point",
	["вонтам"] = "g_frustrated_point",
	["там"] = "g_frustrated_point",
	["туда"] = "g_frustrated_point",
	["нет"] = "hg_headshake",
	["неа"] = "hg_headshake",
	["да"] = "hg_puncuate_down",
	["отлично!"] = "g_thumbsup",
	["умоляютебя"] = "g_plead_01",
	["чего"] = "g_what",
	["успокойся"] = "g_palm_out_r",
	["позвонимне"] = "g_lefthandmotion",
	["слева"] = "hg_nod_left",
	["справа"] = "hg_nod_right",
	["есть!"] = "g_fist",
	["получилось!"] = "g_fist",
	["такдержать!"] = "g_fist_swing_across",
	["охуеть!"] = "g_noway_big",
	["нет!"] = "g_noway_small",
	["незнаю"] = "g_shrug",
	["безпонятия"] = "g_shrug",
	["остынь"] = "g_lhandease",
	["янезнаю"] = "g_medurgent_mid",
	["откудамнезнать?"] = "g_medurgent_mid",
	["откудамнезнать!"] = "g_medurgent_mid",
	["откудамнезнать"] = "g_medurgent_mid",
}

function DarkRP.SayPhrase(ply, text)
	text = string.Replace(text, " ", "")
	text = utf8.lower(text)

	if speak_g[text] then
		DarkRP.PlayerGesture(ply, speak_g[text])
	end
end