--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/mc_ranks/lua/mc_ranks/core/sh_exam.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MRS.Exam.Test = {}
MRS.Exam.Info = {}

MRS.Exam.Test["PDcop"] = {
	[1] = {
		q = "В какой момент задержания нужно зачитывать правило Миранды?",
		a = {
			[1] = "Когда вы транспортируете задержанного в участок.",
			[2] = "Когда гражданин просит его зачитать.",
			[3] = "Сразу после того, как на подозреваемого надели наручники и его обыскали.",
			[4] = "Не надо зачитывать."
		}
	},
	[2] = {
		q = "В каких случаях разрешается игнорировать процессуальные действия из кодекса во время задержания?",
		a = {
			[1] = "При незначительных правонарушениях.",
			[2] = "При систематических нарушениях гражданина. Он уже знает свои права.",
			[3] = "Когда ситуация не позволяет произвести действия.",
			[4] = "Нельзя игнорировать кодекс."
		}
	},
	[3] = {
		q = "Можете ли вы взять своё оружие для помощи полиции в борьбе с преступниками, будучи вне службы?",
		a = {
			[1] = "Да.",
			[2] = "При одобрении начальства.",
			[3] = "Нет.",
			[4] = "Только после прохождения испытательного срока."
		}
	},
	[4] = {
		q = "По закону, где можно носить лёгкое оружие?",
		a = {
			[1] = "Где угодно, в любом виде, по любой причине. Нужно иметь возможность себя защитить согласно второй поправке в Конституцию.",
			[2] = "Где угодно, в любом виде, при наличии соответствующей лицензии.",
			[3] = "На своей территории.",
			[4] = "Зависит от ситуации. Что скажет районный администратор - так и будет."
		}
	},
	[5] = {
		q = "По закону, где можно носить тяжёлое оружие, с учётом наличия лицензии на оружие?",
		a = {
			[1] = "Оружие может попадать под запрет по закону об оружейном положении, его ношение запрещено если нет нужных лицензий.",
			[2] = "Где угодно, в закрытом (транспортируемом) виде.",
			[3] = "Оружие может попадать под запрет по закону об оружейном положении, оно запрещено если нарушает этот закон.",
			[4] = "Только на своей территории.",
		}
	},
	[6] = {
		q = "Что подразумевает под собой вторая поправка в Конституцию?",
		a = {
			[1] = "Право на ношение, хранение и использование оружия.",
			[2] = "Право на ношение, хранение и использование оружия, всего что похоже на оружие, и иных оружейных составляющих.",
			[3] = "Право на защиту себя любыми способами.",
			[4] = "Нет правильного ответа."
		}
	},
	[7] = {
		q = "Обязательно ли носить бронежилет всегда?",
		a = {
			[1] = "Да.",
			[2] = "Нет."
		}
	},
	[8] = {
		q = "Поступил вызов 9-1-1. Вы приняли вызов, прибыли на него - и тут приходит другой вызов. Второй вызов в разы более значимый, чем ваш текущий. Как поступить?",
		a = {
			[1] = "Закончу с текущим вызовом, сразу отправлюсь на второй.",
			[2] = "Передам задачу напарнику и отправлюсь на второй вызов, или наоборот.",
			[3] = "Узнаю ситуацию по рации. Потребуется помощь с вызовом - отправлюсь в качестве подмоги после решения первого вызова.",
			[4] = "Нет правильного ответа."
		}
	},
	[9] = {
		q = "В каких случаях сотруднику разрешено снимать значок?",
		a = {
			[1] = "Во время нахождения в участке.",
			[2] = "Если сотрудник занимает ранг детектива.",
			[3] = "Патрульный, находящийся под прикрытием.",
			[4] = "Нет правильного ответа."
		}
	},
	[10] = {
		q = "Что такое рация, и как правильно ей пользоваться?",
		a = {
			[1] = "Рация - средство связи, для передачи сотрудниками служебной информации; для запроса помощи; координации и докладов о своих действиях.",
			[2] = "Рация - специальное средство, для важных разговоров между сотрудниками и связи с начальством.",
			[3] = "Рация нужна чтобы попросить тест у сержанта."
		}
	},
	[11] = {
		q = "В каких ситуациях сотрудник должен использовать тен-коды?",
		a = {
			[1] = "Для передачи любой информации по рации.",
			[2] = "В полицейском участке, для кодирования посланий от преступников.",
			[3] = "Их использовать не нужно.",
			[4] = "Только при чрезвычайной ситуации, когда нет времени рассказывать подробности."
		}
	},
	[12] = {
		q = "В чём состоит Ваша задача, как офицера вспомогательной полиции?",
		a = {
			[1] = "Оказание необходимой поддержки сотрудникам Полицейского Департамента. Защита граждан и их прав.",
			[2] = "Помощь Районному Администратору, защита.",
			[3] = "Помощь гражданам.",
			[4] = "Охрана штата."
		}
	},
	[13] = {
		q = "В каких случаях выдаётся розыск?",
		a = {
			[1] = "В случае, если не удаётся поймать преступника без розыска.",
			[2] = "Если об этом попросили патрульные.",
			[3] = "В случае, когда человек совершил тяжкое преступление.",
			[4] = "Нет правильного ответа."
		}
	},
	[14] = {
		q = "Если по окончанию теста вами допущено много ошибок, и у вас не получается пройти тестирование раз за разом, то что лучше предпринять?",
		a = {
			[1] = "Продолжить повторять попытки раз за разом, до того момента, пока не повезёт с вариантом.",
			[2] = "Поинтересоваться у коллег по поводу неясных моментов.",
			[3] = "Обратиться к начальству за помощью, чтобы проверить, где были допущены ошибки.",
			[4] = "Подождать некоторое время, чтобы обдумать все свои решения."
		}
	},
	[15] = {
		q = "Как правильно обращаться к Супервайзеру?",
		a = {
			[1] = "Исполнить воинское приветствие, представиться. Уже только после обратиться.",
			[2] = "Уважительно поздороваться, представиться, вежливо обратиться.",
			[3] = "Представиться, продиктовать номер значка. Уже только после обратиться.",
			[4] = "Исполнить воинское приветствие. Уважительно поздороваться, вежливо обратиться."
		}
	},
	[16] = {
		q = "Представим ситуацию: Вы задерживаете гражданского за нарушение общественного порядка. Как вы поступите с ним дальше?",
		a = {
			[1] = "Транспортировать в участок, продолжив процессуальные действия. Выдать соответствующее наказание.",
			[2] = "Передать коллегам процессуальные действия.",
			[3] = "Выдать предупреждение. В случае, если подобное поведение продолжится - выписать штраф.",
			[4] = "Нет правильного ответа."
		}
	},
	[17] = {
		q = "Представим ситуацию: Вы поймали вора, проводите процессуальные действия. Как вы поступите с ним дальше?",
		a = {
			[1] = "Транспортировать в участок, продолжив процессуальные действия. Выдать соответствующее наказание.",
			[2] = "Передать коллегам процессуальные действия.",
			[3] = "Выдать предупреждение. В случае, если подобное поведение продолжится - выдать штраф.",
			[4] = "Нет правильного ответа."
		}
	},
	[18] = {
		q = "Отличается ли офицер-инструктор особыми привилегиями?",
		a = {
			[1] = "Нет. Это такой же сотрудник, как и другие.",
			[2] = "Да. Ведь он обучает Офицеров.",
			[3] = "Нет правильного ответа."
		}
	},
	[19] = {
		q = "В чём отличие Полицейского Департамента (ПД) от Полицейского Участка (ПУ)?",
		a = {
			[1] = "Участки функционируют в малонаселенных зонах, когда как департаменты - в крупных городах. Мы работаем в полицейском департаменте.",
			[2] = "Департамент - структура. Участок - часть структуры. Люди работают в участках на департамент.",
			[3] = "Департаментом называют работу официально, участком - в простонародье. Мы работаем и там и там, так как это одно и то же.",
			[4] = "Отличий нет."
		}
	},
	[20] = {
		q = "Что такое 'Субординация'?",
		a = {
			[1] = "Уважительное отношение в сторону офицеров старше вас по рангу (в том числе и ваших коллег), а также в сторону гражданских.",
			[2] = "Уважительное отношение в сторону офицеров старше вас по рангу.",
			[3] = "Рекомендации при общении с гражданскими."
		}
	},
	[21] = {
		q = "Нужно ли представляться при обращении к гражданину?",
		a = {
			[1] = "Только если он попросит.",
			[2] = "Нет.",
			[3] = "Да.",
			[4] = "Правильного ответа нет."
		}
	},
	[22] = {
		q = "Когда к вам обращается старший по званию сотрудник, должны ли вы исполнить воинское приветствие, а затем принять стойку смирно?",
		a = {
			[1] = "Да.",
			[2] = "Нет."
		}
	},
	[23] = {
		q = "В каком участке вы работаете?",
		a = {
			[1] = "69",
			[2] = "29",
			[3] = "92",
			[4] = "96"
		}
	},
	[24] = {
		q = "Если вина подозреваемого неоспорима и доказана, имеет ли он право на телефонный звонок?",
		a = {
			[1] = "Да.",
			[2] = "Нет.",
			[3] = "При условии, что преступление, за которое будет наказан задержанный не тяжкое."
		}
	},
	[25] = {
		q = "Нужно ли соблюдать субординацию при общении с гражданскими?",
		a = {
			[1] = "Да.",
			[2] = "Нет.",
			[3] = "Нет правильного ответа."
		}
	},
	[26] = {
		q = "В каких случаях полицейский обязан показать своё удостоверение?",
		a = {
			[1] = "При обращении к гражданскому.",
			[2] = "При первом требовании гражданского.",
			[3] = "Нет правильного ответа."
		}
	}
}

MRS.Exam.Test["PDcop2"] = {
	[1] = {
		q = "Ситуация следующая: Вы услышали звуки борьбы на последнем этаже апартаментов. Вы поднялись к нужной двери и понимаете, что они доносились из-за неё. Вдруг подбегает гражданский и предлагает взломать дверь с помощью отмычки, в качестве помощи департаменту. Ваши действия?",
		a = {
			[1] = "Соглашусь на сотрудничество.",
			[2] = "Откажусь, предупредив о запрете действий такого рода.",
			[3] = "Соглашусь, но отойду чтобы не видеть сам процесс.",
			[4] = "Нет правильного ответа."
		}
	},
	[2] = {
		q = "По рации передали информацию о вооружённом преступнике. Вы увидели похожего по ориентировке человека, но утверждать о точности вы не можете. Как поступить? ",
		a = {
			[1] = "Попытаюсь задержать.",
			[2] = "Потребую паспорт. Далее по ситуации.",
			[3] = "Задержу гражданина, объясню ситуацию, отведу его в участок для установления личности.",
			[4] = "Вызову подкрепление."
		}
	},
	[3] = {
		q = "Представьте ситуацию: перед вами труп. Человек точно умер, ему уже не помочь. Что стоит сделать с телом?",
		a = {
			[1] = "Оставить на месте.",
			[2] = "Упаковать в пластиковый пакет и спрятать в кусты.",
			[3] = "Упаковать в пластиковый пакет и передать коронерам."
		}
	},
	[4] = {
		q = "Вы наблюдаете, как вооружённый человек в магазине направил оружие на продавца. Ваши действия?",
		a = {
			[1] = "Попытаюсь нейтрализовать.",
			[2] = "Подкрадусь к грабителю, пока тот не видит, и надену на него наручники.",
			[3] = "Сниму значок, войду в помещение с тайзером наготове, буду действовать на реакцию.",
			[4] = "Вызову подкрепление."
		}
	},
	[5] = {
		q = "К вам обратился гражданский. Он сообщил о вооружённом нарушителе закона неподалёку и просит вас арестовать его. Как вы поступите?",
		a = {
			[1] = "Разыщу и поймаю преступника.",
			[2] = "Проигнорирую. Это не входит в мои обязанности.",
			[3] = "Передам коллегам по рации информацию.",
			[4] = "Нет правильного ответа."
		}
	},
	[6] = {
		q = "В каких случаях соблюдение процессуальных действий не обязательно?",
		a = {
			[1] = "В случае, если гражданин активно сопротивляется аресту и оскорбляет, игнорируя приказы.",
			[2] = "Если гражданский совершил незначительное правонарушение.",
			[3] = "Если задержанный тяжело ранен.",
			[4] = "В случае, если адвокат присутствует при задержании."
		}
	},
	[7] = {
		q = "Для чего предназначен PD канал #3 в функционале рации?",
		a = {
			[1] = "Для отдельных ситуаций.",
			[2] = "Для связи с сотрудниками Пожарного Департамента.",
			[3] = "Для связи со своим начальством."
		}
	},
	[8] = {
		q = "Укажите правильную формулировку доклада по рации.",
		a = {
			[1] = "Позывной, местоположение, ситуация.",
			[2] = "Имя Фамилия Офицера, ситуация.",
			[3] = "Ситуация, место.",
			[4] = "Нет правильного ответа."
		}
	},
	[9] = {
		q = "Какая трактовка правила Миранды верная?",
		a = {
			[1] = "Вы имеете право хранить молчание. Все, что Вы скажете может и будет использовано против Вас в суде. Вы имеете право на адвоката и на его присутствие во время допроса. Если Вы не сможете позволить себе услуги адвоката, то он будет предоставлен Вам государством. Вам ясны ваши права?",
			[2] = "Вы имеете право хранить молчание. Все, что Вы скажете может и будет использовано против Вас в суде. Вы имеете право на телефонный звонок. Вы имеете право на адвоката и на его присутствия во время допроса. Вам ясны ваши права?",
			[3] = "Вы имеете право хранить молчание. Все, что Вы скажете может и будет использовано против Вас в суде. Вы имеете право на телефон. Вы имеете право на адвоката и на его присутствие во время допроса.",
			[4] = "Вы имеете право хранить молчание. Всё, что Вы скажете может и будет использовано против Вас в суде. Вы имеете право на один телефонный звонок. Вы имеете право на присутствие адвоката во время допроса. Если Вы не можете оплатить услуги адвоката, то он будет предоставлен Вам государством. Ваши права Вам поняты?"
		}
	},
	[10] = {
		q = "Представим ситуацию: Более старший офицер дал вам приказ находиться на оцеплении. Однако ситуация выходит из под контроля. Как поступить?",
		a = {
			[1] = "Останусь на оцеплении.",
			[2] = "Отправлюсь скорее на подкрепление.",
			[3] = "Возьму оружие.",
			[4] = "Вызову подкрепление."
		}
	},
	[11] = {
		q = "Какое наказание последует за совершение преступления среднего характера?",
		a = {
			[1] = "Арест.",
			[2] = "Штраф.",
			[3] = "Арест или штраф. В зависимости от тяжести совершения преступления.",
			[4] = "Арест и штраф."
		}
	},
	[12] = {
		q = "Ситуация следующая: Вы видите гражданского c пистолетом. Нужно ли проверить его документы на наличие необходимых лицензий?",
		a = {
			[1] = "У гражданского нужно проверить лицензию. Если разрешения нет, то изъять оружие и выписать соответствующий штраф.",
			[2] = "Нет. Основания для проверки отсутствуют.",
			[3] = "Только если оружие не заводское - с модификациями.",
			[4] = "В вопросе мало информации для дачи ответа."
		}
	},
	[13] = {
		q = "Сколько может быть всего офицеров в одном патрульном экипаже?",
		a = {
			[1] = "1",
			[2] = "2",
			[3] = "3",
			[4] = "4"
		}
	},
	[14] = {
		q = "Кто является субъектами задержания?",
		a = {
			[1] = "Только сотрудник полиции и задержанный.",
			[2] = "Сотрудник полицейского департамента, задержанный, свидетели, адвокат.",
			[3] = "Задержанный, сотрудник полицейского департамента, адвокат."
		}
	},
	[15] = {
		q = "В каком случае сотрудники ПД обязаны слушать приказы районного администратора?",
		a = {
			[1] = "При отсутствии старшего состава.",
			[2] = "Когда приказы не переступают за рамки федерального закона.",
			[3] = "Ни в каком.",
			[4] = "При одобрении супервайзера."
		}
	},
	[16] = {
		q = "Поступил вызов по номеру 9-1-1. Вы приняли вызов и направились на дело. На сцене ожидает группа случайных прохожих. Что нужно сделать в первую очередь по приезде?",
		a = {
			[1] = "Узнать у близстоящих граждан, кто вызывал полицию.",
			[2] = "Достать тайзер. Вызвать подкрепление. Быть готовым.",
			[3] = "Не подавать вида, что кто-то вызвал полицию. Узнать, всё ли хорошо в округе.",
			[4] = "Задержать особо подозрительных граждан."
		}
	},
	[17] = {
		q = "По рации сообщили, что в Ратуше, в кабинете районного администратора пытаются взломать сейф. В это время, вы стоите на площади. Ваши действия?",
		a = {
			[1] = "Зайду в ратушу, отгоню посетителей за пределы здания. Дальше по ситуации.",
			[2] = "Вызову подкрепление, закрою главные двери, отгоню ближайших гражданских подальше. Дальше по ситуации.",
			[3] = "У районного администратора должна быть охрана на такой случай. Полиция занимается другими делами.",
			[4] = "Нет правильного ответа."
		}
	},
	[18] = {
		q = "Какие действия должен предпринять сотрудник при оскорблении в его сторону?",
		a = {
			[1] = "Задержать.",
			[2] = "Предупреждение. В случае непослушания - выписать штраф.",
			[3] = "Предупреждение. В случае непослушания - задержание.",
			[4] = "Арестовать."
		}
	},
	[19] = {
		q = "Какое оружие является незаконным для гражданского использования?",
		a = {
			[1] = "Тяжёлое и Автоматическое.",
			[2] = "Оружие которое попадает под закон об оружейном положение.",
			[3] = "Любое с читаемым серийным номером; огромным количеством модификаций.",
			[4] = "Зависит от ситуации. Что скажет районный администратор - так и будет."
		}
	},
	[20] = {
		q = "После сбора нужных улик, вы направились в участок для их сдачи. В какой момент вы отправите их на центральный склад улик?",
		a = {
			[1] = "Сразу, как приеду в участок.",
			[2] = "Оставлю в конфискате до окончания допроса и выноса вердикта, чтобы иметь доказательства нарушения закона. После - отправлю на центральный склад.",
			[3] = "Отправлю на центральный склад через минут 10-20 после окончания допроса.",
			[4] = "Отнесу всё старшему."
		}
	},
	[21] = {
		q = "Во время исполнения процессуального кодекса, вы находите следующие предметы у обыскиваемого: Отмычка, печенье, чипсы и 3 бутылки воды. Какие будут ваши следующие действия?",
		a = {
			[1] = "Оставлю всё на своих местах, так как ничего запрещенного у него нет. Затем продолжу процессуальные действия.",
			[2] = "Придется конфисковать отмычку, ведь это нелегальная вещь. После этого продолжу процессуальные действия.",
			[3] = "Придётся временно забрать отмычку. При доказанном факте её непричастности к нелегальным действиям, она возвращается после отпуска гражданского.",
			[4] = "Заберу все вещи у гражданского, ибо его карманы должны быть пусты."
		}
	},
	[22] = {
		q = "В случае нарушения закона, в каких случаях необходимо самостоятельно выписывать штрафы?",
		a = {
			[1] = "При нарушении любого закона, всегда.",
			[2] = "Если подозреваемого отпустят после составления протокола, а не арестуют.",
			[3] = "Когда нарушений несколько.",
			[4] = "При любом первом нарушении гражданина, вне зависимости от степени тяжести и статусе ареста."
		}
	},
	[23] = {
		q = "В каком из случаев ниже сотрудник полиции может брать ордер на обыск помещения?",
		a = {
			[1] = "Если он учуял запах чего-то запрещённого.",
			[2] = "Если он увидел оружие в кобуре у гражданского.",
			[3] = "Если сотрудник увидел, как разыскиваемый преступник забежал в помещение.",
			[4] = "Если в помещении возможно находятся наркотики."
		}
	},
	[24] = {
		q = "Каковы будут ваши действия, если вы заметите как гражданское лицо нарушает ПДД?",
		a = {
			[1] = "Сообщить о нарушении по рации. Включить мигалки, просигнализировать гражданскому об остановке. Далее действия по ситуации.",
			[2] = "Включить мигалки, просигнализировать гражданскому об остановке, сообщить об этом на радиочастоте.",
			[3] = "Попытаться остановить. В случае отказа - применить PIT маневр.",
			[4] = "Нет правильного ответа."
		}
	},
	[25] = {
		q = "Ситуация: Вы задерживаете гражданского. Вы выполняете все действия согласно руководству, но гражданский не согласен с вашим подходом. Он заявляет, что вы нарушаете Конституцию, и приводит конкретные пункты поправок в свою защиту. Что стоит сделать в такой ситуации?",
		a = {
			[1] = "Продолжить выполнять свою работу.",
			[2] = "Выписать дополнительный штраф за помеху исполнения закона.",
			[3] = "Снизить давление или вовсе отпустить нарушителя. Лучше так, нежели получить по голове от начальства.",
			[4] = "Нет правильного ответа."
		}
	},
	[26] = {
		q = "Для чего предназначен FD канал #1 в функционале рации?",
		a = {
			[1] = "Для связи с Районным Администратором.",
			[2] = "Для связи с сотрудниками Пожарного Департамента.",
			[3] = "Чтобы вызвать адвоката.",
			[4] = "Нет правильного ответа."
		}
	},
	[27] = {
		q = "В случае, если злостный нарушитель ПДД сбил человека, разрешается ли стрелять по колёсам ТС?",
		a = {
			[1] = "Да.",
			[2] = "Только если нарушитель продолжает нарушать ПДД, тем самым представляя угрозу Гражданским.",
			[3] = "При одобрении этих действий коллегами или Супервайзером.",
			[4] = "Нет."
		}
	},
	[28] = {
		q = "Представим ситуацию. Офицер задерживает гражданина. Полицейский надевает наручники, обыскивает, зачитывает правило Миранды и едет в участок. В участке проходит вторичный обыск, проводится допрос. После допроса арестовывает. Что сделал не так полицейский?",
		a = {
			[1] = "Офицер сделал все правильно.",
			[2] = "Офицер забыл инкриминировать причину задержания и последующего ареста.",
			[3] = "Офицер должен был зачитать правило Миранды до первичного обыска.",
			[4] = "Недостаточно информации для дачи ответа."
		}
	},
	[29] = {
		q = "В случае, если всех ближайших коллег на ситуации смертельно ранили, что стоит сделать?",
		a = {
			[1] = "Попытаться оказать ПМП раненным коллегам.",
			[2] = "Отступить, вызвать подкрепление, парамедиков.",
			[3] = "Сидеть в укрытии, ждать момента.",
			[4] = "Нет правильного ответа."
		}
	},
	[30] = {
		q = "Как стоит поступить в случае, если нарушитель ПДД не слушает приказов остановиться?",
		a = {
			[1] = "Начать погоню за нарушителем.",
			[2] = "Запросить подкрепление, далее по ситуации.",
			[3] = "Оба перечисленных варианта не верны."
		}
	},
	[31] = {
		q = "Если права задержанного были нарушены, что стоит предпринять?",
		a = {
			[1] = "Отпустить.",
			[2] = "Продолжить процессуальные действия.",
			[3] = "Нет правильного ответа.",
			[4] = "Передать процессуальные действия другому офицеру."
		}
	},
	[32] = {
		q = "Ситуация: Вы проводите допрос подозреваемого. Он потребовал адвоката, его запрос на звонок удовлетворили. Пришёл человек без костюма, с кривой речью, якобы с дипломом из высшего юридического университета. Ничего необычного в самих документах вы не замечаете. Как поступить с 'юристом'?",
		a = {
			[1] = "Пустить на допрос. Внешние признаки - не повод самовольничать.",
			[2] = "Не пускать шарлатана на допрос, сообщить супервайзеру.",
			[3] = "Нет правильного ответа.",
			[4] = "Узнать у Районного администратора подробности, дальше действовать по ситуации."
		}
	},
}

MRS.Exam.Test["PDtaser"] = {
	[1] = {
		q = "Представьте ситуацию: Из одиночной камеры заключения сбежал заключённый. Вы заметили, как он убегает с парковки на волю. Какое действие наиболее корректное, помимо передачи информации по рации?",
		a = {
			[1] = "Открыть огонь на поражение.",
			[2] = "Стрелять по ногам.",
			[3] = "Начну преследование с тайзером.",
			[4] = "Нет правильного ответа."
		}
	},
	[2] = {
		q = "Обязательно ли применять тайзер в сторону задержанного, во время задержания?",
		a = {
			[1] = "Только в том случае, если он ведет себя неадекватно и/или сопротивляется аресту.",
			[2] = "Во всех случаях. Применение тайзера - показатель правопорядка.",
			[3] = "Нет. Его вообще не стоит применять, ибо есть риск убить человека.",
			[4] = "Да."
		}
	},
	[3] = {
		q = "В каких случаях используется тайзер?",
		a = {
			[1] = "Во время преследования преступника; когда подозреваемый оказывает сопротивление.",
			[2] = "Для нейтрализации вооружённого подозреваемого, который оказывает угрозу жизни.",
			[3] = "Когда требуется применение силы 3 стадии.",
			[4] = "Все перечисленные варианты верны."
		}
	},
	[4] = {
		q = "На каких основаниях разрешено использование тайзера в сторону гражданских лиц?",
		a = {
			[1] = "При любом нарушении законодательства.",
			[2] = "При прямом сопротивлении.",
			[3] = "Все перечисленные варианты верны.",
			[4] = "Все перечисленные варианты неверны."
		}
	},
	[5] = {
		q = "В каких случаях используется дубинка?",
		a = {
			[1] = "В случае косвенного сопротивления подозреваемым.",
			[2] = "В случае прямого сопротивления подозреваемым.",
			[3] = "В случае когда требуется применение силы 3 стадии.",
			[4] = "При любом неправомерном поведении."
		}
	},
	[6] = {
		q = "В каких случаях используется таран?",
		a = {
			[1] = "Таран используется для выбивания дверей и замочных механизмов автомобиля.",
			[2] = "Таран используется исключительно на спец. операциях.",
			[3] = "Нет правильного ответа."
		}
	},
	[7] = {
		q = "На вас напал человек с кулаками. Какие спец. средства лучше всего применить в такой ситуации?",
		a = {
			[1] = "Использовать только тайзер.",
			[2] = "Применить только дубинку.",
			[3] = "Применить тайзер или дубинку.",
			[4] = "Спец. средства не требуются, достаточно ответа кулаками."
		}
	},
	[8] = {
		q = "На вас напал человек с клюшкой для гольфа. Какие спец. средства лучше всего применить в такой ситуации?",
		a = {
			[1] = "Использовать только тайзер.",
			[2] = "Применить только дубинку.",
			[3] = "Применить тайзер или дубинку.",
			[4] = "Обязательно применение огнестрельного оружия."
		}
	},
	[9] = {
		q = "В случаях, когда появляются сомнения какое спец. средство применить - что стоит использовать?",
		a = {
			[1] = "Тайзер.",
			[2] = "Дубинку.",
			[3] = "Перцовый баллончик.",
			[4] = "Средство с минимальными последствиями для жизни и здоровья."
		}
	},
	[10] = {
		q = "Можно ли применять спец. средство по отношению к вооруженному преступнику?",
		a = {
			[1] = "Да.",
			[2] = "Нет.",
			[3] = "В вопросе мало информации для дачи ответа."
		}
	},
	[11] = {
		q = "Каким спец. средством будет наиболее эффективно нейтрализовать преступника?",
		a = {
			[1] = "Перцовый баллончик.",
			[2] = "Тайзер.",
			[3] = "Дубинка.",
			[4] = "Средством, которое не доставит усложняющие последствия."
		}
	},
	[12] = {
		q = "Обязательно ли использовать тайзер при аресте?",
		a = {
			[1] = "Да.",
			[2] = "Нет."
		}
	}
}

MRS.Exam.Test["PDofficer"] = table.Copy(MRS.Exam.Test["PDcop2"])

MRS.Exam.Test["GUN1"] = {
	[1] = {
		q = "Какая трактовка данного принципа безопасного обращения с оружием наиболее верна?",
		a = {
			[1] = "Ставить палец на курок только когда собираешься стрелять.",
			[2] = "Ставить оружие на предохранитель когда оно не используется.",
			[3] = "Ставить палец на спусковой крючок только когда собираешься стрелять.",
			[4] = "Ставить оружие под угол когда оно не используется."
		}
	},
	[2] = {
		q = "Какая трактовка данного принципа безопасного обращения с оружием наиболее верна?",
		a = {
			[1] = "Всегда обращаться с оружием, как с заряженным.",
			[2] = "Никогда не передёргивать затвор, пока не появится прямая угроза.",
			[3] = "Всегда разряжать оружие вне использования.",
			[4] = "Никогда не заряжать оружие запрещёнными типами патронов."
		}
	},
	[3] = {
		q = "Какая трактовка данного принципа безопасного обращения с оружием наиболее верна?",
		a = {
			[1] = "Держать ситуацию под контролем, чтобы не пострадал никто лишний.",
			[2] = "Узнать ситуацию глубже перед применением оружия.",
			[3] = "Держать в прицеле только свою цель.",
			[4] = "Знать свою цель и что находится за ней."
		}
	},
	[4] = {
		q = "Какая трактовка данного принципа безопасного обращения с оружием наиболее верна?",
		a = {
			[1] = "Не направлять оружие на людей.",
			[2] = "Не направлять оружие туда, куда не собираешься стрелять.",
			[3] = "Не стрелять в безоружных.",
			[4] = "Не направлять оружие на критические участки тела и окружения."
		}
	},
	[5] = {
		q = "Куда можно стрелять в человека, наводясь на него?",
		a = {
			[1] = "Куда угодно, если это преступник.",
			[2] = "В грудь.",
			[3] = "По конечностям, чтобы не навредить органам.",
			[4] = "Зависит от ситуации."
		}
	},
	[6] = {
		q = "Стоит ли делать предупредительные выстрелы?",
		a = {
			[1] = "Да. В воздух.",
			[2] = "Да. Рядом с подозреваемым.",
			[3] = "Да. В землю, воду или другое неопасное пространство.",
			[4] = "Нет, ни при каких обстоятельствах."
		}
	},
	[7] = {
		q = "Выберите наиболее идеальный сценарий вооружённого ответа преступнику.",
		a = {
			[1] = "Точный выстрел в переносицу. Подозреваемый умрёт быстрее, чем нервная система успеет отреагировать в принципе. Такой ответ исчерпает любой урон заложникам или другим возможным жертвам.",
			[2] = "Точный выстрел в руку, держащую оружие. Оружие падает, подозреваемый не в состоянии нанести ущерб, но всё ещё может убежать. Он точно выживет.",
			[3] = "Три выстрела в грудь. Подозреваемый падает на землю, не в состоянии нанести ущерб или убежать. Подозреваемый передан парамедикам; дальнейшая его судьба неизвестна."
		}
	}
}

MRS.Exam.Test["PDprobation"] = {
	[1] = {
		q = "Какая трактовка данного принципа безопасного обращения с оружием наиболее верна?",
		a = {
			[1] = "Ставить палец на курок только когда собираешься стрелять.",
			[2] = "Ставить оружие на предохранитель когда оно не используется.",
			[3] = "Ставить палец на спусковой крючок только когда собираешься стрелять.",
			[4] = "Ставить оружие под угол когда оно не используется."
		}
	},
	[2] = {
		q = "Какая трактовка данного принципа безопасного обращения с оружием наиболее верна?",
		a = {
			[1] = "Всегда обращаться с оружием, как с заряженным.",
			[2] = "Никогда не передёргивать затвор, пока не появится прямая угроза.",
			[3] = "Всегда разряжать оружие вне использования.",
			[4] = "Никогда не заряжать оружие запрещёнными типами патронов."
		}
	},
	[3] = {
		q = "Какая трактовка данного принципа безопасного обращения с оружием наиболее верна?",
		a = {
			[1] = "Держать ситуацию под контролем, чтобы не пострадал никто лишний.",
			[2] = "Узнать ситуацию глубже перед применением оружия.",
			[3] = "Держать в прицеле только свою цель.",
			[4] = "Знать свою цель и что находится за ней."
		}
	},
	[4] = {
		q = "Какая трактовка данного принципа безопасного обращения с оружием наиболее верна?",
		a = {
			[1] = "Не направлять оружие на людей.",
			[2] = "Не направлять оружие туда, куда не собираешься стрелять.",
			[3] = "Не стрелять в безоружных.",
			[4] = "Не направлять оружие на критические участки тела и окружения."
		}
	},
	[5] = {
		q = "В чём состоит задача Офицера полиции?",
		a = {
			[1] = "Работа в патруле, арест преступников, обыски квартир.",
			[2] = "Помощь мэру, защита мэра и его старших подчинённых (районного администратора).",
			[3] = "Помощь гражданам.",
			[4] = "Охрана штата, защита прав и безопасности граждан."
		}
	},
	[6] = {
		q = "На каких основаниях разрешено открывать огонь по подозреваемому?",
		a = {
			[1] = "При побеге от офицеров.",
			[2] = "При прямолинейной угрозе офицерам/гражданам.",
			[3] = "В случае, если подозреваемый находится в розыске.",
			[4] = "Если человек уезжает на транспорте."
		}
	},
	[7] = {
		q = "В какой момент задержания нужно зачитывать правило Миранды?",
		a = {
			[1] = "Когда вы транспортируете задержанного в участок.",
			[2] = "Когда гражданин просит его зачитать.",
			[3] = "Сразу после того, как на подозреваемого надели наручники и его обыскали.",
			[4] = "Не надо зачитывать."
		}
	},
	[8] = {
		q = "Какие действия должен предпринять сотрудник при оскорблении в его сторону?",
		a = {
			[1] = "Задержать.",
			[2] = "Выписать штраф.",
			[3] = "Предупреждение; в случае непослушания - задержание.",
			[4] = "Применить тайзер/другое нелетальное спецсредство."
		}
	},
	[9] = {
		q = "Следующая ситуация: Вы видите два трупа и гражданского рядом с ними. У гражданского за спиной оружие. Ваши действия?",
		a = {
			[1] = "Надеть наручники на подозреваемого, выполнить все действия соответственно процессуальному кодексу.",
			[2] = "Надеть наручники на подозреваемого, вызвать мед. помощь, выполнить все действия соответственно процессуальному кодексу.",
			[3] = "Открыть огонь, нейтрализовать подозреваемого с оружием."
		}
	},
	[10] = {
		q = "Подозреваемый на водительском сидении в упор игнорирует требования и собирается сбежать в автомобиле. Что стоит делать?",
		a = {
			[1] = "Попытаться вышвырнуть подозреваемого из автомобиля.",
			[2] = "Стрелять в водителя.",
			[3] = "Стрелять по колёсам.",
			[4] = "Нет правильного ответа."
		}
	}
}

MRS.Exam.Test["GUN2"] = {
	[1] = {
		q = "Подозреваемый, удирающий на автомобиле, попал в ДТП с участием других людей. Вы точно знаете, что преступник вооружён. Можно ли стрелять в подозреваемого?",
		a = {
			[1] = "Да.",
			[2] = "Да, если он не выполнит требования.",
			[3] = "Да, при попытке сбежать.",
			[4] = "Нет."
		}
	},
	[2] = {
		q = "Подозреваемый пытается сбить вас на автомобиле. В автомобиле нет никого, кроме него самого. Можно ли стрелять по автомобиль?",
		a = {
			[1] = "Да.",
			[2] = "Да, если то позволяет дистанция.",
			[3] = "Нет. Нужно стрелять в колёса.",
			[4] = "Нельзя стрелять по автомобилю."
		}
	},
	[3] = {
		q = "Куда можно стрелять в человека, наводясь на него?",
		a = {
			[1] = "Куда угодно, если это преступник.",
			[2] = "В грудь.",
			[3] = "По конечностям, чтобы не навредить органам.",
			[4] = "Зависит от ситуации."
		}
	},
	[4] = {
		q = "Человек с оружием на спине стоит на крыше. Недавно с высоких точек велась стрельба. Как поступить?",
		a = {
			[1] = "Открыть огонь по человеку на крыше.",
			[2] = "Навести оружие на человека на крыше.",
			[3] = "Перейти в укрытие, сообщить коллегам по рации.",
			[4] = "Нет правильного ответа."
		}
	},
	[5] = {
		q = "Человек с оружием в руках стоит на крыше. Недавно с высоких точек велась стрельба. Как поступить?",
		a = {
			[1] = "Открыть огонь по человеку на крыше.",
			[2] = "Навести оружие на человека на крыше.",
			[3] = "Перейти в укрытие, сообщить коллегам по рации.",
			[4] = "Нет правильного ответа."
		}
	},
	[6] = {
		q = "Человек держит в руках коктейль Молотова. Есть у него зажигалка или нет - неизвестно. Как поступить?",
		a = {
			[1] = "Открыть огонь по человеку.",
			[2] = "Открыть огонь по бутылке.",
			[3] = "Навести оружие на человека, приказать положить бутылку на землю. Следить за каждым его движением.",
			[4] = "Нет правильного ответа."
		}
	},
	[7] = {
		q = "Вас, как офицера при исполнении, намеренно толкнул человек. Можно ли применять огнестрельное оружие в его сторону?",
		a = {
			[1] = "Да.",
			[2] = "Да, если это подельник подозреваемого.",
			[3] = "Только если у человека висит оружие.",
			[4] = "Достаточно применения спецсредств."
		}
	},
	[8] = {
		q = "Ситуация следующая: Вы с коллегой занимаетесь поиском преступника на крыше. Вдруг, другой человек специально сталкивает с крыши вашего товарища. Можно ли применять огнестрельное оружие в сторону толкнувшего?",
		a = {
			[1] = "Да.",
			[2] = "Да, если человек вооружён.",
			[3] = "Нет.",
			[4] = "Нет правильного ответа."
		}
	},
	[9] = {
		q = "На каких основаниях разрешено открывать огонь по подозреваемому?",
		a = {
			[1] = "При побеге от офицеров.",
			[2] = "При прямолинейной угрозе офицерам/гражданам.",
			[3] = "В случае, если подозреваемый находится в розыске.",
			[4] = "Если человек уезжает на транспорте."
		}
	},
	[10] = {
		q = "Вы наблюдаете, как вооруженный человек в магазине направил оружие на продавца. Ваши действия?",
		a = {
			[1] = "Сообщу по рации, открою огонь по грабителю.",
			[2] = "Подкрадусь к грабителю, пока тот не видит. Дам приказ, направляя оружие на преступника. Далее по ситуации.",
			[3] = "Сниму значок, войду в помещение с тайзером наготове, буду действовать на реакцию.",
			[4] = "Нет правильного ответа."
		}
	},
	[11] = {
		q = "В случае, если злостный нарушитель ПДД сбил человека, разрешается ли стрелять по колесам ТС?",
		a = {
			[1] = "Да.",
			[2] = "Только если нарушитель продолжает нарушать ПДД, тем самым представляя угрозу Гражданским.",
			[3] = "При одобрении этих действий коллегами или Супервайзером.",
			[4] = "Нет."
		}
	},
	[12] = {
		q = "На вас напал человек с кулаками. Какую стадию применения силы стоит предпринять, для наиболее лучшего исхода?",
		a = {
			[1] = "Отдать приказ остановиться.",
			[2] = "Использовать физическую силу.",
			[3] = "Применить спец. средства.",
			[4] = "Применить летальное оружие."
		}
	},
	[13] = {
		q = "В каких случаях требуется использование тяжелого оружия?",
		a = {
			[1] = "При патрулировании.",
			[2] = "Исключительно на ситуациях со стрельбой.",
			[3] = "По ситуации. Задержание особо опасных преступников, спец. операция и тп.",
			[4] = "Все перечисленные варианты верны."
		}
	},
	[14] = {
		q = "На каких основаниях разрешена стрельба по машине подозреваемого?",
		a = {
			[1] = "Игнорирование громкоговорителя, сирен, огней патрульной машины и уведомлений об остановке.",
			[2] = "Нарушение средней тяжести.",
			[3] = "Многочисленное нарушение правил дорожного движения (ПДД).",
			[4] = "Ни на каких. Нельзя стрелять по автомобилю."
		}
	},
	[15] = {
		q = "Человек бросил оружие во время погони. Можно ли стрелять в подозреваемого?",
		a = {
			[1] = "Да.",
			[2] = "Да, при невыполнении приказов офицера.",
			[3] = "Нет."
		}
	},
	[16] = {
		q = "Подозреваемый тотально игнорирует приказы офицера и без прямого сопротивления проявляет словесное недовольство. Разрешено ли наводить на подозреваемого оружие?",
		a = {
			[1] = "Да.",
			[2] = "Нет.",
			[3] = "Можно припугнуть выстрелом в воздух."
		}
	},
	[17] = {
		q = "Человек находится в розыске. По приезде офицеров он не делал ничего противозаконного, но и следовать в участок он не хочет из-за непонимания происходящего. Можно ли наводить на подозреваемого оружие?",
		a = {
			[1] = "Да.",
			[2] = "Нет, достаточно положить руку на кобуру.",
			[3] = "Нет правильного ответа."
		}
	},
	[18] = {
		q = "Подозреваемый угрожает нанести увечья вам или другому человеку. Можно ли наводить на подозреваемого оружие?",
		a = {
			[1] = "Да, если угрозы оправданы.",
			[2] = "Нет.",
			[3] = "Нельзя, пока человек не достанет огнестрельное оружие."
		}
	},
	[19] = {
		q = "Человек находится в розыске. На нём надет бронежилет, и он активно уходит от полиции. Можно ли наводить на него оружие?",
		a = {
			[1] = "Да.",
			[2] = "Нет.",
			[3] = "Нет правильного ответа."
		}
	},
	[20] = {
		q = "Является ли бронежилет поводом для наведения на человека оружия?",
		a = {
			[1] = "Да.",
			[2] = "Да, если районный администратор запретил ношение бронежилетов.",
			[3] = "Нет."
		}
	},
	[21] = {
		q = "Человек находится в розыске. Он совсем не ведёт себя как преступник и никому не угрожает. Однако, у него на поясе висит пистолет. Нужно ли наводить на человека оружие перед отдачей приказов?",
		a = {
			[1] = "Да, он находится в розыске и вооружен.",
			[2] = "Нет.",
			[3] = "В этом случае, достаточно положить руку на кобуру."
		}
	},
	[22] = {
		q = "У человека на спине висит оружие. Вы точно знаете, что у него автоматический вид стрельбы. Нужно ли наводить оружие на человека перед выдвижением требований?",
		a = {
			[1] = "Да.",
			[2] = "Нужно сразу стрелять. Невиновные не покупают запрещенное законом оружие.",
			[3] = "В этом случае, достаточно положить руку на кобуру."
		}
	},
	[23] = {
		q = "Два гражданских стреляют друг в друга, о вас они не знают. Расстояние от вас к каждому из них примерно одинаковое. Как поступить?",
		a = {
			[1] = "Открыть огонь по обоим.",
			[2] = "Объявить о приходе полиции, отдать обоим приказ бросить оружие.",
			[3] = "Запросить подмогу. Отдать обоим приказ бросить оружие.",
			[4] = "В этом случае, достаточно держать оружие наготове."
		}
	},
	[24] = {
		q = "Подозреваемый направляет оружие на другого человека. Что делать?",
		a = {
			[1] = "Стрелять в подозреваемого.",
			[2] = "Отдать приказ бросить оружие. Стрелять при неподчинении больше двух раз.",
			[3] = "Отдать приказ бросить оружие. Держать оружие наведенным на подозреваемого и принимать меры при эскалации.",
			[4] = "В этом случае, достаточно держать оружие наготове."
		}
	},
	[25] = {
		q = "Подозреваемый направляет оружие на другого человека. При этом, он закрывается заложником как живым щитом. Что делать?",
		a = {
			[1] = "Стрелять в подозреваемого, как только тот высунет голову.",
			[2] = "Отдать приказ бросить оружие. Держать оружие наведенным на подозреваемого и принимать меры при эскалации.",
			[3] = "Запросить подмогу. Отдать приказ бросить оружие. Держать оружие наведенным на подозреваемого и принимать меры при эскалации.",
			[4] = "Запросить подмогу. Отдать приказ бросить оружие. Держать оружие наведенным на подозреваемого и ждать подходящего момента для действий."
		}
	},
	[26] = {
		q = "Подозреваемый закрывается заложником как живым щитом. Он внезапно открыл огонь из огнестрельного оружия. Что делать?",
		a = {
			[1] = "Открыть огонь в ответ.",
			[2] = "Закрыться за укрытием и открыть огонь в ответ.",
			[3] = "Запросить подмогу. Закрыться за укрытием и поддерживать визуальный контакт с подозреваемым. Ждать подходящего момента для действий.",
			[4] = "Запросить подмогу. Закрыться за укрытием и принимать меры при эскалации."
		}
	},
	[27] = {
		q = "Можно ли стрелять в активного стрелка, когда рядом с ним люди?",
		a = {
			[1] = "Нет.",
			[2] = "Да, если они за стрелком.",
			[3] = "Да, если они на достаточном расстоянии.",
			[4] = "Да, если никого нет на линии огня."
		}
	},
	[28] = {
		q = "Подозреваемый направляет оружие на вас, как на офицера полиции при исполнении. Что делать?",
		a = {
			[1] = "Стрелять в подозреваемого.",
			[2] = "Отдать приказ бросить оружие. Стрелять при неподчинении больше двух раз.",
			[3] = "Отдать приказ бросить оружие. Держать оружие наведенным на подозреваемого и принимать меры при эскалации.",
			[4] = "В этом случае, достаточно держать оружие наготове."
		}
	},
	[29] = {
		q = "Человек выхватил оружие без требования офицера. Можно ли по нему открыть огонь?",
		a = {
			[1] = "Да.",
			[2] = "Да, если он направляет оружие на другого человека.",
			[3] = "Нельзя, без приказа бросить оружие.",
			[4] = "Нельзя, пока ситуация не эскалирует."
		}
	},
	[30] = {
		q = "Активный стрелок угнал автомобиль без людей. Можно ли стрелять в подозреваемого?",
		a = {
			[1] = "Да.",
			[2] = "Нет. Нужно стрелять по колесам.",
			[3] = "Да, если действие происходит в малонаселённой части Бруклина.",
			[4] = "Нет."
		}
	},
	[31] = {
		q = "Преступник запрыгнул в автомобиль с другими подозреваемыми, и они уезжают с места преступления. Можно ли стрелять в автомобиль?",
		a = {
			[1] = "Да, по головам.",
			[2] = "Да, в грудь вооруженным людям.",
			[3] = "Да, по колесам.",
			[4] = "Нет."
		}
	},
	[32] = {
		q = "Подозреваемый, удирающий на автомобиле, попал в одиночное ДТП. Рядом никого нет, внутри транспорта тоже никого - кроме самого подозреваемого. Вы точно знаете, что он вооружён. Можно ли стрелять в подозреваемого?",
		a = {
			[1] = "Да.",
			[2] = "Да, если он не выполнит требования.",
			[3] = "Да, при попытке сбежать.",
			[4] = "Нет."
		}
	}
}

MRS.Exam.Test["FD"] = {
	[1] = {
		q = "Разрешено ли хранить при себе и использовать личное оружие, будучи на смене?",
		a = {
			[1] = "Только при оформлении соответствующей лицензии.",
			[2] = "Нет, нельзя.",
			[3] = "Да, иначе это нарушение второй поправки в конституцию.",
			[4] = "Это разрешается для помощи офицерам полиции при возникновении перестрелок."
		}
	},
	[2] = {
		q = "Как близко к возгоранию должен стоять служебный транспорт?",
		a = {
			[1] = "За машиной полиции, чтобы не нарушать оцепление.",
			[2] = "Близко, дабы успешнее тушить огонь.",
			[3] = "Вне зависимости от ситуации, подальше от огня.",
			[4] = "Не имеет значения, так как пожарные машины огнеутостойчивы."
		}
	},
	[3] = {
		q = "В каких случаях стоит использовать рабочий рукав?",
		a = {
			[1] = "В любом случае. Огнетушители выдаются тем, кому не достаётся рукав.",
			[2] = "Только после повышения до звания ‘Инженер’.",
			[3] = "Для ликвидации масштабных возгораний.",
			[4] = "Нет правильного ответа."
		}
	},
	[4] = {
		q = "Когда в работу выходит ‘Энжин’, а когда ‘Ладдер’?",
		a = {
			[1] = "Они одинаковы. Это не имеет значения.",
			[2] = "‘Энжин’ нужен исключительно для тушения, когда как ‘Ладдер’ спасает своей гибкостью в чрезвычайных ситуациях.",
			[3] = "‘Энжин’ нужен для тушения обычных пожаров, а ‘Ладдер’ - для крупных.",
			[4] = "‘Энжин’ нужен для тушения крупных возгораний, а ‘Ладдер’ - для мелких."
		}
	},
	[5] = {
		q = "В каких случаях применяется СИЗОД (Средство Индивидуальной Защиты Органов Дыхания)?",
		a = {
			[1] = "При пожарах в закрытых помещениях, для первичной разведки в нём.",
			[2] = "На любом вызове. Дым вреден и на открытом воздухе.",
			[3] = "СИЗОД - обязательная часть формы пожарного. Он должен присутствовать всегда, как тайзер у полицейского.",
			[4] = "Противогаза достаточно."
		}
	},
	[6] = {
		q = "В каких случаях патрулируют пожарные?",
		a = {
			[1] = "Регулярно, для профилактики возгораний.",
			[2] = "Этим занимаются инспектора, а не младший состав батальона.",
			[3] = "В чрезвычайных ситуациях, объявленных начальством/районным администратором.",
			[4] = "Пожарные ожидают вызовов на станции. Они не должны патрулировать."
		}
	},
	[7] = {
		q = "Для чего используется рация?",
		a = {
			[1] = "Для передачи информации о вызовах и выезде на них.",
			[2] = "Для заступления на смену и выходе с неё, для сообщения о свободности.",
			[3] = "Для сообщения о любых действиях.",
			[4] = "Нет правильного ответа."
		}
	},
	[8] = {
		q = "Какой порядок действий должны выполнить пожарные, по приезде к серьёзному возгоранию?",
		a = {
			[1] = "Сразу приступить к тушению огня огнетушителями.",
			[2] = "Сделать оцепление и не пускать никого за его пределы. Если потребуется - поливать с рукава желающих посмотреть поближе.",
			[3] = "Контролировать огонь, не давать ему перейти на другие объекты. Он потухнет сам.",
			[4] = "Нет правильного ответа."
		}
	},
	[9] = {
		q = "Кто должен заниматься оцеплением пожара?",
		a = {
			[1] = "Исключительно пожарные. Это их работа.",
			[2] = "При пожаре оцепление не нужно. Какой здравомыслящий человек побежит в огонь?",
			[3] = "Исключительно полиция. Это их работа - следить за порядком.",
			[4] = "И полиция, и пожарные. Именно в таком приоритете."
		}
	},
	[10] = {
		q = "Что такое первичная разведка?",
		a = {
			[1] = "Комплекс действий, направленный на выявление возможных скрытых очагов пожара.",
			[2] = "Работа полиции перед тушением на выявление нарушителей оцепления.",
			[3] = "Комплекс мероприятий, проводимый для сбора информации о пожаре."
		}
	},
	[11] = {
		q = "Для чего нужны гидранты?",
		a = {
			[1] = "Для пополнения запаса воды при пожаротушении. Пожарная техника - всего лишь помпы.",
			[2] = "Для тушения пожара, когда пожарные не могут отреагировать на вызов.",
			[3] = "Для общей безопасности, как отметка зоны работы спасателей. Гидрант сигнализирует о наличии экстренного резервуара с водой неподалёку.",
			[4] = "Нет правильного ответа."
		}
	},
	[12] = {
		q = "Может ли инспектор командовать пожарными, парамедиками и инженерами?",
		a = {
			[1] = "Да, при отсутствии старших.",
			[2] = "Нет, не может.",
			[3] = "Может при самостоятельном вызове экстренных служб, ради эффективного координирования на сцене.",
			[4] = "Он имеет право только собирать состав ради обучения/указания на ошибки."
		}
	},
	[13] = {
		q = "Как нужно разговаривать с коллегами?",
		a = {
			[1] = "Фразами по типу ‘Никак нет’, ‘Здравия желаю’ и ‘Так точно’. Пожарный департамент неспроста сформирован военизированно, батальонами.",
			[2] = "Обычного человеческого языка достаточно.",
			[3] = "Тен-кодами, когда то позволяет ситуация.",
			[4] = "Нет правильного ответа."
		}
	},
	[14] = {
		q = "Можно ли использовать тен-коды во время работы?",
		a = {
			[1] = "Нет.",
			[2] = "Да.",
			[3] = "С разрешения старших, после проверки знаний.",
			[4] = "Только лёгкие для восприятия понятия по типу ‘код серебро’."
		}
	},
	[15] = {
		q = "Что первым делом нужно сделать при виде горящего автомобиля?",
		a = {
			[1] = "Бросить все силы на его тушение. Взрывы - не шутка.",
			[2] = "Сформировать оцепление. Такой огонь нужно контролировать, а не тушить.",
			[3] = "Закрыть автомобиль пожарной техникой. Уже она закроет собой неизбежный взрыв.",
			[4] = "Нет правильного ответа."
		}
	},
	[16] = {
		q = "Что первым делом нужно сделать при виде взорвавшегося автомобиля?",
		a = {
			[1] = "Бросить все силы на его тушение. Вдруг кто-то захочет к нему прикоснуться?",
			[2] = "Такие машины тухнут сами, их нельзя затушить своими средствами.",
			[3] = "Перекатить отлетевшие колёса к автомобилю.",
			[4] = "Нет правильного ответа."
		}
	},
	[17] = {
		q = "Сколько максимум может быть человек в экипаже пожарной машины?",
		a = {
			[1] = "2",
			[2] = "4",
			[3] = "1",
			[4] = "3"
		}
	},
	[18] = {
		q = "Как поступить с горящим человеком без сознания?",
		a = {
			[1] = "Оставить на месте. Ему уже не помочь.",
			[2] = "Оттащить тело из огня, оказать первую помощь.",
			[3] = "Оказать первую помощь на месте.",
			[4] = "Нет правильного ответа."
		}
	},
	[19] = {
		q = "Представьте ситуацию: перед вами труп. Человек точно умер, ему уже не помочь. Что стоит сделать с телом?",
		a = {
			[1] = "Оставить на месте. Само пропадёт.",
			[2] = "Упаковать в пластиковый пакет и спрятать в кусты.",
			[3] = "Упаковать в пластиковый пакет и передать парамедикам.",
			[4] = "Упаковать тело в пакет и вызвать коронеров."
		}
	},
	[20] = {
		q = "Ситуация следующая: на вас напал гражданин с кулаками. Он взбесился из-за какой-то мелочи и не отлипает от вас ни на момент. Как стоит ему ответить?",
		a = {
			[1] = "Избивать его в ответ, пока тот не потеряет сознание. Дальше вызвать полицейских и отойти на безопасное расстояние.",
			[2] = "Избивать его в ответ, пока тот не потеряет сознание. Дальше вызвать полицейских и всеми силами удерживать нарушителя на земле.",
			[3] = "Увеличить дистанцию с нападавшим и запросить подмогу.",
			[4] = "Нет правильного ответа."
		}
	},
	[21] = {
		q = "Обязан ли сотрудник пожарного департамента соблюдать ПДД будучи на смене?",
		a = {
			[1] = "Да.",
			[2] = "Только вне вызовов.",
			[3] = "Если никого нет рядом.",
			[4] = "ПДД разрешается нарушать только в случае отсутствия тяжких последствий жизни и здоровью от нарушения."
		}
	},
	[22] = {
		q = "Какой номер у пожарной станции, в которой вы работаете?",
		a = {
			[1] = "29",
			[2] = "96",
			[3] = "12",
			[4] = "47"
		}
	},
	[23] = {
		q = "В каких случаях применяется Специальный инструмент для вскрытия дверей?",
		a = {
			[1] = "Для доступа в запертые помещения, если никто не отвечает на стук.",
			[2] = "Для немедленного доступа в помещение, где происходит возгорание.",
			[3] = "Для помощи офицерам, если тем не одобряют ордер.",
			[4] = "Нет правильного ответа."
		}
	},
	[24] = {
		q = "В чём отличие инженеров от пожарных?",
		a = {
			[1] = "Инженеры занимаются технической частью, в то время как пожарные напрямую контактируют с огнём.",
			[2] = "Инженер - старший в составе пожарного звена, потому что является более опытным сотрудником.",
			[3] = "Ничем.",
			[4] = "Нет правильного ответа."
		}
	},
	[25] = {
		q = "Что вы сделаете первым делом по приезде на место, где ведётся активная стрельба?",
		a = {
			[1] = "Найду укрытие.",
			[2] = "Начну оказывать помощь пострадавшим, ведь время играет против меня.",
			[3] = "Если мне грозит опасность, то подберу оружие пострадавшего и приготовлюсь к обороне.",
			[4] = "Нет правильного ответа."
		}
	},
	[26] = {
		q = "Что вы сделаете с телом пострадавшего, когда вытащите его из горящего здания/автомобиля?",
		a = {
			[1] = "Начну оказывать помощь.",
			[2] = "Попрошу прохожих оказать потерпевшему помощь.",
			[3] = "Ничего. Продолжу тушение возгорания.",
			[4] = "Нет правильного ответа."
		}
	},
	[27] = {
		q = "Что такое вторичная разведка?",
		a = {
			[1] = "Снятие оцепления.",
			[2] = "Комплекс действий, направленный на выявление возможных скрытых очагов пожара.",
			[3] = "Комплекс мероприятий, проводимый для сбора информации о пожаре."
		}
	}
}

MRS.Exam.Test["FDmed"] = {
	[1] = {
		q = "Разрешено ли парамедикам патрулировать на машине скорой помощи?",
		a = {
			[1] = "Да, если попросили офицеры полиции/не хватает патрульных юнитов.",
			[2] = "Да, когда нечего делать на пожарной станции.",
			[3] = "Нет.",
			[4] = "Это необходимо для своевременного оказания первой помощи, ведь вызов может прийти с любого места."
		}
	},
	[2] = {
		q = "Разрешено ли хранить при себе и использовать личное оружие, будучи на смене?",
		a = {
			[1] = "Только при оформлении соответствующей лицензии.",
			[2] = "Нет, нельзя.",
			[3] = "Да, иначе это нарушение второй поправки в конституцию.",
			[4] = "Это разрешается для помощи офицерам полиции при возникновении перестрелок."
		}
	},
	[3] = {
		q = "Обязан ли сотрудник пожарного департамента соблюдать ПДД будучи на смене?",
		a = {
			[1] = "Да.",
			[2] = "Только вне вызовов.",
			[3] = "Если никого нет рядом.",
			[4] = "ПДД разрешается нарушать только в случае отсутствия тяжких последствий жизни и здоровью от нарушения."
		}
	},
	[4] = {
		q = "Какой номер у пожарной станции, в которой вы работаете?",
		a = {
			[1] = "29",
			[2] = "96",
			[3] = "12",
			[4] = "47"
		}
	},
	[5] = {
		q = "Может ли инспектор командовать пожарными, парамедиками и инженерами?",
		a = {
			[1] = "Да, при отсутствии старших.",
			[2] = "Нет, не может.",
			[3] = "Может при самостоятельном вызове экстренных служб, ради эффективного координирования на сцене.",
			[4] = "Он имеет право только собирать состав ради обучения/указания на ошибки."
		}
	},
	[6] = {
		q = "Можно ли использовать тен-коды во время работы?",
		a = {
			[1] = "Нет.",
			[2] = "Да.",
			[3] = "С разрешения старших, после проверки знаний.",
			[4] = "Только лёгкие для восприятия понятия по типу ‘код серебро’."
		}
	},
	[7] = {
		q = "Как близко к возгоранию должен стоять служебный транспорт?",
		a = {
			[1] = "На соседней улице, чтобы машина не загорелась.",
			[2] = "Близко, дабы помогать пострадавшим.",
			[3] = "За пожарной техникой. Обе техники обязаны находиться на безопасном расстоянии.",
			[4] = "Не имеет значения, так как машина скорой помощи огнеутостойчива."
		}
	},
	[8] = {
		q = "С какой целью вводится налоксон?",
		a = {
			[1] = "Для увеличения шансов приведения человека в чувство.",
			[2] = "Прекращение действия опиоидных наркотических веществ.",
			[3] = "Стимуляция организма в критических ситуациях.",
			[4] = "Это безопасное болеутоляющее."
		}
	},
	[9] = {
		q = "К вам подходит незнакомец, и просит ввести ему морфин или адреналин. Что вы будете делать?",
		a = {
			[1] = "Максимум, что можно сделать - продать препарат по рецепту.",
			[2] = "Введу препарат, ведь просто так ничего не просят.",
			[3] = "Если он сообщит о наличии травм по типу переломов, то введу нужный препарат.",
			[4] = "Откажу потенциальному наркоману."
		}
	},
	[10] = {
		q = "Для чего вводится адреналин?",
		a = {
			[1] = "Для ускорения передвижения.",
			[2] = "Чтобы привести человека в сознание.",
			[3] = "Нейтрализует кокаиновые субстанции, помогает при обморожении.",
			[4] = "Спасает при любых передозировках."
		}
	},
	[11] = {
		q = "Для чего вводится морфин?",
		a = {
			[1] = "Помогает восстановить сломанные конечности, убирает симптомы.",
			[2] = "Для восстановления уровня крови или его поддержания.",
			[3] = "Убирает последствия или симптомы от тяжёлых наркотиков.",
			[4] = "Защищает от болевого шока, позволяет игнорировать боль."
		}
	},
	[12] = {
		q = "Как определить, что именно стоит применять, при обнаружении наркотического воздействия?",
		a = {
			[1] = "Вызову полицию. Это не в компетенции парамедика.",
			[2] = "Расспросить свидетелей. Если информации нет - ввести адреналин и налоксон.",
			[3] = "Вводить поочерёдно препараты, пока ситуация не улучшится.",
			[4] = "Обращусь к супервайзеру."
		}
	},
	[13] = {
		q = "Сколько максимум может быть человек в экипаже машины скорой помощи?",
		a = {
			[1] = "2",
			[2] = "4",
			[3] = "1",
			[4] = "3"
		}
	},
	[14] = {
		q = "Представьте ситуацию: вам нужно госпитализировать пострадавшего в тяжёлом состоянии. Сам постарадавший в сознании, и отказывается ехать с вами в больницу для оказания полной медицинской помощи. Что вы сделаете?",
		a = {
			[1] = "Оставлю его на месте и уеду работать/на станцию.",
			[2] = "Заполню вместе с пострадавшим бланк об отказе в госпитализации.",
			[3] = "Доставлю пострадавшего в любом случае, даже против его воли.",
			[4] = "Сообщу о вреде подобных действий и отпущу."
		}
	},
	[15] = {
		q = "Где должны находиться парамедики вне вызова?",
		a = {
			[1] = "Патрулировать по городу в поисках пострадавших.",
			[2] = "У медицинского центра.",
			[3] = "На пожарной станции, и рядом с ней.",
			[4] = "Можно искать занятия и у медицинского центра, и у станции."
		}
	},
	[16] = {
		q = "Для чего применяется физраствор?",
		a = {
			[1] = "Стимулирует восстановление крови.",
			[2] = "В борьбе с болезнями.",
			[3] = "Восстанавливает конечности от попадания в щели питательных веществ.",
			[4] = "Он используется каждый раз при оказании первой помощи, как анестетик/подготовка тела к работе."
		}
	},
	[17] = {
		q = "Может ли парамедик проводить сложные операции в больнице?",
		a = {
			[1] = "При согласии пациента.",
			[2] = "Только если пострадавший не выживет без вмешательства.",
			[3] = "Нет.",
			[4] = "С разрешения старшего."
		}
	},
	[18] = {
		q = "Имеет ли право парамедик командовать пожарными/стажёрами?",
		a = {
			[1] = "Парамедик стоит выше по званию, соответственно может.",
			[2] = "Нет.",
			[3] = "При отсутствии старших по званию.",
			[4] = "Нет правильного ответа."
		}
	},
	[19] = {
		q = "Как поступить с горящим человеком без сознания?",
		a = {
			[1] = "Оставить на месте. Ему уже не помочь.",
			[2] = "Оттащить тело из огня, оказать первую помощь.",
			[3] = "Оказать первую помощь на месте.",
			[4] = "Нет правильного ответа."
		}
	},
	[20] = {
		q = "Человек перед вами вдруг очень тяжело задышал, потерял сознание, и не встаёт. Что нужно с ним сделать?",
		a = {
			[1] = "Ввести ему морфин. Это болевой шок.",
			[2] = "Ввести налоксон или адреналин. Это передоз.",
			[3] = "Отправить в больницу. Это болезнь.",
			[4] = "Нет правильного ответа."
		}
	},
	[21] = {
		q = "Представьте ситуацию: перед вами труп. Человек точно умер, ему уже не помочь. Что стоит сделать с телом?",
		a = {
			[1] = "Оставить на месте. Само пропадёт.",
			[2] = "Упаковать в пластиковый пакет и спрятать в кусты.",
			[3] = "Упаковать в пластиковый пакет и самостоятельно доставить в больницу.",
			[4] = "Запросить коронеров и оставить упакованное тело на месте."
		}
	},
	[22] = {
		q = "Представьте ситуацию: перед вами тело. Человек в коме, и его ещё можно привести в чувство. Что нужно для этого сделать?",
		a = {
			[1] = "Ввести каждый доступный препарат из аптечки. Они там не просто так.",
			[2] = "Осмотреть тело. При обнаружении слишком большой потери крови ничего не выйдет сделать.",
			[3] = "Дождаться приезда полиции, и только после приступать к спасению пострадавшего.",
			[4] = "Нет правильного ответа."
		}
	},
	[23] = {
		q = "Ситуация следующая: на вас напал гражданин с кулаками. Он взбесился из-за какой-то мелочи и не отлипает от вас ни на момент. Как стоит ему ответить?",
		a = {
			[1] = "Избивать его в ответ, пока тот не потеряет сознание. Дальше вызвать полицейских и отойти на безопасное расстояние.",
			[2] = "Избивать его в ответ, пока тот не потеряет сознание. Дальше вызвать полицейских и всеми силами удерживать нарушителя на земле.",
			[3] = "Попытаться успокоить человека, увеличивая с ним дистанцию; вызвать полицию.",
			[4] = "Нет правильного ответа."
		}
	},
	[24] = {
		q = "Как нужно разговаривать с коллегами?",
		a = {
			[1] = "Фразами по типу ‘Никак нет’, ‘Здравия желаю’ и ‘Так точно’. Пожарный департамент неспроста сформирован военизированно, батальонами.",
			[2] = "Обычного человеческого языка достаточно.",
			[3] = "Тен-кодами, когда то позволяет ситуация.",
			[4] = "Нет правильного ответа."
		}
	},
	[25] = {
		q = "Выберите наиболее правильный подход к оказанию первой помощи.",
		a = {
			[1] = "Порядка применения средств нет. Нужно применить каждый препарат в любом случае.",
			[2] = "Во всех случаях одинаково: бинты, физраствор, адреналин, СЛР.",
			[3] = "Во всех случаях помощь заканчивается через СЛР. Остальное зависит от контекста.",
			[4] = "Морфин спасает во всех ситуациях."
		}
	},
	[26] = {
		q = "Всегда ли обязательна госпитализация пострадавшего?",
		a = {
			[1] = "Да.",
			[2] = "Нет.",
			[3] = "Если попросили."
		}
	},
	[27] = {
		q = "Что вы сделаете первым делом по приезде на место, где ведётся активная стрельба?",
		a = {
			[1] = "Найду укрытие.",
			[2] = "Начну оказывать помощь пострадавшим, ведь время играет против меня.",
			[3] = "Если мне грозит опасность, то подберу оружие пострадавшего и приготовлюсь к обороне.",
			[4] = "Нет правильного ответа."
		}
	},
	[28] = {
		q = "Где должна располагаться машина скорой помощи в свободное от вызовов время?",
		a = {
			[1] = "В боксе.",
			[2] = "На территории у станции, она не просто так отгорожена.",
			[3] = "На концах дороги в обоих направлениях.",
			[4] = "Напротив станции по направлению движения."
		}
	},
	[29] = {
		q = "Сколько пострадавших способна госпитализировать каждая машина скорой помощи?",
		a = {
			[1] = "Одного.",
			[2] = "Двоих.",
			[3] = "Троих.",
			[4] = "Четырёх."
		}
	},
	[30] = {
		q = "Сколько бинтов необходимо накладывать на поврежденную конечность?",
		a = {
			[1] = "Один.",
			[2] = "Два, чтобы надежнее зафиксировать поврежденный участок.",
			[3] = "Три."
		}
	},
	[31] = {
		q = "Через сколько циклов СЛР можно прекращать реанимационные действия и констатировать смерть?",
		a = {
			[1] = "7-8",
			[2] = "5-6",
			[3] = "3-4",
			[4] = "1-2"
		}
	},
	[32] = {
		q = "Чем нейтрализовать передозировку от амфетаминовых веществ?",
		a = {
			[1] = "Нет правильного ответа.",
			[2] = "Адреналин.",
			[3] = "Налоксон.",
			[4] = "Морфин."
		}
	},
	[33] = {
		q = "Если поступило два вызова с одного адреса, сколько машин скорой помощи должно отправиться?",
		a = {
			[1] = "На каждый из вызовов отправляется по одной машине, потому что в одной скорой - одна каталка.",
			[2] = "Одна, при надобности будет запрошена вторая.",
			[3] = "Нет правильного ответа."
		}
	}
}

MRS.Exam.Test["PDkit"] = {
	[1] = {
		q = "С какой целью вводится налоксон?",
		a = {
			[1] = "Для увеличения шансов приведения человека в чувство.",
			[2] = "Прекращение действия опиоидных наркотических веществ.",
			[3] = "Стимуляция организма в критических ситуациях.",
			[4] = "Это безопасное болеутоляющее."
		}
	},
	[2] = {
		q = "К вам подходит незнакомец, и просит ввести ему морфин или адреналин. Что вы будете делать?",
		a = {
			[1] = "Максимум, что можно сделать - продать препарат по рецепту.",
			[2] = "Введу препарат беспрекословно.",
			[3] = "Осмотрю возможного пострадавшего. Есть значительные повреждения - выдам морфин. Нет - значит нет.",
			[4] = "Сообщу коллегам. При особо настойчивых просьбах - задержу до выяснения обстоятельств."
		}
	},
	[3] = {
		q = "Для чего вводится адреналин?",
		a = {
			[1] = "Для ускорения передвижения.",
			[2] = "Чтобы привести человека в сознание.",
			[3] = "Нейтрализует кокаиновые субстанции, помогает при обморожении.",
			[4] = "Спасает при любых передозировках."
		}
	},
	[4] = {
		q = "Для чего вводится морфин?",
		a = {
			[1] = "Помогает восстановить сломанные конечности, убирает симптомы.",
			[2] = "Для восстановления уровня крови или его поддержания.",
			[3] = "Убирает последствия или симптомы от тяжёлых наркотиков.",
			[4] = "Защищает от болевого шока, позволяет игнорировать боль."
		}
	},
	[5] = {
		q = "Как определить, что именно стоит применять, при обнаружении наркотического воздействия?",
		a = {
			[1] = "Вызову парамедиков. Это не в компетенции полицейского.",
			[2] = "Расспросить свидетелей. Если информации нет - ввести адреналин и налоксон.",
			[3] = "Вводить поочерёдно препараты, пока ситуация не улучшится.",
			[4] = "Обращусь к супервайзеру."
		}
	},
	[6] = {
		q = "При потере крови у пострадавшего. Сколько нужно наматывать бинтов на место ранения?",
		a = {
			[1] = "Одного раза хватит.",
			[2] = "Два-три раза.",
			[3] = "Пока кровотечение не прекратится.",
			[4] = "Зависит от количества пулевых ранений."
		}
	},
	[7] = {
		q = "Как поступить с горящим человеком без сознания?",
		a = {
			[1] = "Оставить на месте. Ему уже не помочь.",
			[2] = "Оттащить тело из огня, оказать первую помощь.",
			[3] = "Оказать первую помощь на месте.",
			[4] = "Нет правильного ответа."
		}
	},
	[8] = {
		q = "Человек перед вами вдруг очень тяжело задышал. Что нужно с ним сделать?",
		a = {
			[1] = "Ввести ему морфин. Это болевой шок.",
			[2] = "Ввести налоксон или адреналин. Это передоз.",
			[3] = "Отправить в больницу. Это болезнь.",
			[4] = "Нет правильного ответа."
		}
	},
	[9] = {
		q = "Представьте ситуацию: перед вами труп. Человек точно умер, ему уже не помочь. Что стоит сделать с телом?",
		a = {
			[1] = "Оставить на месте. Само пропадёт.",
			[2] = "Упаковать в пластиковый пакет и спрятать в кусты.",
			[3] = "Упаковать в пластиковый пакет и самостоятельно доставить в больницу.",
			[4] = "Упаковать в пластиковый пакет и передать парамедикам."
		}
	},
	[10] = {
		q = "Представьте ситуацию: перед вами тело. Человек в коме, и его ещё можно привести в чувство. Что нужно для этого сделать?",
		a = {
			[1] = "Ввести каждый доступный препарат из аптечки. Они там не просто так.",
			[2] = "Осмотреть тело. При обнаружении слишком большой потери крови ничего не выйдет сделать.",
			[3] = "Ввести морфин, адреналин, наложить бинты и произвести СЛР.",
			[4] = "Нет правильного ответа."
		}
	},
	[11] = {
		q = "Выберите наиболее правильный подход к оказанию первой помощи.",
		a = {
			[1] = "Порядка применения средств нет. Нужно применить каждый препарат в любом случае.",
			[2] = "Во всех случаях одинаково: бинты, физраствор, морфин, адреналин, СЛР.",
			[3] = "Во всех случаях помощь заканчивается через СЛР. Остальное зависит от контекста.",
			[4] = "Морфин спасает во всех ситуациях."
		}
	},
	[12] = {
		q = "При каком количестве проведённых СЛР человеку уже не помочь?",
		a = {
			[1] = "Более 7-8.",
			[2] = "Более 6-7.",
			[3] = "Более 5-6."
		}
	},
	[13] = {
		q = "Что предпринять при передозе кокаиновыми субстанциями?",
		a = {
			[1] = "Ввести налоксон.",
			[2] = "Оказать СЛР.",
			[3] = "Ввести адреналин.",
			[4] = "Все перечисленные варианты верны."
		}
	},
	[14] = {
		q = "Что предпринять при передозе амфетаминами?",
		a = {
			[1] = "Ввести налоксон.",
			[2] = "Ввести адреналин",
			[3] = "Оказать СЛР.",
			[4] = "Нет правильного ответа."
		}
	}
}

MRS.Exam.Test["PDcar"] = {
	[1] = {
		q = "Вам нужно транспортировать подозреваемого в участок. Как вы это сделаете?",
		a = {
			[1] = "Включу специальные огни. Пусть люди знают, что я еду по делу.",
			[2] = "Включу специальные огни и сирену. Быстрее приеду - быстрее закончу со злодеем.",
			[3] = "Не буду включать специальные огни и сирену, поеду по правилам. Тише едешь - дальше будешь.",
			[4] = "Нет правильного ответа."
		}
	},
	[2] = {
		q = "Представьте ситуацию: Вы оказали помощь подозреваемому и привели его в сознание. Однако, свободной скорой помощи нет и в ближайшее время не будет. Ваши действия?",
		a = {
			[1] = "Оставлю раненого подозреваемого на месте и уеду. Его травмы послужат хорошим уроком.",
			[2] = "Посажу раненого подозреваемого в служебный автомобиль и отвезу в больницу с включёнными специальными сигналами и сиреной.",
			[3] = "Транспортирую раненого подозреваемого в больницу. Специальные сигналы и сирену включать оснований нет.",
			[4] = "Останусь ждать парамедиков столько сколько нужно, торопиться некуда."
		}
	},
	[3] = {
		q = "Вы реагируете на вызов об убийстве. Нужно ли включать специальные огни и сирену?",
		a = {
			[1] = "Да.",
			[2] = "Нет.",
			[3] = "Достаточно только специальных огней.",
			[4] = "Да. По приближении к месту возможного преступления отключу сирену, дабы не спугнуть преступника."
		}
	},
	[4] = {
		q = "Вы прикрепились к вызову об убийстве, который поступил 45 минут назад. Нужно ли включать специальные огни и сирену?",
		a = {
			[1] = "Да.",
			[2] = "Нет.",
			[3] = "Достаточно только специальных огней.",
			[4] = "Да. По приближении к месту возможного преступления отключу сирену, дабы не спугнуть преступника."
		}
	},
	[5] = {
		q = "Вам необходимо провести траффик-стоп автомобиля. Как это правильнее сделать?",
		a = {
			[1] = "Включу огни и сирену, продолжу движение пока человек не остановится.",
			[2] = "Поравняюсь с ним и крикну из окна, чтобы прижался к обочине.",
			[3] = "Включу мигалки, обгоню его спереди и приторможу, чтобы он остановился.",
			[4] = "Включу огни и сирену, дам два коротких сигнала сиреной."
		}
	},
	[6] = {
		q = "В чем разница между длинным и коротким звуком сирены?",
		a = {
			[1] = "Различий нет.",
			[2] = "Различия в применении.",
			[3] = "Длинный звук сирены звучит громче.",
			[4] = "Короткий звук сирены звучит громче."
		}
	},
	[7] = {
		q = "Какой порог разрешённой скорости в городе?",
		a = {
			[1] = "25 миль/час",
			[2] = "30 миль/час",
			[3] = "35 миль/час"
		}
	},
	[8] = {
		q = "Когда можно использовать PIT и RAM маневры?",
		a = {
			[1] = "Когда требуется остановить разыскиваемого преступника.",
			[2] = "В случае неоднократных нарушений ПДД.",
			[3] = "При одобрении этих действий супервайзером.",
			[4] = "Никогда."
		}
	},
	[9] = {
		q = "Нужно ли останавливаться на знак 'СТОП' во время патрулирования?",
		a = {
			[1] = "Нет. Достаточно сбросить скорость на момент проезда.",
			[2] = "Необходимо выполнить полную остановку, пропустить другие машины - и только после продолжить движение.",
			[3] = "Нужно остановиться на 7-8 секунд и продолжить движение.",
			[4] = "На патрульной машине не нужно останавливаться или сбрасывать скорость."
		}
	},
	[10] = {
		q = "Подходит ли полицейский перехватчик для применения RAM маневра?",
		a = {
			[1] = "Да, только на перехватчике допустим RAM-манёвр.",
			[2] = "Нет, для RAM-манёвра требуется супервайзерский Dodge RAM.",
			[3] = "Для RAM-манёвра подходит любой служебный автомобиль."
		}
	},
	[11] = {
		q = "Есть ли у вас преимущество при пересечении перекрестка на красный сигнал светофора?",
		a = {
			[1] = "Да, ведь я на патрульном автомобиле.",
			[2] = "Нет.",
			[3] = "Только при повороте направо.",
			[4] = "Да, если включены специальные огни и сирена."
		}
	},
	[12] = {
		q = "Как выполняется PIT-манёвр?",
		a = {
			[1] = "Прямой удар кенгурятником в заднюю часть преследуемого автомобиля.",
			[2] = "Удар кенгурятником в водительскую дверь преследуемого автомобиля.",
			[3] = "Путём 'подрезания' заднего левого крыла преследуемого автомобиля правым передним крылом служебного автомобиля.",
			[4] = "PIT-манёвр выполняется при крайней необходимости в лобовом столкновении с машиной подозреваемого."
		}
	},
	[13] = {
		q = "Вы находитесь в патруле. Вдруг, по рации вас вызывает сержант к себе в кабинет. Ваши действия?",
		a = {
			[1] = "Включу специальные огни, отправлюсь к начальству.",
			[2] = "Включу специальные огни и сирену, отправлюсь к начальству.",
			[3] = "Оснований для спец-сигналов нет. Есть основание ехать на красный.",
			[4] = "Нет правильного ответа."
		}
	},
	[14] = {
		q = "Патрулируя, вы видите как автомобиль 'такси' на полной скорости разгоняется и едет в толпу людей, которые стоят на тротуаре. Имеете ли вы право применить RAM-манёвр?",
		a = {
			[1] = "Нет, у меня нет оснований.",
			[2] = "Да, нужно спасти людей.",
			[3] = "Да, при одобрении этого манёвра супервайзером."
		}
	},
	[15] = {
		q = "Патрулируя, вы видите как автомобиль на полной скорости разгоняется и едет в толпу людей, которые стоят на тротуаре. Ваши действия?",
		a = {
			[1] = "Подъеду и встану на пути водителя. Пусть удар примет служебный автомобиль.",
			[2] = "Сообщу коллегам по рации.",
			[3] = "Заранее запрошу парамедиков; оснований для активных действий нет. Придётся задержать водителя после того как он всех убьёт.",
			[4] = "Запрошу разрешение на проведение RAM-манёвра у Супервайзера."
		}
	},
	[16] = {
		q = "Обязаны ли вы останавливаться на знаке 'СТОП' с включенными специальными огнями и сиреной?",
		a = {
			[1] = "Да. Нужно провести полную остановку транспорта.",
			[2] = "Нет, продолжу движение в том же темпе.",
			[3] = "Частично. Нужно сбросить скорость и удостовериться, что другие водители проехали.",
			[4] = "На патрульной машине не нужно останавливаться или сбрасывать скорость. Особенно во время преследования."
		}
	},
	[17] = {
		q = "Вы следуете на экстренный вызов, с включёнными огнями и сиреной. Вам необходимо проехать перекресток прямо. На светофоре горит красный. Ваши действия?",
		a = {
			[1] = "Подъеду к перекрёстку, остановлюсь, дождусь зелёный сигнал светофора и продолжу движение.",
			[2] = "Проеду перекрёсток как можно скорее, вызов важнее чего бы то ни было.",
			[3] = "Подъеду к перекрёстку, сброшу скорость, убежусь что меня заметили и продолжу движение.",
			[4] = "Сообщу диспетчеру, что застрял в пробке и откреплюсь от вызова."
		}
	},
	[18] = {
		q = "Вы ведёте активное преследование автомобиля, внутри которого находится убийца. Преследование длится продолжительное время и цель явно понимает, что за ним хвост. Ваши действия?",
		a = {
			[1] = "Сообщу коллегам по рации всю необходимую информацию, сброшу скорость и буду следить за целью издалека.",
			[2] = "Прекращу активное преследование, сообщу всю необходимую информацию коллегам по рации, продолжу патрулирование.",
			[3] = "Мы не транспортное бюро, чтобы заниматься подобным. Любые преследования и погони неприемлемы.",
			[4] = "Попытаюсь остановить преступника, совершив PIT или RAM манёвр."
		}
	},
	[19] = {
		q = "Вы преследуете автомобиль внутри которого находится подозреваемый, совершивший преступление средней тяжести. Ваши действия?",
		a = {
			[1] = "Сообщу коллегам по рации всю необходимую информацию, сброшу скорость и буду следить за целью издалека.",
			[2] = "Прекращу преследование, сообщу всю необходимую информацию коллегам по рации. Застанем его врасплох позже.",
			[3] = "Попытаюсь остановить преступника, совершив PIT или RAM манёвр.",
			[4] = "Мы не транспортное бюро, чтобы заниматься подобным. Любые преследования и погони неприемлемы."
		}
	}
}

MRS.Exam.Info["PDcop"] = {
	icon = "https://macnco.one/rankup/nypd.png",
	name = "Вступительный тест на службу в полиции",
	group = "NYPD | У вас есть 10 минут на прохождение теста",
	show_res = true,
	time = 600,
	cooldown = 10800,
	fail = 3,
}

MRS.Exam.Info["PDcop2"] = {
	icon = "https://macnco.one/rankup/nypd.png",
	name = "Проверочный экзамен на вступление на испытательный срок",
	group = "NYPD | У вас есть 10 минут на прохождение теста",
	time = 600,
	cooldown = 10800,
	fail = 3,
}

MRS.Exam.Info["PDofficer"] = {
	icon = "https://macnco.one/rankup/nypd.png",
	name = "Финальный экзамен на перевод в патрульное бюро",
	group = "NYPD | У вас есть 10 минут на прохождение теста",
	time = 600,
	cooldown = 10800,
	fail = 3,
}

MRS.Exam.Info["PDtaser"] = {
	icon = "https://macnco.one/rankup/nypd.png",
	name = "Экзамен на право пользования табельными спецсредствами",
	group = "NYPD | У вас есть 15 минут на прохождение теста",
	show_res = true,
	time = 900,
	cooldown = 36000,
	fail = 1,
}

MRS.Exam.Info["GUN1"] = {
	icon = "https://macnco.one/rankup/nypd.png",
	name = "Тестирование на знание принципов безопасного обращения с оружием",
	group = "NYPD | У вас есть 6 минут на прохождение теста",
	show_res = true,
	time = 360,
	cooldown = 900,
	fail = 1,
}

MRS.Exam.Info["PDprobation"] = {
	icon = "https://macnco.one/rankup/nypd.png",
	name = "Проверочная работа на знание принципов работы полиции",
	group = "NYPD | У вас есть 6 минут на прохождение теста",
	time = 360,
	cooldown = 900,
	fail = 1,
}

MRS.Exam.Info["PDkit"] = {
	icon = "https://macnco.one/rankup/nypd.png",
	name = "Экзамен на проверку знаний первой медицинской помощи",
	group = "NYPD | У вас есть 5 минут на прохождение теста",
	show_res = true,
	time = 300,
	cooldown = 900,
	fail = 1,
}

MRS.Exam.Info["PDcar"] = {
	icon = "https://macnco.one/rankup/nypd.png",
	name = "Экзамен на право пользования полицейской техникой",
	group = "NYPD | У вас есть 10 минут на прохождение теста",
	show_res = true,
	time = 600,
	cooldown = 10800,
	fail = 2,
}

MRS.Exam.Info["GUN2"] = {
	icon = "https://macnco.one/rankup/nypd.png",
	name = "Сертификация знаний о применении оружия сотрудником полиции.",
	group = "NYPD | У вас есть 10 минут на прохождение теста",
	time = 900,
	cooldown = 10800,
	fail = 1,
}

MRS.Exam.Info["FD"] = {
	icon = "https://macnco.one/rankup/nyfd.png",
	name = "Тестирование для поступления на полноценную службу",
	show_res = true,
	group = "FDNY | У вас есть 10 минут на прохождение теста",
	time = 600,
	cooldown = 18000,
	fail = 2,
}

MRS.Exam.Info["FDmed"] = {
	icon = "https://macnco.one/rankup/nyfd.png",
	name = "Дополнительное тестирование на переход в бюро экстренной медицинской помощи (EMS)",
	show_res = true,
	group = "FDNY | У вас есть 10 минут на прохождение теста",
	time = 600,
	cooldown = 18000,
	fail = 1,
}