--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/slawer_elections/lua/slawer_elections/configuration.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

-- Languages you want to use (you can look at the available ones in the languages directory)
Slawer.Elections.CFG.Language = "ru"

Slawer.Elections.CFG.PoliticalGroups = {
	{
		name = "Без партии",
		color = Color(255, 255, 255),
		shirtid = 1,
		onset = function()
			Slawer.Mayor:UpUpgrade(1)
		end
	},
	{
		name = "Радикальная партия Боба",
		color = Color(162, 0, 255),
		shirtid = 4,
		onset = function()
			Slawer.Mayor:UpUpgrade(5)
		end
	},
	{
		name = "Республиканская",
		color = Color(240, 87, 26),
		shirtid = 3,
		onset = function()
			Slawer.Mayor:UpUpgrade(2)
		end
	},
	{
		name = "Демократическая",
		color = Color(0, 119, 255),
		shirtid = 2,
		onset = function()
			Slawer.Mayor:UpUpgrade(4)
		end
	},
	{
		name = "Коммунистическая",
		color = Color(194, 24, 24),
		shirtid = 7,
		onset = function()
		end
	},
}

Slawer.Elections.MinCandidatesToBegin = 1
Slawer.Elections.VoteFromAnywhere = true
Slawer.Elections.RegisterFromAnywhere = false
Slawer.Elections.RegistrationDuration = 300
Slawer.Elections.VotingDuration = 30
Slawer.Elections.MaxCandidates = 5
Slawer.Elections.PriceToRegister = 100

Slawer.Elections.HUDTexts = {
	[1] = "Открыта регистрация на выборы районного администратора",
}

Slawer.Elections.Blacklist = {}

Slawer.Elections.MainQuestions = {
	{
		q = "К какой партии вы бы себя отнесли?",
		a = {
			{"Демократическая", 1},
			{"Республиканская", 1},
			{"Коммунистическая", -1000},
			{"Радикальная партия Боба.", 2},
			{"Без партии.", 1},
		},
	},
	{
		q = "Какое ваше отношение к мэрии?",
		a = {
			{"Положительное", 2},
			{"Отрицательное", 1},
			{"Нейтральное", 1},
			{"Затрудняюсь ответить", 1},
		},
	},
	{
		q = "Как вы видите пост районного администратора?",
		a = {
			{"Как друга народа", 1},
			{"Как инструмент мэрии", 2},
			{"Как роль связи жителей района с высшими инстанциями", 1},
			{"Как инициатора интересных времён", 1},
			{"Как подушку безопасности", 0},
		},
	},
	{
		q = "Первым делом, на чём вы сфокусируете своё внимание?",
		a = {
			{"Сбор налогов для пополнения казны", 0},
			{"На выслушивании проблем граждан для построения дальнейшей стратегии", 2},
			{"Политическое объявление о полной работоспособности ратуши", 1},
			{"На поддержке бизнеса", 2},
			{"На вложении собственных средств в казну для стабилизации ситуации", 1},
		},
	}
}

Slawer.Elections.OtherQuestions = {
	{
		q = "Кто важнее: полиция или гражданские?",
		a = {
			{"Полиция", -1},
			{"Гражданские", 2},
			{"Все госслужащие, а не только полиция", 1},
			{"Все", 0},
		},
	},
	{
		q = "Кого наиболее выгодно облагать налогами?",
		a = {
			{"Государственные профессии", 2},
			{"Бизнесы", 2},
			{"Гражданские профессии", 0},
			{"Всех в равной мере", 1},
		},
	},
	{
		q = "По-вашему, как лучше бороться с преступностью?",
		a = {
			{"Повышением качества работы государственных служб", 1},
			{"Более доступным предоставлением благ гражданским", 2},
			{"Спонсированием полиции", 0},
			{"Легализацией контролируемых субстанций", -1000},
		},
	},
	{
		q = "Почему официальным лицам необходимо носить костюм?",
		a = {
			{"Костюм - знак цивилизации", 2},
			{"Костюм - знак власти", 0},
			{"Костюм - знак официальности", 1},
			{"Костюм - знак порядка", 2},
		},
	},
	{
		q = "Какое ваше мнение по текущему мэру Нью-Йорка?",
		a = {
			{"Очень поддерживаю реформу мистера Ревёрса", 2},
			{"Мистер Нёрс оправдывает ожидания избирателей", -1},
			{"Я не следил за работой мистера Иммёрс", -1},
			{"Не могу сказать ничего положительного про мистера Дайвёрса", -1},
			{"Мэр с работой справляется", 1},
		},
	},
	{
		q = "Какое у вас отношение к огнестрельному оружию?",
		a = {
			{"Оружие нужно ограничить для использования в крупных городах", 1},
			{"Оружие - неотъемлемое право народа, гарантированное Конституцией", 2},
			{"Оружие нужно запретить", 0},
			{"Оружие необходимо контролировать более тщательно, чтобы снизить преступность", 1},
		},
	},
	{
		q = "Как вы оцените преступность в Нью-Йорке?",
		a = {
			{"Повышенная", -1000},
			{"Она есть", 2},
			{"Ниже среднего", -1000},
			{"Не приходилось встречаться", 1},
		},
	},
	{
		q = "По-вашему, что изменит экономику к лучшему?",
		a = {
			{"Выплаты дополнительных пособий", 0},
			{"Печать денежных средств", -1},
			{"Помощь в развитии бизнеса", 1},
			{"Финансовая грамотность", 0},
			{"Введение неденежной валюты (талоны)", -1000},
		},
	},
	{
		q = "Ваше отношение к новостям?",
		a = {
			{"Хороший способ держаться в курсе событий", 0},
			{"Инструмент для заострения внимания на самом важном", 2},
			{"Новости помогают вести отчётность без нужды отчитываться", 2},
			{"Не смотрю новости", 0},
		},
	},
	{
		q = "Допустим, вы совершили серьёзную ошибку - и её подхватила общественность. Ваши действия?",
		a = {
			{"Добровольно уйду с поста", 1},
			{"Публично извинюсь. Останусь", 2},
			{"Попытаюсь исправить ситуацию", 0},
		},
	},
	{
		q = "Считаете ли вы федеральный закон штата успешным?",
		a = {
			{"Да", 1},
			{"Нет", 0},
			{"Затрудняюсь ответить", 1},
			{"В нём нужно больше точностей", -2},
		},
	},
	{
		q = "По-вашему, в чём заключается роль Департамента Закона?",
		a = {
			{"В достижении юридической справедливости", 3},
			{"В работе над законом", 0},
			{"В государственной документации, юридическом представлении народа", 1},
			{"В том же, в чём суть Адвокатской Палаты", 1},
		},
	},
	{
		q = "Как вы оцените ситуацию вашего района?",
		a = {
			{"Прекрасная", 1},
			{"Может быть и лучше", 1},
			{"Плохая", 1},
			{"Району нужны большие изменения", 2},
		},
	},
	{
		q = "Каким вы видите ваш район через год?",
		a = {
			{"Таким же хорошим", 0},
			{"Таким же", 1},
			{"Таким же упадочным", 0},
			{"Решать не мне", -2},
		},
	},
	{
		q = "Каково ваше отношение к Конституции США?",
		a = {
			{"Конституция - лучшее, что нам оставили отцы-основатели", 1},
			{"В ней много несоответствий. Ей нужны поправки", 2},
			{"В ней много несоответствий. Для уточнений нужен закон", 3},
			{"Нейтральное", 1},
			{"Конституция не работает", 0},
		},
	},
}