--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/health/lua/mc_haes/core/sh_init.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

MES.gunz = {
	["mwb_ak74"] = {"пулей 5.45 мм", "винтовка"},
	["mwb_ak74u"] = {"пулей 5.45 мм", "винтовка"},
	["mwb_akm"] = {"пулей 7.62 мм", "винтовка"},
	["mwb_m4"] = {"пулей 5.56 мм", "винтовка"},
	["mwb_m4a1"] = {"пулей 5.56 мм", "винтовка"},
	["mwb_aug"] = {"пулей 5.56 мм", "винтовка"},
	["mwb_auga2"] = {"пулей 5.56 мм", "винтовка"},
	["police_m4"] = {"пулей 5.56 мм", "винтовка"},
	["police_mk18"] = {"пулей 5.56 мм", "винтовка"},
	["mwb_mk17"] = {"пулей 7.62 мм", "винтовка"},
	["police_mk20"] = {"пулей 7.62 мм", "длинноствольная винтовка"},
	["mwb_kar98"] = {"пулей 7.92 мм", "длинноствольная винтовка"},
	["mwb_m9"] = {"пулей 9мм", "пистолет или п.п."},
	["mwb_93r"] = {"пулей 9мм", "пистолет или п.п."},
	["mwb_deagle"] = {"пулей калибра .50 AE", "длинноствольный пистолет"},
	["mwb_glock21"] = {"пулей калибра .45 ACP", "пистолет"},
	["mwb_glock17"] = {"пулей 9мм", "пистолет"},
	["mwb_glock19"] = {"пулей 9мм", "пистолет"},
	["mwb_p220"] = {"пулей 10мм", "пистолет"},
	["police_glock"] = {"пулей 9мм", "пистолет"},
	["police_sw"] = {"пулей 9мм", "пистолет"},
	["mwb_m1911"] = {"пулей калибра .45 ACP", "пистолет"},
	["mwb_sw4506"] = {"пулей калибра .45 ACP", "пистолет"},
	["mwb_thompson"] = {"пулей калибра .45 ACP", "пистолет или п.п."},
	["mwb_mac10"] = {"пулей калибра .45 ACP", "пистолет или п.п."},
	["mwb_357"] = {"пулей калибра .357", "пистолет"},
	["mwb_marlin"] = {"пулей калибра .357", "винтовка"},
	["mwb_pm"] = {"пулей 9мм", "пистолет"},
	["mwb_m590"] = {"картечью", "гладкоствольный дробовик"},
	["mwb_ithaca"] = {"картечью", "гладкоствольный дробовик"},
	["police_m590"] = {"картечью", "гладкоствольный дробовик"},
	["police_beanbag"] = {"травматическим снарядом", "гладкоствольный дробовик"},
	["mwb_spapa12"] = {"картечью", "гладкоствольный дробовик"},
	["mwb_c725"] = {"картечью", "гладкоствольный дробовик"},
	["police_mp5"] = {"пулей 9мм", "пистолет или п.п."},
	["mwb_mp5"] = {"пулей 9мм", "пистолет или п.п."},
	["mwb_uzi"] = {"пулей 9мм", "пистолет или п.п."},
	["mwb_tec9"] = {"пулей 9мм", "пистолет или п.п."},
}

MES.melee = {
	["keys"] = {"Многочисленные ушибы, ссадины", "Ушибы, ссадины - %s"},
	["mlw_pipe"] = {"Удар тупым предметом", "Ушибы, ссадины от удара тупым предметом - %s"},
	["mlw_hatchets"] = {"Рубленая рана", "Рубленые раны - %s"},
	["mlw_briefcase"] = {"Удар тупым предметом", "Ушибы, ссадины от удара тупым предметом - %s"},
	["mlw_fireaxe"] = {"Рубленая рана", "Рубленые раны - %s"},
	["mlw_knife"] = {"Колото-резаная рана", "Колото-резаные раны - %s"},
	["mlw_hammer"] = {"Удар тупым предметом", "Ушибы, ссадины от удара тупым предметом - %s"},
	["mlw_machete"] = {"Колото-резаная рана", "Колото-резаные раны - %s"},
	["mlw_spade"] = {"Рубленая рана", "Рубленые раны - %s"},
	["mlw_crowbar"] = {"Колото-резаная рана", "Колото-резаные раны - %s"},
	["mlw_sledge"] = {"Удар тупым предметом", "Ушибы, ссадины от удара тупым тяжелым предметом - %s"},
	["mlw_club"] = {"Удар тупым предметом", "Ушибы, ссадины от удара тупым предметом - %s"},
	["mlw_pickaxe"] = {"Колото-резаная рана", "Колото-резаные раны - %s"},
	["mlw_tonfa"] = {"Удар тупым предметом", "Ушибы, ссадины от удара тупым предметом - %s"},
	["mlw_torch"] = {"Удар тупым предметом", "Ушибы, ссадины от удара тупым предметом - %s"},
	["mlw_policelight"] = {"Удар тупым предметом", "Ушибы, ссадины от удара тупым предметом - %s"},
	["mlw_bat"] = {"Удар тупым предметом", "Ушибы, ссадины от удара тупым предметом - %s"},
}