--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/msd_ui/lua/msd/ui/msdhelpmenu.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

local help_data = {
	["controls"] = {
		"На сервере, взаимодействие с предметами происходит при помощи рук. Левая кнопка мыши передвигает вещи, а правая - кладёт их в инвентарь. Инвентарь открывается на кнопку F4. В том же меню отображается статистика вашего персонажа; подробнее в 'Статистика, рассудок'.",
		"Предметы можно использовать как из инвентаря, так и пока они лежат на земле. Использование объектов вне инвентаря проходит через кнопку E. При наведении на что-либо руками, в середине экрана вылезает дополнительная подсказка по управлению.",
		"Основные игровые действия проводятся через меню F4. Подробнее про меню F2 расписано в категории 'Меню действий F2'. Точное руководство по ролевым действиям (/me, /do, /roll) и горячим клавишам расписано в Discord-сервере.",
		"Управление не ограничивается одними горячими клавишами. в ESC меню есть раздел 'Настройки сервера' - в нём вы можете дополнительно настроить игровой опыт под себя. Как минимум, это вам поможет перед ездой на автомобиле."
	},
	["food"] = {
		"Для поддержания себя в здоровой форме, вам необходимо питаться и пить воду. Всякие закуски продаются в торговых автоматах по всему району, однако вредной пищей вы не наедитесь.",
		"Магазины на заправках позволят купить как еду быстрого приготовления, так и ингредиенты для полезной пищи. Хорошая еда не только вкуснее - от высокой сытости персонаж получает позитивные эффекты. Например: регенерация здоровья, восстановление рассудка.",
		"Помимо эффектов от еды, есть эффекты от питья - кофе, энергетики, чай и алкоголь по-разному реалистично стимулируют персонажа. Наличие эффектов показывается в меню F4, их свойства вам предстоит узнать лично.",
		"Последствия от голодовки фатальны лишь при падении обоих параметров до нуля. Падение только одного из параметров накладывает ограничения на физические нагрузки. Имейте в виду: кушать сырую пищу очень невыгодно, а иногда даже опасно.",
		"Правильное питание позволит вам жить, а не только выживать. Не игнорируйте кафе. Как только заработаете денег - советуем хотя бы приобрести плиту, чтобы готовить еду дома."
	},
	["stats"] = {
		"Персонаж может принимать не только пищу. Другие 'стимуляторы' по типу сигарет или наркотиков дают полезные в активных ситуациях эффекты. В отличие от еды, каждая химия имеет свой эффект. Чем препарат сильнее - тем он опаснее. Лучше не экспериментируйте - передоз штука страшная.",
		"Ещё есть татуировки. Чем дольше вы живёте - тем больше тату вы можете набить на персонажа. Каждая татуировка улучшает статистику или даёт навык, улучшающий возможности текущего персонажа. После смерти, вы теряете все татуировки. Позиция тату-салона указана на карте в ESC меню.",
		"Последняя в объяснении, но первая в исполнении вещь - рассудок. Рассудок показывает восприятие вашим персонажем окружающего мира. Чем он менее стабильный - тем мир тускнее и скучнее. Разбитый рассудок не даст вам брать в руки оружие, заблокирует особых персонажей, и лишний раз напомнит о себе пока вы не исправитесь.",
		"Входите в роль персонажа как части живого города, и у вас не будет никаких проблем с головой."
	},
	["job"] = {
		"Взаимодействие с миром происходит напрямую с окружением, а не через бесконечные меню. Взятие работы, подработок, поиск иных возможностей и покупка предметов для игры происходит через персонажей-NPC.",
		"Почти каждый персонаж в Бруклине что-то да предложит. Многие магазины предлагают подработку, а постоянную работу вы найдёте в бизнес-центре. Это самое высокое здание в играемой части района, его видно почти отовсюду.",
		"Работы делятся на два вида - активные и пассивные по доходу. В активных нужно следовать меняющимся указаниям в верхней левой части экрана. Пассивная деятельность даёт прибыль вне зависимости от того, что вы делаете - ваш доход увеличивается отыгрышем своей роли.",
		"Например: оружейный мастер занимается не только сборкой оружия, но и его обслуживанием; кулинар готовит как еду, так и алкоголь. Профессии с пассивным доходом набирают опыт профессии когда вы крафтите предметы. Этот опыт используется для разблокировки новых рецептов, компонентов, или покупки уникальных вещей в магазинах.",
		"Однако, не каждая деятельность требует определённой профессии, и не каждая роль может полностью взаимодействовать с другими NPC. Персонажи-нелегалы и гос. служащие не будут браться за подработки и обычную работу, а NPC по типу барыг торгуют только с подельниками.",
		"У всех персонажей на карте свои уникальные реплики. Помимо механических действий - как с заключением преступников через рекрута в участке - вы можете узнать побольше о самом персонаже или игровом мире. Быть может, вы даже найдёте скрытые возможности для заработка.."
	},
	["docs"] = {
		"Некоторые игровые возможности открываются в полной мере через бюрократию. Легальное ношение оружия, открытие своего бизнеса - для всего нужно соответствующее разрешение. Нужные документы можно получить в ратуше. Её местоположение узнается через GPS; подробнее в разделе 'Телефон и сайты'.",
		"Когда есть активный районный администратор - разрешения оформляются через него. В ином случае, вам нужно обратиться к секретарю. Как только вам подтвердят нужные разрешения - отметки о них появятся в вашем паспорте. Все ваши текущие документы просматриваются через меню F4.",
		"Лицензии пропадают только после смерти вашего персонажа, или если их забрал районный администратор."
	},
	["gun"] = {
		"Оружие - необязательный элемент игрового опыта. Достать огнестрел возможно только через взаимодействие с другими игроками. Оружие делает профессия 'Оружейный мастер', из запчастей, заказанных с интернета; подробнее в разделе 'Телефон и сайты'.",
		"Мало кто продаст вам оружие, если у вас нет лицензии; подробнее в разделе 'Документы'. За оружием также необходимо следить, чтобы оно не отказало в нужную минуту. Обслуживанием огнестрела всё так же занимается оружейный мастер, на своём оружейном столе.",
		"Модифицирование оружия проходит двумя способами: лёгкие к установке модули ставятся через инвентарь, а конкретное изменение оружия требует его пересборку с дополнительными оружейными запчастями. В обоих случаях вам нужно стоять рядом с оружейном столом.",
		"Модификации на оружие в основном меняют внешний вид. Реальное преимущество вам даст разве что прицел - в реальной жизни от смены длины ствола урон не меняется. Всё необходимое для оружия заказывается через всё тот же интернет.",
		"Заряжать оружие нужно подходящими к нему магазинами - они должны лежать в вашем инвентаре. Магазины продаются в интернете - они подписаны так, что вы не спутаете. Примечание: большинство магазинов продаются пустыми. Патроны для зарядки пустых магазинов тоже делает оружейный мастер. На всякий случай, памятка о калибрах висит на вторичном сайте Overloaded.",
		"При покупке оружия убедитесь, что его зарегистрировали на ваше имя. Вы не сможете положить чужой огнестрел в хранилище. На худой конец, оружию можно стереть серийный номер - склад принимает такое вооружение в ограниченном количестве.",
		"Ношение оружия за гражданского открывается после разблокировки всех остальных типов персонажей."
	},
	["shop"] = {
		"Ассортимент товаров меняется в зависимости от магазина. Магазин хоз. товаров продаст вам химикаты и крафт-станции (объекты для создания других предметов), лавки при заправках - еду, а магазин одежды, соответственно, одежду. Все купленные вещи (кроме одежды; гардероб остаётся в магазине) автоматически попадают в ваш инвентарь.",
		"Его можно посмотреть на кнопку F4, в одноимённом разделе. У каждого предмета свой вес - имейте это в виду, когда захотите открыть свой магазин или собрать домашнюю плантацию. Вероятно, вам придётся сделать несколько вылазок, ведь каждый может таскать с собой лишь 7 килограмм.",
		"Увеличивать вместимость карманов вашего персонажа нельзя. Зато вы можете пользоваться коробками или багажником автомобиля для удобства в транспортировке. Не разбрасывайте вещи на полу - они нагружают сервер. Плюс, их дольше подбирать с пола, чем доставать из контейнера. Купите коробки, или на крайний случай пакет.",
		"В некоторых магазинах можно увидеть предметы 'не в наличии'. Они становятся доступными для покупки исключительно вам как только вы накопите необходимый опыт профессии с пассивным доходом; подробнее в 'Работы и NPC'.",
		"Дабы сохранить какой-либо предмет насовсем, вы можете воспользоваться складом – подробнее в разделе ‘Склад и доставка’. Существуют также особые магазины вне игровой зоны. Подробнее о них в разделе ‘Телефон и сайты’.",
	},
	["craft"] = {
		"Крафт - важная игровая механика, объединяющая большинство видов деятельности. Только при помощи крафта можно достать оружие, хорошую еду, и запрещённые законом ‘продукты’ для тёмной стороны игры. А вот предметы для самого крафта достаются в обычных магазинах. Подробнее о них в разделе ‘Магазины’.",
		"Некоторые предметы делаются в несколько шагов: например, наркотики или готовка сложной еды. Все рецепты и необходимые для них вещи расписаны в меню крафт-станций. Сами станции покупаются в магазине хоз. товаров. Имейте в виду, что для покупки нужных верстаков вам нужна соответствующая роль. Для их должного использования - тоже.",
		"Пример: все могут фасовать товар на лабораторном столе, но только нелегал правильно обработает продукт. Большинство расходников для всех верстаков продаётся тоже в магазине хоз. товаров. За едой придётся идти на заправку, или заказывать через интернет; подробнее в разделе 'Телефон и сайты'.",
		"Для создания предметов, вам нужно распаковать крафт-станцию и положить внутрь неё нужные предметы. В зависимости от требований меняется рецепт - увеличивается спектр ингредиентов, добавляется фактор температуры. Для её снижения вы можете потратить пакет льда или остановить создание на пол минуты. Лёд должен лежать внутри стола.",
		"Любой купленный предмет не пропадёт зря - многие рецепты построены с учётом схожих составляющих, с нечастым добавлением чего-то своего. Может не очень реалистично - зато удобно, не так ли?"
	},
	["plant"] = {
		"Для создания большинства незаконных веществ потребуется плантация. Для самой грядки нужны семена и специальная вода. Канистра с водой и набор для сборки плантации продаются в хоз. товарах.",
		"Семена для выращивания продаются на сайте WANK; подробнее об интернете в разделе ‘Телефон и сайты’. Семена так и называются семенами - мешки с травами и другие интересности с заправки нужны кулинарам, работающим с алкоголем.",
		"После сборки плантации на своей территории, вам необходимо перенести на неё канистру и семена руками. Сбор готового продукта проходит через клавишу Е."
	},
	["phone"] = {
		"Ваш телефон - уникальное средство коммуникации и взаимодействия с миром. Объявления, звонки, онлайн-заказы - всё это доступно по щелчку одной кнопки - стрелки вверх (или колеса мыши). Телефон не требует зарядки; он приобретается на заправках.",
		"Внешний вид телефона и другие настройки меняются прямо в нём же. Как и в обычном телефоне, вы можете сделать фото, найти определённую ‘горячую точку’ или связаться с кем-либо на расстоянии. Отдельно стоит упомянуть интернет - тут он вымышленный.",
		"Однако, он незаменим для игры. Почта вверху 'домашнего' экрана интернета позволит вам отправить объявление, а сайт Skyline нужен для аренды помещений. Метка купленной недвижимости появляется в GPS в меню телефона, а купленные предметы с других сайтов попадают на склад. Подробнее о хранилище в разделе ‘Склад и доставка’.",
		"Каждый сайт по-своему полезен. Основные сайты (с обложками) используются для игры повсеместно, а вторичные позволяют узнать мир получше. Вторичные сайты неспроста так называются - они имеют лишь информационный функционал. Всё ещё полезно - игровой мир по-своему уникален, вы играете в заданных виртуальным миром рамках.",
		"Помните: телефон - это предмет. Он должен лежать в инвентаре, чтобы им пользоваться. Отсутствие сотового телефона можно частично компенсировать публичным - рабочие телефоны для связи установлены в будках.",
		"Управление:",
		"Достать телефон - стрелка вверх или колесо мыши. Навигация - стрелки на клавиатуре или курсор на F3. Enter - вперёд, Backspace (стереть) - назад, а зажатый пробел отвечает за третью опцию - набор номера, например."
	},
	["mail"] = {
		"Помимо инвентаря, вы можете сохранить свои вещи насовсем на городском складе. Они будут ожидать вас даже после смерти персонажа или рестарта сервера. Все ваши онлайн-покупки попадают туда же. А куда именно - вам подскажет GPS в телефоне; подробнее в разделе ‘Телефон и сайты’.",
		"Вы можете улучшать вместимость хранилища за крупную сумму денег, дабы сохранить больше чего бы то ни было. Для улучшения игрового опыта, ваше хранилище поделено на всех трёх персонажей. Плюс, вы можете заказывать предметы со склада почти откуда угодно. Заказать и забрать свои вещи можно в тёмно-серых почтовых ящиках.",
		"Вызов предметов по почте мгновенный, но вы не можете забирать на расстоянии спорные вещи по типу оружия или наркотиков. Риск требует вашего личного прихода на склад.",
		"Помните: для полноценной ролевой игры не обязательно коллекционировать каждый вид оружия или еды. Пусть то и бывает приятно."
	},
	["f2"] = {
		"Что не делается руками или прямым взаимодействием - происходит через меню F2. Всевозможные жесты, включение рации у полицейских и сбор верстаков обратно в наборы - всё делается одной кнопкой. Данное меню держит в себе непостоянные действия, показываемые только когда те доступны.",
		"Добавление другого игрока в вашу собственность идёт через тот же сайт, где покупается недвижимость - подробнее в разделе ‘Телефон и сайты’. Вы всё ещё можете добавить игрока как собственника в ваш автомобиль через F2. Дабы тот мог им пользоваться, игроку нужно ‘получить’ ключи через то же меню, нацелившись на транспорт.",
	},
	["admin"] = {
		"Если у вас остались вопросы, или вы хотите поделиться обратной связью, то нажмите на кнопку ниже. Учитывайте правила подачи заявок, дабы их рассмотрели. Глупых вопросов не существует, не бойтесь общаться с администрацией!",
		{"button", "Позвать администратора", function(menu)
			MSD.AdminRequest()
			MSD.F1Menu:Remove()
		end}
	},
}

function MSD.OpenF1Menu(start)
	if IsValid(DarkRP.Scoreboard) then return end

	if IsValid(MSD.F1Menu) then
		MSD.F1Menu:Remove()
		return
	end

	local SW, SH = ScrW(), ScrH()
	local hs = 440
	local openPage
	local dead = not LocalPlayer():Alive()

	local buttons = {
		{"Массовое убийство без причины", MSD.Icons48.alert, function(title)
			RunConsoleCommand("sa_rdm")
			MSD.F1Menu:Remove()
		end, nil, true, dead = true},
		{"Базовое управление", MSD.Icons48.mouse_variant, function(title) openPage("controls", 2, nil, true, title) end},
		{"Еда и вода", MSD.Icons48.food, function(title) openPage("food", 2, nil, true, title) end},
		{"Статистика, рассудок", MSD.Icons48.pill, function(title) openPage("stats", 2, nil, true, title) end},
		{"Работы и NPC", MSD.Icons48.account_multiple, function(title) openPage("job", 2, nil, true, title) end},
		{"Документы", MSD.Icons48.badge_account_horizontal, function(title) openPage("docs", 2, nil, true, title) end},
		{"Оружие", MSD.Icons48.pistol, function(title) openPage("gun", 2, nil, true, title) end},
		{"Магазины", MSD.Icons48.basket, function(title) openPage("shop", 2, nil, true, title) end},
		{"Крафт", MSD.PinPoints[58], function(title) openPage("craft", 2, nil, true, title) end},
		{"Выращивание; нелегал", MSD.Icons48.sprout, function(title) openPage("plant", 2, nil, true, title) end},
		{"Телефон и сайты", MSD.Icons48.cellphone_text, function(title) openPage("phone", 2, nil, true, title) end},
		{"Склад и доставка", MSD.Icons48.box, function(title) openPage("mail", 2, nil, true, title) end},
		{"Меню действий F2", MSD.Icons48.human_female_dance, function(title) openPage("f2", 2, nil, true, title) end},
		{"Сайт проекта", MSD.Icons48.lacoin, function(title) gui.OpenURL("https://gmodla.ru/") end, any = true},
		{"Discord сервер", MSD.Icons48.discord, function(title) gui.OpenURL("https://discord.gg/mb4ppSaPva") end, any = true},
		{"Помощь администратора", MSD.PinPoints[45], function(title) openPage("admin", 3, nil, true, title) end, any = true},
	}

	MSD.F1Menu = vgui.Create("MSDSimpleFrame")
	MSD.F1Menu:SetSize(SW - 20, SH - SH / 6)
	MSD.F1Menu:SetPos(15, 15)
	MSD.F1Menu:SetAlpha(1)
	MSD.F1Menu:AlphaTo(255, 0.5)
	MSD.F1Menu:MakePopup()
	MSD.F1Menu.Paint = function(s, w, h)
		MSD.Blur(s, 2, 2, 255, 0, hs, h)
		MSDX.Draw(0, 0, 0, hs, h, MSD.Theme.d)
		MSDX.Draw(0, 0, 0, hs, 120, MSD.Theme.d)
		MSD.DrawTexturedRect(hs / 2 - 146, 0, 293, 118, MSD.Materials.logo, color_white)
	end
	MSD.F1Menu.Think = function(self)
		if input.IsKeyDown(KEY_ESCAPE) or (input.IsKeyDown(KEY_F1) and self:GetAlpha() > 250) then
			self:Remove()
		end
	end

	local menu = MSD.F1Menu

	menu.ClearPage = function(ss, popup, canvas)
		if IsValid(menu.page) then
			menu.page:Remove()
		end

		menu.page = vgui.Create("DPanel", menu)
		menu.page:SetSize((SW - 30 - hs) / ss, menu:GetTall())
		menu.page:SetPos(hs + 15, 0)
		menu.page:SetAlpha(1)
		menu.page:AlphaTo(255, 0.5)
		menu.page.Paint = function(s, w, h)
			MSD.Blur(s, 2, 2, 255, 0, w, h)
			MSDX.Draw(0, 0, 0, w, h, MSD.Theme.d)
		end
		if canvas then
			menu.canvas = vgui.Create("MSDPanelList", menu.page)
			menu.canvas:SetSize(menu.page:GetWide(), menu.page:GetTall())
			menu.canvas:SetPos(0, 0)
			menu.canvas:SetSpacing(2)
			menu.canvas:SetPadding(0)
			menu.canvas:EnableVerticalScrollbar()
			menu.canvas:EnableHorizontal(true)
		end
	end

	menu.list = vgui.Create("MSDPanelList", menu)
	menu.list:SetSize(hs, menu:GetTall() - 125)
	menu.list:SetPos(0, 120)
	menu.list:EnableVerticalScrollbar()
	menu.list:SetSpacing(1)
	menu.list:SetPadding(0)
	menu.list.IgnoreVbar = true
	menu.list.Deselect = function(but)
		if not but then return end
		but.hovered = true

		for k, v in pairs(menu.list:GetItems()) do
			if v and v:IsValid() and v ~= but then
				v.hovered = false
			end
		end
	end

	local fillInteractions = {
		["button"] = function(member)
			MSD.Button(menu.canvas, "static", nil, 1, 45, member[2], member[3])
		end
	}

	local fillContent = {
		["string"] = function(member)
			MSD.InfoTextF1(menu.canvas, member, menu.page:GetWide() - 5)
		end,
		["table"] = function(member)
			if fillInteractions[member[1]] then
				fillInteractions[member[1]](member)
			end
		end,
	}

	function openPage(id, ss, popup, canvas, tittle)
		menu.ClearPage(ss, popup, canvas)
		menu.canvas:Clear()

		MSD.Header(menu.canvas, tittle)

		local data = help_data[id]

		if not data then return end

		for _,member in ipairs(data) do
			if fillContent[type(member)] then
				fillContent[type(member)](member)
			end
		end
	end


	for k, v in pairs(buttons) do
		if not v.any and tobool(v.dead) ~= dead then continue end

		local button = MSD.MenuButton(menu.list, v[2], nil, nil, 250, 50, v[1], function(self)
			menu.list.Deselect(not v[5] and self or false)
			v[3](v[1])
			if not v[5] then last = k end
		end)

		if not v[5] and (v[4] or last == k) then
			menu.list.Deselect(button)
			v[3](v[1])
		end
	end
end
concommand.Add("gmodla_f1", MSD.OpenF1Menu)

MSD.LoadedBooks = MSD.LoadedBooks or {}

function MSD.LoadBook(id)
	if IsValid(MSD.BookMenu) then
		MSD.BookMenu:Remove()
	end

	if MSD.LoadedBooks[id] then
		MSD.BuildBook(MSD.LoadedBooks[id], id)
		return
	end

	http.Fetch("http://cityrp.macnco.one/books/" .. id .. "/index.json", function(body, size, headers, code)
		if not body then return end
		local book = util.JSONToTable(body)
		if not book then return end
		MSD.LoadedBooks[id] = book
		MSD.BuildBook(book, id)
	end, function(m)
		print("Failed to get link, book - " .. id, m)
	end)
end

function MSD.BuildBook(book, id)
	if not book then return end

	if IsValid(MSD.BookMenu) then
		MSD.BookMenu:Remove()
	end

	if book.h + 110 > ScrH() then
		book.h = ScrH() - 110
	end

	MSD.BookMenu = vgui.Create("MSDSimpleFrame")
	MSD.BookMenu:SetSize(book.w + 26, book.h + 110)
	MSD.BookMenu:Center()
	MSD.BookMenu:SetAlpha(1)
	MSD.BookMenu:AlphaTo(255, 0.5)
	MSD.BookMenu:MakePopup()
	MSD.BookMenu.page = 0
	MSD.BookMenu.maxpage = book.pages
	MSD.BookMenu.Paint = function(s, w, h)
		MSD.Blur(s, 2, 2, 255, 0, w, h)
		MSDX.Draw(0, 0, 0, w, h, MSD.Theme.d)
		MSDX.Draw(0, 0, 0, w, 50, MSD.Theme.d)
		MSDX.Draw(0, 0, h - 50, w, 50, MSD.Theme.d)

		draw.DrawText(book.name, "MSDFontB.26", 15, 12, color_white, TEXT_ALIGN_LEFT)
		draw.DrawText(s.page .. " / "  .. s.maxpage, "MSDFontB.26", w / 2, h - 38, color_white, TEXT_ALIGN_CENTER)

		if s.page == 0 then
			MSD.DrawTexturedRect(13, 55, book.w, book.h, MSD.ImgLib.GetMaterial("http://cityrp.macnco.one/books/" .. id .. "/cover.png"), color_white)
		end
	end

	MSD.BookMenu.Think = function(self)
		if input.IsKeyDown(KEY_ESCAPE) then
			self:Remove()
		end
	end

	local menu = MSD.BookMenu

	MSD.IconButton(menu, MSD.Icons48.cross, menu:GetWide() - 34, 10, 25, nil, MSD.Config.MainColor.p, function()
		menu:AlphaTo(0, 0.4, 0, function()
			menu:Close()
		end)
	end)

	MSD.IconButton(menu, MSD.Icons48.arrow_left, 5, menu:GetTall() - 50, 50, nil, MSD.Config.MainColor.p, function()
		menu.page = math.max(menu.page - 1, 0)
		menu.ClearPage()
	end)

	MSD.IconButton(menu, MSD.Icons48.arrow_right, menu:GetWide() - 55, menu:GetTall() - 50, 50, nil, MSD.Config.MainColor.p, function()
		menu.page = math.min(menu.page + 1, menu.maxpage)
		menu.ClearPage()
	end)

	-- MSD.NumberWang(set_list, "static", nil, 1, 50, 0, nskins, localnpc.skin or 1, "Skin", function(self)
	-- 	model_panel.Entity:SetSkin(self:GetValue())
	-- 	localnpc.skin = self:GetValue()
	-- end)

	menu.ClearPage = function()
		if menu.page < 1 then
			if IsValid(menu.dpage) then
				menu.dpage:Remove()
			end
			return
		end

		if not IsValid(menu.dpage) then
			menu.dpage = vgui.Create("DHTML", menu)
			menu.dpage:SetSize(book.w + 24, book.h)
			menu.dpage:SetPos(0,55)
		end

		menu.dpage:OpenURL("http://cityrp.macnco.one/books/" .. id .. "/pages/" .. menu.page .. "p.html")
	end
end