--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/slawer_elections/lua/slawer_elections/languages/ru.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

Slawer.Elections.Lang["ru"] = {
    elections = "Выборы",
    registration = "Регистрация",
    register = "Зарегистрироваться",
    up_to_x_can_vote = "Проголосовать могут до %i граждан",
    vote_for_x = "Голосовать за %s",
    x_elected = "%s был избран районным администратором!",
    time_to_register = "Время баллотироваться",
    time_to_vote = "Время голосования",
    registered = "Вы зарегистрировались на предстоящие выборы",
    voted = "Спасибо за отданный голос!",
    error_occured = "Произошла ошибка, попробуйте снова",
    no_elections_currently = "В настоящее время выборов нет",
    already_registered = "Вы уже баллотировались",
    cannot_register = "Вы не можете баллотироваться в данный момент",
    not_allowed_to_register = "Вам нельзя баллотироваться!",
    not_enough_money_to_register = "У вас недостаточно денег чтобы баллотироваться",
    there_is_already_mayor = "Вы не можете баллотироваться, когда есть районный администратор",
    no_more_candidates = "Достигнут лимит кандидатов на выборах",
    cannot_vote_now = "Сейчас вы не можете голосовать",
    already_voted = "Вы уже голосовали",
    no_mayor_job = "Ошибка! (работа 'районный администратор' не найдена, неправильный конфиг)",
    no_candidate_elected = "Ни один кандидат не был избран",
    must_use_npc_register = "Регистрация проходит только в ратуше!",
    must_use_npc_vote = "Голосование проходит только в ратуше!",
    invalid_political_group = "Выбранная при регистрации политическая группа недействительна",
    program_must_length = "Ваша политическая программа должна быть от %i до %i символов",
    invalid_candidate = "Этого кандидата не существует, попробуйте ещё раз",
}