--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/slawer_mayor/lua/slawer_mayor/languages/ru.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

Slawer.Mayor.Lang["ru"] = {
    ["NoAccess"] = "У вас нет к этому доступа!",
    ["AnErrorHasOccured"] = "Произошла ошибка, попробуйте снова!",
    ["PleaseWait"] = "Подождите перед совершением действия!",
    ["TaxsRecentlyUpdated"] = "Налоги уже недавно менялись, подождите %i секунд",
    ["UpgradesAlreadyMax"] = "Достигнут лимит вложений!",
    ["NotEnoughFunds"] = "В бюджете не хватает средств!",
    ["NotAllowedBonus"] = "Премия должна быть между %s и %s!",
    ["WaitUntilNextBonus"] = "Подождите %i секунд перед выдачей следующей премии!",
    ["WaitUntilNextKick"] = "Подождите %i секунд перед следующим увольнением!",
    ["WaitUntilNextLicense"] = "Подождите %i секунд перед изменением статуса лицензии!",
    ["WaitUntilNextNews"] = "Подождите %i секунд перед сменой новостей!",
    ["WaitUntilNextWithdraw"] = "Подождите %i секунд перед следующими махинациями с бюджетом!",
    ["CantDepositThatMuch"] = "Вы не можете вложить так много денег в бюджет!",

    ["TaxSuccessfullyUpdated"] = "Налоги обновлены!",
    ["SalaryReceived"] = "На ваш зарплатный счёт зачислено $%s. Налоговый вычет составил %i%%.\n\nВаш Bank of Union.",
    ["UpgradeSuccessfullyBought"] = "Вы успешно вложились!",
    ["BonusSuccessfullyGiven"] = "Премия отправлена!",
    ["CPSuccessfullyFired"] = "Служащий временно отстранён от службы!",
    ["YouveBeenFired"] = "Вас отстранили от службы!",
    ["LicenseSucessfullyUpdated"] = "Статус лицензии обновлён!",
    ["NewsSuccessfullyChanged"] = "Новостное сообщение изменено!",
    ["SuccessfullyWithdrew"] = "Вы успешно взяли деньги из бюджета!",
    ["SuccessfullyDeposited"] = "Вы успешно внесли деньги в бюджет!",

    ["CityManagement"] = "Управление",
    ["Taxs"] = "Налоги",
    ["Funds"] = "Бюджет",
    ["Licenses"] = "Лицензии",
    ["Policemen"] = "Сотрудники",
    ["Warrants"] = "Ордера",
    ["Lockdown"] = "Ком. час",
    ["Wanted"] = "Розыски",
    ["News"] = "Новости",
    ["Reports"] = "Рапорты",
    ["AddALaw"] = "Добавить указ",
    ["Save"] = "Сохранить",
    ["Unlock"] = "Разблокировать",
    ["CityFunds"] = "БЮДЖЕТ РАЙОНА",
    ["Salary"] = "Зарплата : %s",
    ["CitizensInTheCity"] = "ЖИТЕЛИ РАЙОНА",
    ["GovernmentAgents"] = "ГОСУДАРСТВЕННЫЕ СЛУЖАЩИЕ",
    ["Amount"] = "Количество",
    ["Upgrade"] = "Улучшить",
    ["Max"] = "МАКСИМУМ",
    ["Citizen"] = "Гражданин",
    ["Yes"] = "Да",
    ["No"] = "Нет",
    ["HasGunLicense"] = "Статус лицензии",
    ["GrantRevokeLicense"] = "Выдать/Забрать",
    ["StartASearchWarrant"] = "Запросить ордер на обыск",
    ["StartAWantedNotice"] = "Объявить в розыск",
    ["EndsIn"] = "Закончится через %s",
    ["Cancel"] = "Отменить",
    ["Reason"] = "Причина",
    ["WantedNotice"] = "РАЗЫСКИВАЕМЫЕ",
    ["CityBoard"] = "СТАТУС",
    ["NewsDuration"] = "Длительность сообщения (в секундах)",
    ["Withdraw"] = "Взять",
    ["Deposit"] = "Внести",
    ["CloseSafe"] = "Закрыть сейф",
    ["Close"] = "Закрыть окно",
    ["SafeMustBeOpen"] = "Сейф должен быть открыт",
    ["NoWantedNotice"] = "Разыскиваемых нет",
    ["MayorMessage"] = "Новости",
    ["None"] = "Ничего",
    ["AverageTax"] = "СРЕДНИЙ НАЛОГ",

    ["Back"] = "Назад",


    ["MayorTip1"] = [[Районный администратор - чиновник. Не юрист, не командир полиции, не пожарник. Департамент Закона нам друг пока мы полезны.
На посту никто не задерживается долго. Работа опасная. Не делай глупостей.

Сначала нужно заручиться поддержкой мэрии - показать, что тебе можно доверять. Дальше - выполнение обещаний.
Налогооблагать лучше всего госслужащих. Им платят много, а без магазинов мы не проживём.

Секретарша НЕ умеет выполнять свою работу. Надеяться надо на себя или своих подручных.
Если у тебя есть время на пасьянс или сапёра - значит, ты плохо делаешь свою работу.


При уходе с поста - передай следующему администратору.]],
    ["MayorTip2"] = [[На случай если забуду:
Нужен номер паспорта, выбирается тип документа, делаются запросы (ПОШЛИНЫ), дальше печать
Повторной печатью документов (лицензий на оружие) не обмануть - все запросы идут в NLR. Нет оригинала - фальшивку не сделать
Пошлины - хороший повод брать дополнительную плату за свою работу


P.S. Пока компьютер грузится - можно не пялиться в экран
P.P.S. Принтер снизу, в правом кабинете от входа
P.P.P.S. Может нанять рабочего приносить документы в кабинет?
P.P.P.P.S. Не забыть кого-то отправить за бумагой!!]],
    ["PoliceTip"] = [[1.  Заполняется протокол задержания
2.  Проводится допрос по основному обвинению
3.  Приложение улик к делу
4.  Арест подтверждаете в компьютере, перевод подозреваемого в камеру; ожидание суда

На всё про всё выделяется 30 минут
Нет паспорта - запускайте поиск по NLR сразу. Там данные ВСЕХ граждан США, искать будет долго
Не успели - отпускаете человека. Нет улик - отпускаете человека
На незначительные нарушения допрос не проводится - протокол, и в клетку
На допросы вспомогалов не пускать, к уликам - тоже


Не дай бог появится жалоба - улетите на канцелярское дежурство
Б. Хогстон]],
}