--[[
Server Name: ✪ New York Noire | Атмосферный RP-сервер
Server IP:   46.174.50.110:27015
File Path:   addons/slawer_mayor/lua/slawer_mayor/modules/taxs/sh.lua
		 __        __              __             ____     _                ____                __             __         
   _____/ /_____  / /__  ____     / /_  __  __   / __/____(_)__  ____  ____/ / /_  __     _____/ /____  ____ _/ /__  _____
  / ___/ __/ __ \/ / _ \/ __ \   / __ \/ / / /  / /_/ ___/ / _ \/ __ \/ __  / / / / /    / ___/ __/ _ \/ __ `/ / _ \/ ___/
 (__  ) /_/ /_/ / /  __/ / / /  / /_/ / /_/ /  / __/ /  / /  __/ / / / /_/ / / /_/ /    (__  ) /_/  __/ /_/ / /  __/ /    
/____/\__/\____/_/\___/_/ /_/  /_.___/\__, /  /_/ /_/  /_/\___/_/ /_/\__,_/_/\__, /____/____/\__/\___/\__,_/_/\___/_/     
                                     /____/                                 /____/_____/                                  
--]]

Slawer.Mayor.JobTaxs = {
	gov = 1,
	citizens = 1,
	shops = 1,
}

Slawer.Situations = {
	[1] = {
		name = "Внеплановый визит",
		text = "В приёмную поступило большое количество обращений от представителей портовой службы. Все эти письма жалуются на внеплановое прибытие какого-то сухогруза, из-за чего вся портовая жизнь встала на месте. Как передаёт диспетчер: ‘Грят пустить, а то от Боба беды ждать’. Что будем делать?",
		answ = {
			[1] = "Пустить корабль разгружаться",
			[2] = "Запретить кораблю приближаться",
			[3] = "Арестовать имущество корабля",
			[4] = "Игнорировать"
		}
	},
	[2] = {
		name = "Бездомные зомби",
		text = "Всё больше и больше граждан жалуются на ситуацию с бездомными. Сначала ‘бомжи’ собирались группами и агрессивно попрошайничали. Потом стали объединяться в толпы и орать как холопы. Теперь они заняли всю канализацию и не дают проводить профилактические работы. Прорванные трубы не только вредят инфраструктуре, а ещё и вызывают ужасный запах. Обе проблемы беспокоят жителей. Что будем делать?",
		answ = {
			[1] = "Выделить средства на реабилитацию несчастных (-1500$)",
			[2] = "Отправить полицию помогать городским рабочим",
			[3] = "Обучить рабочих обороняться (-500$)",
			[4] = "Игнорировать"
		},
		cost = {
			[1] = 1500,
			[3] = 500,
		}
	},
	[3] = {
		name = "Анархисты-рецидивисты",
		text = "В последнее время, различные группы ‘анархистов’ активно набирают популярность у народа. Может это результат вашей работы, может это такая мода - разбираться очень долго. В изоляторы часто попадают одни и те же люди, и новые хотят следовать по их стопам - идти разрисовывать стены и жить ‘свободно’. Это беспокоит задействованные полицейские участки. Что будем делать?",
		answ = {
			[1] = "Применить чрезвычайные полномочия (-400$)",
			[2] = "Изучить феномен (-100$)",
			[3] = "Открыть творческий фестиваль (-500$)",
			[4] = "Игнорировать"
		},
		cost = {
			[2] = 100,
			[3] = 500,
		},
		func = {
			[1] = function()
				Slawer.Mayor.lockdown()
			end,
		}
	},
	[4] = {
		name = "Смешение статистик",
		text = "В Бруклине вновь произошла перестрелка. Дело привычное, но место далеко не обычное - беда случилась в отеле. Две банды этнических меньшинств решили выяснить отношения во время приезда большой группы туристов. Пострадавших среди гражданского населения много. Паника не даёт главам участков принять нужное решение. Что посоветуете?",
		answ = {
			[1] = "Применить чрезвычайные полномочия (-400$)",
			[2] = "Публично осудить нападавших",
			[3] = "Провести внезапный рейд на предполагаемые точки сбора нелегалов (-300$)",
			[4] = "Игнорировать"
		},
		cost = {
			[3] = 300,
		},
		func = {
			[1] = function()
				Slawer.Mayor.lockdown()
			end,
		}
	},
	[5] = {
		name = "Сделка с Дьяволом",
		text = "На улицах Бруклина вновь беспорядки. На удивление, к нам никаких претензий нет. По крайней мере со стороны народа - люди злятся на World Corp за задержку их зарплат. А вот уже корпорация просит помощи у нас - им не нравится смотреть на толпы протестующих. Этот большой конгломерат вполне может заплатить каждому, но они этого не делают. Как мы поступим?",
		answ = {
			[1] = "Арестовать пассивных менеджеров за монополию и подрыв экономики",
			[2] = "Публично осудить корпорацию",
			[3] = "Разогнать митингующих (-200$)",
			[4] = "Игнорировать"
		},
		cost = {
			[3] = 200,
		}
	},
	[6] = {
		name = "Незапланированная иммиграция",
		text = "В нашу приёмную постоянно поступают письма от странного неопознанного судна. Самодельная деревянная лодка встала в порту и не собирается никуда уплывать. Более того - беженцы уже высадились и стоят в порту, прося вас пустить их в город. Коренные жители же наоборот, совсем не хотят такого пополнения - и даже предлагают вам вознаграждение за ссылку иммигрантов назад. Что будем делать?",
		answ = {
			[1] = "Пустить соседей и выдать им документы",
			[2] = "Не пускать соседей и отослать их подальше",
			[3] = "Посадить нелегалов и экстрадировать их назад (-200$)",
			[4] = "Игнорировать"
		},
		cost = {
			[3] = 200,
		}
	},
	[7] = {
		name = "Код ‘серебро’",
		text = "От главврача местной больницы поступило срочное сообщение и тонна претензий. Как оказалось, он и его больница постоянно пытались добиться выделения средств на закупку нового оборудования, но система считала их за спам. Теперь, когда его слова дошли до нас, времени осталось критично мало. Больница переполнена, а технологий не хватает. Как будем поступать?",
		answ = {
			[1] = "Выделить запрашиваемые средства (-1000$)",
			[2] = "Вложить капитал в родное производство (-500$)",
			[3] = "Применить чрезвычайные полномочия (-400$)",
			[4] = "Игнорировать"
		},
		cost = {
			[1] = 1000,
			[2] = 500,
		},
		func = {
			[3] = function()
				Slawer.Mayor.lockdown()
			end,
		}
	},
	[8] = {
		name = "Глобальное зелёнобесие",
		text = "В нашу приёмную поступило критичное количество сообщений по поводу озеленения нашего района. С одной стороны - это важный момент, так как на Земле становится нечем дышать. С другой - толпа вспомнила о воздухе только когда им напомнил о том интернет. Нас не коснётся эта проблема ещё несколько лет. Как мы ответим активистам?",
		answ = {
			[1] = "Попросить из бюджета средства на озеленение",
			[2] = "Попросить из бюджета средства на озеленение и не тратить их",
			[3] = "Произнести речь по поводу глобального потепления",
			[4] = "Игнорировать"
		}
	},
	[9] = {
		name = "Еда, за которую стоит умереть",
		text = "К нам пришло экстренное сообщение от Управления по Санитарному Надзору. Оно заявило о том, что в Нью-Йорк провезли партию пищевых продуктов, не прошедших должной сертификации. Это ничего бы не значило в обычной ситуации, однако вторую партию схожей пищи проверили совсем недавно - и у власти по этому поводу плохие новости. Нужно что-то делать.",
		answ = {
			[1] = "Начать поиск заражённых продуктов (-500$)",
			[2] = "Произнести речь и запустить её по новостям",
			[3] = "Применить чрезвычайные полномочия (-400$)",
			[4] = "Игнорировать"
		},
		cost = {
			[1] = 200,
		},
		func = {
			[1] = function()
				Slawer.Mayor.lockdown()
			end,
		}
	},
	[10] = {
		name = "Чёрный и пушистый",
		text = "К вам пришёл чернокожий гражданин в необычно вульгарном виде. Мы его послали подальше из-за неприемлемого поведения, но он крайне настаивал, чтобы мы хотя бы передали вам его слова. ‘Передай шо Сутенёр-по-Имени-Прилизанный хоч инвестировать в бюджет, ток шоб на клуб глаза закрыли на время’. Это выглядит как взятка. Как вы поступите?",
		answ = {
			[1] = "Отдать приказ полиции не трогать ночной клуб",
			[2] = "Отдать приказ полиции устроить рейд на ночной клуб",
			[3] = "Отдать приказ арестовать ‘Прилизанного’",
			[4] = "Игнорировать"
		}
	},
	[11] = {
		name = "Ваше наше",
		text = "Нам пришёл запрос из мэрии - ‘город’ хочет сократить количество открываемых магазинов Microniq в Нью-Йорке в угоду более ‘американским’ компаниям. Они утверждают это запрос ‘экономического’ характера, но американский Microniq давно локализировался. Мы ничего не потеряем бездействием, однако мэрия настаивает. Что будем делать?",
		answ = {
			[1] = "Замедлить продвижение Microniq в Бруклине чередой проверок (-1000$)",
			[2] = "Выслать официальное предупреждение Microniq",
			[3] = "Субсидировать локальные цифровые компании (-600$)",
			[4] = "Игнорировать"
		},
		cost = {
			[1] = 1000,
			[3] = 600,
		},
	},
	[12] = {
		name = "Бюрократическое изобразие",
		text = "Недавно построенный торговый центр Манхеттана раздал места под магазины всем кто смог себе позволить бросить в них деньгами. Ради новой инфраструктуры пришлось снести старую, а это проблема - многие малые бизнесы нашли себе место в Бруклине. А наш район давно находится в ‘юридической изоляции’ из-за чрезвычайной преступности, о чём не знает новый бизнес. Как мы урегулируем бюрократический наплыв?",
		answ = {
			[1] = "Установить приоритет на регистрацию бизнеса локально (-300$)",
			[2] = "Сделать публичное заявление с объяснением нюансов района",
			[3] = "Запросить поддержку у местных юридических фирм (-900$)",
			[4] = "Игнорировать"
		},
		cost = {
			[1] = 300,
			[3] = 900,
		},
	},
	[13] = {
		name = "Синие против красных",
		text = "Ни для кого не секретен конфликт между полицейскими и пожарными. Обе структуры постоянно делают ремарки насчет друг друга. Однако, в каждой шутке лишь доля шутки - и наш район как обычно выделяется особой агрессивностью. Структуры считают это нашей проблемой, и отказываются вмешиваться в трудный район. Что будем делать?",
		answ = {
			[1] = "Собрать командиров участков и станций для решения проблем",
			[2] = "Пустить бюрократию против обоих структур, пока те не успокоятся (-400$)",
			[3] = "Применить чрезвычайные полномочия (-400$)",
			[4] = "Игнорировать"
		},
		cost = {
			[2] = 400,
		},
	},
	[14] = {
		name = "Овцы, волки и пастух",
		text = "Последнюю неделю в районную администрацию обращается всё больше и больше людей - по самым разным мелочам. Почему-то каждый приходящий считает вас за универсального спасителя от всех проблем. Нерабочие лифты, отсутствие парковок, проигрыш в лотерее - во всём виновата районная администрация. Кажется, нападки кто-то организовывает. Как поступим?",
		answ = {
			[1] = "Выделить выходные на просвещение граждан",
			[2] = "Вычислить виновника дезинформации (-400$)",
			[3] = "Нанять больше работников в ратушу (-450$)",
			[4] = "Игнорировать"
		},
		cost = {
			[2] = 400,
			[3] = 450,
		},
	},
	[15] = {
		name = "Доказательство концепции",
		text = "Некоторые до сих пор считают ратушу - мэрией, а вас - мэром, а не его ‘помощником’. За любое неудобство в своей жизни, люди угрожают следовать ‘заветам отцов-основателей’ - идти убивать представителей власти, лишь бы это сделать. Личная неприязнь? Избалованность? Это не важно - важен сам факт такого настроя. Из-за этого районную администрацию и реализовали. Что будете делать?",
		answ = {
			[1] = "Усилить контроль над документами (-250$)",
			[2] = "Изучить первопричины коренных проблем (-500$)",
			[3] = "Попросить поддержку у мэрии (-1000$)",
			[4] = "Игнорировать"
		},
		cost = {
			[1] = 250,
			[2] = 500,
			[3] = 1000,
		},
	},
	[16] = {
		name = "Доказательство концепции",
		text = "Внеплановое составление статистики показало нулевой эффект от реформ. Как оказалось, постоянная выдача лицензий каждому встречному серьёзно легализирует преступность. Хотя суть районной администрации - решить все проблемы района, дабы избавиться от юридической изоляции. Мэрия смотрит на вас, как на главного подозреваемого. Что будете делать?",
		answ = {
			[1] = "Провести аудит бизнесов, появившихся в ваш срок (-800$)",
			[2] = "Изъять разрешения на оружие у граждан без прозрачности жизни (-800$)",
			[3] = "Предложить мэрии полное содействие в расследовании",
			[4] = "Игнорировать"
		},
		cost = {
			[1] = 800,
			[2] = 800,
		},
	},
}